{
  "category": "ACTOR-CAMPAIGN",
  "description": "Cluster designed for tagging OSINT artifacts that relate to OSRS artifacts that describe malicious actors and campaigns.",
  "name": "OSRS Actors & Campaigns",
  "source": "OSRS DEV",
  "type": "CMCF-BLOCK-OSRS",
  "uuid": "deb05256-49bf-11ea-b77f-2e728ce88125",
  "values": [
	{
      "description": "Threat actor identified by Advanced Intelligence LLC researchers and is attributed to selling Access-As-A-Service (AAAS) to groups seeking to deploy Sodinokibi (a.k.a. REvil) ransomware.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Actors & Campaigns"
        ],
        "refs": [
          "https://www.advanced-intel.com/post/digital-pharmacusa-complexity-of-underground-syndicates-behind-2019-rise-of-targeted-ransomware"
        ],
        "synonyms": [
        "truniger"
        ]
      },
      "uuid": "f341ef38-2825-11ea-978f-2e728ce88125",
      "value": "OSRS Actors AND Campaigns: -TMT-"
    },
	{
      "description": "A China-nexus dual espionage and financially-focused group, APT41 targets industries such as gaming, healthcare, high-tech, higher education, telecommunications, and travel services. APT41 is known to adapt quickly to changes and detections within victim environments, often recompiling malware within hours of incident responder activity. In multiple situations, we also identified APT41 utilizing recently-disclosed vulnerabilities, often weaponzing and exploiting within a matter of days.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Actors & Campaigns"
        ],
        "refs": [
          "https://www.fireeye.com/blog/threat-research/2019/08/game-over-detecting-and-stopping-an-apt41-operation.html"
        ]
      },
      "uuid": "e60cd01c-4134-11ea-b77f-2e728ce88125",
      "value": "OSRS Actors AND Campaigns: APT41"
    },
	{
      "description": "Achilles is an English-speaking threat actor primarily operating on various English-language underground hacking forums as well as through secure messengers. Achilles specializes in obtaining accesses to high-value corporate internal networks. Achilles victims are primarily private sector entities; however, the actor also targeted public domains, government-affiliated companies, and international organizations. Targeted verticals include defense, energy, tourism, finance, real estate, and information technology. Achilles was likely operating under the alias the.Joker on a now-defunct top-tier English-language darkweb forum KickAss as they made an identical offer using both aliases. The actor may be potentially affiliated with an Iranian cybercrime domain; however, this association may only be supported by secondary evidence.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Actors & Campaigns"
        ],
        "refs": [
          "https://www.advanced-intel.com/blog/achilles-hacker-behind-attacks-on-military-shipbuilders-unicef-international-corporations"
        ],
        "synonyms": [
        "the.Joker"
        ]
      },
      "uuid": "e60cd29c-4134-11ea-b77f-2e728ce88125",
      "value": "OSRS Actors AND Campaigns: Achilles"
    },
	{
      "description": "Unit 42 refers to the activity described in this blog as the Aggah Campaign based on the actor’s alias hagga, which was used to split data sent to the RevengeRAT C2 server and was the name of one of the Pastebin accounts used to host the RevengeRAT payloads.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Actors & Campaigns"
        ],
        "refs": [
          "https://unit42.paloaltonetworks.com/aggah-campaign-bit-ly-blogspot-and-pastebin-used-for-c2-in-large-scale-campaign/"
        ]
      },
      "uuid": "e60cd404-4134-11ea-b77f-2e728ce88125",
      "value": "OSRS Actors AND Campaigns: Aggah Campaign"
    },
	{
      "description": "Beapy is a cryptojacking campaign impacting enterprises that uses the EternalBlue exploit and stolen and hardcoded credentials to spread rapidly across networks.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Actors & Campaigns"
        ],
        "refs": [
          "https://securityaffairs.co/wordpress/84512/malware/beapy-miner-eternalblue-doublepulsar.html"
        ]
      },
      "uuid": "e60cd544-4134-11ea-b77f-2e728ce88125",
      "value": "OSRS Actors AND Campaigns: Beapy"
    },
	{
      "description": "Another nomenclature for the threat actor Lotus Blossom. Billbug is a long-established espionage group, active since at least January 2009. Similar to the Thrip sub-group, the wider Billbug group is known for specializing in operations against targets in South Asia. Billbug targets are usually compromised by either spear-phishing emails or watering hole attacks. The group spear-phishing attacks have tended to use exploits in Microsoft Office and PDF documents to drop its malware onto victims computers. To date, many of the group targets have been governments or military organizations.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Actors & Campaigns"
        ],
        "refs": [
          "https://www.symantec.com/blogs/threat-intelligence/thrip-apt-south-east-asia"
        ],
        "synonyms": [
        "Lotus Blossom"
        ]
      },
      "uuid": "e60cd8b4-4134-11ea-b77f-2e728ce88125",
      "value": "OSRS Actors AND Campaigns: Billbug"
    },
	{
      "description": "Campaign discovered by Cisco Talos with suspected links to the threat actor MuddyWater. Targets primarily included Turkey-based entities. TTP includes use of Powershell and weaponized documents.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Actors & Campaigns"
        ],
        "refs": [
          "https://blog.talosintelligence.com/2019/05/recent-muddywater-associated-blackwater.html"
        ]
      },
      "uuid": "e60cd9f4-4134-11ea-b77f-2e728ce88125",
      "value": "OSRS Actors AND Campaigns: BlackWater Campaign"
    },
	{
      "description": "Boris Bullet-Dodger is the threat actor claiming responsibility for the hack of Perceptics. Perceptics is a leader in license plate readers (LPRs), license plate recognition systems and vehicle identification products. The company was hacked and attackers stole data and offered business plans, financial documents, and personal information for free on the dark web.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Actors & Campaigns"
        ],
        "refs": [
          "https://securityaffairs.co/wordpress/86177/data-breach/perceptics-hacked.html"
        ]
      },
      "uuid": "e60cdb20-4134-11ea-b77f-2e728ce88125",
      "value": "OSRS Actors AND Campaigns: Boris Bullet-Dodger"
    },
	{
      "description": "A cyberespionage campaign targeting Middle Eastern countries. Name based on the malware’s code in the package named golf. The malware involved, is notable for its wide range of cyberespionage capabilities. Malicious codes are embedded in apps that the operators repackaged from legitimate applications. Monitoring the command and control (C&C) servers used by Bouncing Golf, observed more than 660 Android devices infected with GolfSpy. Much of the information being stolen appear to be military-related.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Actors & Campaigns"
        ],
        "refs": [
          "https://blog.trendmicro.com/trendlabs-security-intelligence/mobile-cyberespionage-campaign-bouncing-golf-affects-middle-east/"
        ]
      },
      "uuid": "e60cdc42-4134-11ea-b77f-2e728ce88125",
      "value": "OSRS Actors AND Campaigns: Bouncing Golf"
    },
	{
      "description": "Campaign identified by the cybersecurity vendor TrendMicro. The campaign used masquerading as legitimate Android apps to lure victims into using the applications and then stealing user as well as system information.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Actors & Campaigns"
        ],
        "refs": [
          "https://blog.trendmicro.com/trendlabs-security-intelligence/mobile-cyberespionage-campaign-distributed-through-callerspy-mounts-initial-phase-of-a-targeted-attack/"
        ]
      },
      "uuid": "e60cdd64-4134-11ea-b77f-2e728ce88125",
      "value": "OSRS Actors AND Campaigns: CallerSpy Campaign"
    },
	{
      "description": "An Iran-linked APT known as Chafer has been spotted targeting various entities based in Iran with an enhanced version of a custom malware that takes a very unique approach to communication by using the Microsoft Background Intelligent Transfer Service (BITS) mechanism over HTTP.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Actors & Campaigns"
        ],
        "refs": [
          "https://malpedia.caad.fkie.fraunhofer.de/actor/sandcat"
        ]
      },
      "uuid": "e60cde90-4134-11ea-b77f-2e728ce88125",
      "value": "OSRS Actors AND Campaigns: Chafer"
    },
	{
      "description": "Charming Kitten, also known as APT35 or Ajax, is an Iranian cyberespionage group active since 2014. Their primary targets are Iranian experts working in the Academy, human rights activists and media personnel. Most victims are in the Middle East, US and the UK.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Actors & Campaigns"
        ],
        "refs": [
          "https://www.clearskysec.com/wp-content/uploads/2019/09/The-Kittens-Are-Back-in-Town-Charming-Kitten-Sep-2019.pdf"
        ],
        "synonyms": [
        "APT35",
		"Ajax",
		"Phosphorus"
        ]
      },
      "uuid": "6a19ccce-4136-11ea-b77f-2e728ce88125",
      "value": "OSRS Actors AND Campaigns: Charming Kitten (Threat Actor Group)"
    },
	{
      "description": "Operates like FIN7. At the end of 2018, while searching for new FIN7 campaigns via telemetry, we discovered a set of activity that we temporarily called CopyPaste from a previously unknown APT. Interestingly, this actor targeted financial entities and companies in one African country, which lead us to think that CopyPaste was associated with cybermercenaries or a training center.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Actors & Campaigns"
        ],
        "refs": [
          "https://securelist.com/fin7-5-the-infamous-cybercrime-rig-fin7-continues-its-activities/90703/"
        ]
      },
      "uuid": "6a19cf26-4136-11ea-b77f-2e728ce88125",
      "value": "OSRS Actors AND Campaigns: CopyPaste"
    },
	{
      "description": "Threat actor attributed to building the DarkUniverse Framework. Syria, Iran, Afghanistan, Tanzania, Ethiopia, Sudan, Russia, Belarus and the United Arab Emirates. The victims included both civilian and military organizations.This APT has been active for at least eight years, from 2009 until 2017. It is assess with medium confidence that DarkUniverse is a part of the ItaDuke set of activities due to unique code overlaps. ItaDuke is an actor known since 2013. ItaDuke used PDF exploits for dropping malware and Twitter accounts to store C2 server urls.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Actors & Campaigns"
        ],
        "refs": [
          "https://securelist.com/darkuniverse-the-mysterious-apt-framework-27/94897/"
        ]
      },
      "uuid": "6a19d07a-4136-11ea-b77f-2e728ce88125",
      "value": "OSRS Actors AND Campaigns: DarkUniverse"
    },
	{
      "description": "The author of the 16Shop phishing kit. This actor was involved in the Indonesian hacking group Indonesian Cyber Army. Several websites were defaced by this group and tagged by DevilScreaM in 2012. DevilScreaM also created the site Newbie-Security.or.id, an Indonesian site of hacking tools frequented by members of the Indonesian Cyber Army. DevilScreaM stopped defacing websites and created an anti-malware product, ScreaMAV, for the Indonesian market. This white hat activity did not last. In mid-2013 they began defacing sites again and posting exploits on 0day.today mostly around WordPress vulnerabilities. DevilScreaM’s GitHub page contains various tools, including a PHP remote shell used on compromised websites as well as commits on the z1miner Monero (XMR) miner tool. in late 2017 DevilScreaM created the 16Shop phishing kit and set up a Facebook group to sell licenses and support. In November 2018. this private group had over 200 members. We checked the group in mid-June 2019 and it now has over 300 members and over 200 posts. Despite the questionable content, the group not only persists unchanged on social media, but continues to grow.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Actors & Campaigns"
        ],
        "refs": [
          "https://en.wikipedia.org/wiki/Threat_actor"
        ]
      },
      "uuid": "6a19d1ba-4136-11ea-b77f-2e728ce88125",
      "value": "OSRS Actors AND Campaigns: DevilScreaM"
    },
	{
      "description": "Threat group attributed with releasing sensitive information belonging to the Cayman National Bank. It is believed that this group did not directly hack the bank. Rather the information was obtained via another threat actor Phineas Fisher.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Actors & Campaigns"
        ],
        "refs": [
          "https://securityaffairs.co/wordpress/94136/data-breach/cayman-national-bank-data-leak.html"
        ]
      },
      "uuid": "6a19d4f8-4136-11ea-b77f-2e728ce88125",
      "value": "OSRS Actors AND Campaigns: Distributed Denial of Secrets"
    },
	{
      "description": "Through the use of mobile applications, those behind the attack use fake decoy content to entice their victims to download such applications, which are in fact loaded with spyware, to then collect sensitive information about them. Interestingly, these targets include Kurdish and Turkish natives and ISIS supporters. Most interesting of all, though, is that all these targets are actually Iranians citizens.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Actors & Campaigns"
        ],
        "refs": [
          "https://research.checkpoint.com/domestic-kitten-an-iranian-surveillance-operation/"
        ]
      },
      "uuid": "6a19d64c-4136-11ea-b77f-2e728ce88125",
      "value": "OSRS Actors AND Campaigns: Domestic Kitten"
    },
	{
      "description": "Chinese threat actor group that targets the Uyghur population within China.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Actors & Campaigns"
        ],
        "refs": [
          "https://thenextweb.com/security/2019/09/03/uyghur-muslims-targeted-by-surveillance-campaign-affected-not-just-ios-but-android-too/",
		  "https://thenextweb.com/security/2019/09/25/mobile-malware-campaign-targeting-uyghur-muslims-impacted-tibetans-too/",
		  "https://www.volexity.com/blog/2019/09/02/digital-crackdown-large-scale-surveillance-and-exploitation-of-uyghurs/",
		  "https://citizenlab.ca/2019/09/poison-carp-tibetan-groups-targeted-with-1-click-mobile-exploits/"
        ]
      },
      "uuid": "6a19d778-4136-11ea-b77f-2e728ce88125",
      "value": "OSRS Actors AND Campaigns: Evil Eye"
    },
	{
      "description": "Threat actor attributed to targeted attacks against officials within government finance authorities and representatives in several embassies in Europe. The attack, which starts with a malicious attachment disguised as a top secret US document, weaponizes TeamViewer, the popular remote access and desktop sharing software, to gain full control of the infected computer.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Actors & Campaigns"
        ],
        "refs": [
          "https://research.checkpoint.com/finteam-trojanized-teamviewer-against-government-targets/"
        ]
      },
      "uuid": "6a19d8a4-4136-11ea-b77f-2e728ce88125",
      "value": "OSRS Actors AND Campaigns: FINTEAM"
    },
	{
      "description": "Frankenstein — the name refers to the actor(s) ability to piece together several unrelated components — leveraged four different open-source techniques to build the tools used during the campaign. The campaign used components of (1) An article to detect when your sample is being run in a VM, (2) A GitHub project that leverages MSbuild to execute a PowerShell command, (3) A component of GitHub project called Fruityc2 to build a stager, and (4) A GitHub project called PowerShell Empire for their agents. The actor(s) preference for open-source solutions appears to be part of a broader trend in which adversaries are increasingly using publicly available solutions, possibly to improve operational security.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Actors & Campaigns"
        ],
        "refs": [
          "https://blog.talosintelligence.com/2019/06/frankenstein-campaign.html"
        ]
      },
      "uuid": "6a19d9da-4136-11ea-b77f-2e728ce88125",
      "value": "OSRS Actors AND Campaigns: Frankenstien Campaign"
    },
	{
      "description": "Threat actor identified by cybersecurity vendor RiskIQ. This threat actor leverages phishing along with card skimming attacks like Magecart. While the two parts of this group’s operation are mainly split, there is a slight overlap in their attack infrastructure on domain-to-IP address resolution data, which is shown in the middle. The sales platforms this group operates also have infrastructure overlap with the infrastructure tied to the group’s operations that steal cards or payment credentials.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Actors & Campaigns"
        ],
        "refs": [
          "https://www.riskiq.com/blog/labs/fullz-house/"
        ]
      },
      "uuid": "6a19db06-4136-11ea-b77f-2e728ce88125",
      "value": "OSRS Actors AND Campaigns: Full(z) House"
    },
	{
      "description": "Fxmsp is a high-profile Russian and English speaking hacking collective. They specialize in breaching highly secure protected networks to access private corporate and government information. They have a long-standing reputation for selling sensitive information from high-profile global government and corporate entities.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Actors & Campaigns"
        ],
        "refs": [
          "https://www.advanced-intel.com/blog/top-tier-russian-hacking-collective-claims-breaches-of-three-major-anti-virus-companies"
        ]
      },
      "uuid": "a634eba2-413c-11ea-b77f-2e728ce88125",
      "value": "OSRS Actors AND Campaigns: Fxmsp"
    },
	{
      "description": "Nomenclature given to a threat actor group that notably leverages the TrickBot malware family.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Actors & Campaigns"
        ],
        "refs": [
          "https://www.secureworks.com/blog/trickbot-modifications-target-us-mobile-users"
        ]
      },
      "uuid": "a634ee68-413c-11ea-b77f-2e728ce88125",
      "value": "OSRS Actors AND Campaigns: GOLD BLACKBURN"
    },
	{
      "description": "GnosticPlayers has been responsible for some of the largest data dumps recorded. Along with the Australian company Canva they have also been responsible for the following...Pizap (Photo editor) — 60 million, Jobandtalent (Online job portal) — 11 million, Gfycat (GIF hosting service) — 8 million, Storybird (Online publishing platform) — 4 million, Legendas.tv (Movie streaming site) — 3.8 million, Onebip (Mobile payment service) — 2.6 million, Classpass (Fitness and Yoga center) — 1.5 million, and Streeteasy (Real estate) — 990,000 (1 million).",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Actors & Campaigns"
        ],
        "refs": [
          "https://www.databreaches.net/australian-tech-unicorn-canva-suffers-security-breach/",
		  "https://securityaffairs.co/wordpress/81340/breaking-news/gnosticplayers-data-breaches.html",
		  "https://www.scmagazine.com/home/security-news/a-hacker-dubbed-gnosticplayers-and-is-known-for-selling-personal-information-recently-posted-26-42-million-stolen-user-records-for-sale-on-the-dark-web/"
        ]
      },
      "uuid": "a634efb2-413c-11ea-b77f-2e728ce88125",
      "value": "OSRS Actors AND Campaigns: GnosticPlayers"
    },
	{
      "description": "A campaign identified by TrendMicro researchers that leverages phishing attacks to steal PayPal and credit card information.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Actors & Campaigns"
        ],
        "refs": [
          "https://blog.trendmicro.com/trendlabs-security-intelligence/heatstroke-campaign-uses-multistage-phishing-attack-to-steal-paypal-and-credit-card-information/"
        ]
      },
      "uuid": "a634f1e2-413c-11ea-b77f-2e728ce88125",
      "value": "OSRS Actors AND Campaigns: Heatstroke"
    },
	{
      "description": "The group targeted third-party companies, like telco service providers, to hit the final target in a classic supply chain attack. HEXANE leverages on weaponized documents used to drop the malware and compromise the target network. The threat actor shows similarities with other groups such as Magnallium and Chrysene, both active since at least 2017 and involved in attacks on oil and gas companies. Anyway, experts pointed out that the Hexane group has differed TTPs and has its own arsenal. Stylistically, the observed tradecraft resembles activity from groups such as COBALT GYPSY (which is related to OilRig, Crambus, and APT34) and COBALT TRINITY (also known as Elfin and APT33). However, none of the collected malware or infrastructure associated with LYCEUM has direct links to observed activity from these or other known threat groups. As of this publication, there is insufficient technical evidence to support an attribution assessment. When CTU researchers first published information about LYCEUM to Secureworks Threat Intelligence clients, no public documentation on the group existed. Since then, reporting has emerged that refers to the threat group as HEXANE.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Actors & Campaigns"
        ],
        "refs": [
          "https://securityaffairs.co/wordpress/89249/apt/hexane-threat-actor.html",
		  "https://www.secureworks.com/blog/lyceum-takes-center-stage-in-middle-east-campaign"
        ],
        "synonyms": [
        "Lyceum"
        ]
      },
      "uuid": "a634f322-413c-11ea-b77f-2e728ce88125",
      "value": "OSRS Actors AND Campaigns: Hexane"
    },
	{
      "description": "INDRIK SPIDER is a sophisticated eCrime group that has been operating Dridex since June 2014. In 2015 and 2016, Dridex was one of the most prolific eCrime banking trojans on the market and, since 2014, those efforts are thought to have netted INDRIK SPIDER millions of dollars in criminal profits. Throughout its years of operation, Dridex has received multiple updates with new modules developed and new anti-analysis features added to the malware. In August 2017, a new ransomware variant identified as BitPaymer was reported to have ransomed the U.K.’s National Health Service (NHS), with a high ransom demand of 53 BTC (approximately $200,000 USD). The targeting of an organization rather than individuals, and the high ransom demands, made BitPaymer stand out from other contemporary ransomware at the time. Though the encryption and ransom functionality of BitPaymer was not technically sophisticated, the malware contained multiple anti-analysis features that overlapped with Dridex. Later technical analysis of BitPaymer indicated that it had been developed by INDRIK SPIDER, suggesting the group had expanded its criminal operation to include ransomware as a monetization strategy.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Actors & Campaigns"
        ],
        "refs": [
          "https://www.crowdstrike.com/blog/doppelpaymer-ransomware-and-dridex-2/",
		  "https://malpedia.caad.fkie.fraunhofer.de/actor/indrik_spider"
        ]
      },
      "uuid": "a634f534-413c-11ea-b77f-2e728ce88125",
      "value": "OSRS Actors AND Campaigns: INDIRK SPIDER"
    },
	{
      "description": "Additional nomenclature for threat actor FIN6.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Actors & Campaigns"
        ],
        "refs": [
          "https://securityintelligence.com/posts/more_eggs-anyone-threat-actor-itg08-strikes-again/"
        ],
        "synonyms": [
        "FIN6"
        ]
      },
      "uuid": "a634f674-413c-11ea-b77f-2e728ce88125",
      "value": "OSRS Actors AND Campaigns: ITG08"
    },
	{
      "description": "Research indicates that the attack on Parliament is a part of a multi-year cyberespionage campaign orchestrated by a nation-state actor whom we are calling IRIDIUM. This actor targets sensitive government, diplomatic, and military resources in the countries comprising the Five Eyes intelligence alliance (which includes Australia, Canada, New Zealand, the United Kingdom and the United States).",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Actors & Campaigns"
        ],
        "refs": [
          "https://malpedia.caad.fkie.fraunhofer.de/actor/iridium",
		  "https://resecurity.com/blog/parliament_races/",
		  "https://www.nbcnews.com/politics/national-security/iranian-backed-hackers-stole-data-major-u-s-government-contractor-n980986",
		  "https://www.zdnet.com/article/citrix-discloses-security-breach-of-internal-network/"
        ]
      },
      "uuid": "a634f7a0-413c-11ea-b77f-2e728ce88125",
      "value": "OSRS Actors AND Campaigns: Iridium"
    },
	{
      "description": "ItaDuke uses PDF exploits to deliver malware to their targets, which also include the exploitation of CVE-2013-0158, CVE-2010-3333, and CVE-2009-0563. It is assessed that ItaDuke targeted Tibetan and Uyghur activists. Earliest reports regarding ItaDuke date to March, 2013.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Actors & Campaigns"
        ],
        "refs": [
          "https://securelist.com/new-uyghur-and-tibetan-themed-attacks-using-pdf-exploits/35465/"
        ]
      },
      "uuid": "a634f9c6-413c-11ea-b77f-2e728ce88125",
      "value": "OSRS Actors AND Campaigns: ItaDuke"
    },
	{
      "description": "A Capesand campaign that uses a particular obfuscation tool who's strings are KurdishCoder.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Actors & Campaigns"
        ],
        "refs": [
          "https://blog.trendmicro.com/trendlabs-security-intelligence/obfuscation-tools-found-in-the-capesand-exploit-kit-possibly-used-in-kurdishcoder-campaign/"
        ]
      },
      "uuid": "a634fafc-413c-11ea-b77f-2e728ce88125",
      "value": "OSRS Actors AND Campaigns: KurdishCoder Campaign"
    },
	{
      "description": "A credential harvesting campaign that mostly targets South Asian governments.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Actors & Campaigns"
        ],
        "refs": [
          "https://www.netscout.com/blog/asert/lucky-elephant-campaign-masquerading"
        ]
      },
      "uuid": "bcd84456-413e-11ea-b77f-2e728ce88125",
      "value": "OSRS Actors AND Campaigns: LUCKY ELEPHANT"
    },
	{
      "description": "Leviathan is an espionage actor targeting organizations and high-value targets in defense and government. Active since at least 2014, this actor has long-standing interest in maritime industries, naval defense contractors, and associated research institutions in the United States and Western Europe.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Actors & Campaigns"
        ],
        "refs": [
          "https://malpedia.caad.fkie.fraunhofer.de/actor/leviathan"
        ],
        "synonyms": [
        "TEMP.Periscope",
		"TEMP.Jumper",
		"APT 40",
		"APT40"
        ]
      },
      "uuid": "bcd84816-413e-11ea-b77f-2e728ce88125",
      "value": "OSRS Actors AND Campaigns: Leviathan"
    },
	{
      "description": "Threat actor group discovered by Group-IB known for conducting fraudulent activities masquerading as legitimate web sites and applications.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Actors & Campaigns"
        ],
        "refs": [
          "https://securityaffairs.co/wordpress/89287/cyber-crime/lotsy-group-scam-campaigns.html"
        ]
      },
      "uuid": "bcd84974-413e-11ea-b77f-2e728ce88125",
      "value": "OSRS Actors AND Campaigns: Lotsy"
    },
	{
      "description": "The Luhansk People's Republic, also known as Lugansk People's Republic, usually abbreviated as LPR or LNR, is a landlocked proto-state in the Donbass region, in eastern Ukraine. Along with the Donetsk People's Republic DPR, the LPR declared independence from Ukraine in the aftermath of the 2014 Ukrainian revolution. An armed conflict with Ukraine followed its declaration of independence, during which the LPR and DPR received military and humanitarian assistance from Russia. This conflict is still ongoing as of April 2019. LPR remains unrecognized by any UN member state, including Russia—although Russia recognizes documents issued by the LPR government, such as identity documents, diplomas, birth and marriage certificates and vehicle registration plates.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Actors & Campaigns"
        ],
        "refs": [
          "https://en.wikipedia.org/wiki/Luhansk_People%27s_Republic"
        ]
      },
      "uuid": "bcd84aaa-413e-11ea-b77f-2e728ce88125",
      "value": "OSRS Actors AND Campaigns: Luhansk People's Republic"
    },
	{
      "description": "Group 4 is described as advanced and uses techniques to blend in with normal traffic. For instance, Magecart will register domain names that appear to be tied to advertisers or analytic providers. Another interesting aspect from the report is that Group 4 is suspected to have had a history in banking malware.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Actors & Campaigns"
        ],
        "refs": [
          "https://blog.malwarebytes.com/threat-analysis/2019/10/magecart-group-4-a-link-with-cobalt-group/"
        ]
      },
      "uuid": "bcd84be0-413e-11ea-b77f-2e728ce88125",
      "value": "OSRS Actors AND Campaigns: Magecart Group 4"
    },
	{
      "description": "MG5 uses malicious code designed for injection into benign JavaScript files loaded by commercial-grade layer 7 (L7) routers. These routers are typically used by airports, casinos, hotels and resorts, to name a few. MG5 has likely devised an attack scenario in which it could inject its malicious payment card stealing code into a popular open-source JavaScript library. This open-source code is provided as a free, licensed tool designed to help make websites compatible with mobile browsing. By infecting that code, MG5 can potentially infect and compromise the data of mobile device users that install booby-trapped apps and then shop online.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Actors & Campaigns"
        ],
        "refs": [
          "https://securityintelligence.com/posts/leading-magecart-group-targeting-captive-wi-fi-users-via-l7-routers/"
        ],
        "synonyms": [
        "MG5"
        ]
      },
      "uuid": "bcd84d2a-413e-11ea-b77f-2e728ce88125",
      "value": "OSRS Actors AND Campaigns: Magecart Group 5"
    },
	{
      "description": "The online credit card skimming attack known as Magecart or E-Skimming was actively operating on 3,126 online shops. Data shows that the attack started on September 7, 2019. All of the impacted online shops are hosted on the cloud platform of the e-commerce service provider Volusion, one of the top e-commerce platforms in the market. Discovery of malicious code injected into a JavaScript library provided by Volusion to their client shops. The injected code loaded another JavaScript stored on a Google Storage service. The loaded script is almost a direct copy of a normal JavaScript library but has a credit card skimmer carefully integrated. When customers submit their payment information, the skimmer will copy and send the personal information and credit card details to an exfiltration server belonging to the attackers. During an investigation, it was found that the attackers seemed more experienced and thoughtful than many other skimmer groups. They did not simply add their malicious code at the top or end of a script; instead, they carefully integrated the code into the original script to be part of the execution flow of the program. The code was also written as simply as possible, making it difficult to be identified in a big library. Furthermore, they registered the domain of their exfiltration server in a similar style to a legitimate Volusion domain. Considering the modus operandi, it is believed the attackers are from Magecart Group 6, which has also been identified as the notorious threat actor FIN6. Similarities in the code used in this attack and the code used in FIN6’s previous attacks on British Airways and Newegg.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Actors & Campaigns"
        ],
        "refs": [
          "https://blog.trendmicro.com/trendlabs-security-intelligence/fin6-compromised-e-commerce-platform-via-magecart-to-inject-credit-card-skimmers-into-thousands-of-online-shops/"
        ],
        "synonyms": [
        "FIN6"
        ]
      },
      "uuid": "bcd84f32-413e-11ea-b77f-2e728ce88125",
      "value": "OSRS Actors AND Campaigns: Magecart Group 6"
    },
	{
      "description": "Threat actor claiming responsibility for hacking the Murfreesboro Water Department bill payment system.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Actors & Campaigns"
        ],
        "refs": [
          "https://www.databreaches.net/tn-murfreesboro-water-departments-bill-pay-website-hacked/"
        ]
      },
      "uuid": "bcd85072-413e-11ea-b77f-2e728ce88125",
      "value": "OSRS Actors AND Campaigns: Mamad Warning"
    },
	{
      "description": "A campaign that targeted the Italian Naval industry in 2018. The campaign used the MartyMCFly malware against its targets. Several references to this malware and the campaign can be found attached to this cluster item.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Actors & Campaigns"
        ],
        "refs": [
          "https://securityaffairs.co/wordpress/77195/malware/martymcfly-malware-cyber-espionage.html",
		  "https://blog.yoroi.company/research/cyber-espionage-campaign-targeting-the-naval-industry-martymcfly/",
		  "https://marcoramilli.com/2019/10/28/sweed-targeting-precision-engineering-companies-in-italy/",
		  "https://marcoramilli.com/2018/10/17/martymcfly-malware-targeting-naval-industry/"
        ]
      },
      "uuid": "bcd851b2-413e-11ea-b77f-2e728ce88125",
      "value": "OSRS Actors AND Campaigns: MartyMCFly"
    },
	{
      "description": "MassMiner stands out as a worm that not only spreads itself through number of different exploits, but also brute-forces access to Microsoft SQL Servers.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Actors & Campaigns"
        ],
        "refs": [
          "https://www.alienvault.com/blogs/labs-research/massminer-malware-targeting-web-servers",
		  "https://blog.talosintelligence.com/2019/09/panda-evolution.html"
        ]
      },
      "uuid": "bcd852f2-413e-11ea-b77f-2e728ce88125",
      "value": "OSRS Actors AND Campaigns: MassMiner Campaign"
    },
	{
      "description": "Threat actor attributed to attacks against multiple campus store websites on April 14, during which the sites were injected with a malicious skimming script (detected by Trend Micro as Trojan.JS.MIRRORTHEIF.AA) at their payment checkout pages. The skimming script can scrape credit card information, as well as personal details entered on the payment page. The stolen information is consequently sent to a remote server. After looking into this attack, we learned that the attackers compromised PrismWeb, which is an e-commerce platform designed for college stores by company PrismRBS, a subsidiary of Nebraska Book Company.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Actors & Campaigns"
        ],
        "refs": [
          "https://blog.trendmicro.com/trendlabs-security-intelligence/mirrorthief-group-uses-magecart-skimming-attack-to-hit-hundreds-of-campus-online-stores-in-us-and-canada/"
        ]
      },
      "uuid": "7cf22f30-4140-11ea-b77f-2e728ce88125",
      "value": "OSRS Actors AND Campaigns: MirrorThief"
    },
	{
      "description": "The origins of digital espionage remain hidden in the dark. In most cases, codenames and fragments of stories are all that remains of the ‘prehistoric’ actors that pioneered the nowubiquitous practice of computer network exploitation. The origins of early operations, tools, and tradecraft are largely unknown: official documents will remain classified for years and decades to come; memories of investigators are eroding as time passes; and often precious forensic evidence is discarded, destroyed, or simply lost as storage devices age. Even Moonlight Maze, perhaps the oldest publicly acknowledged state actor, has evaded open forensic analysis.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Actors & Campaigns"
        ],
        "refs": [
          "https://media.kasperskycontenthub.com/wp-content/uploads/sites/43/2018/03/07180251/Penquins_Moonlit_Maze_PDF_eng.pdf"
        ]
      },
      "uuid": "7cf2319c-4140-11ea-b77f-2e728ce88125",
      "value": "OSRS Actors AND Campaigns: Moonlight Maze"
    },
	{
      "description": "A phishing campaign targeting Korean and Japanese Android users.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Actors & Campaigns"
        ],
        "refs": [
          "https://securingtomorrow.mcafee.com/other-blogs/mcafee-labs/moqhao-related-android-spyware-targeting-japan-and-korea-found-on-google-play/"
        ],
        "synonyms": [
        "XLoader",
		"Roaming Mantis"
        ]
      },
      "uuid": "7cf232fa-4140-11ea-b77f-2e728ce88125",
      "value": "OSRS Actors AND Campaigns: MoqHao Phishing Campaign"
    },
	{
      "description": "Actor taking credit for the attack on the Bangladesh Oil, Gas and Mineral Corporation Petrobangla.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Actors & Campaigns"
        ],
        "refs": [
          "https://www.databreaches.net/petrobangla-website-hacked-again/"
        ],
        "synonyms": [
        "b33"
        ]
      },
      "uuid": "7cf23430-4140-11ea-b77f-2e728ce88125",
      "value": "OSRS Actors AND Campaigns: N33LOB33"
    },
	{
      "description": "Nansh0u is a China-based campaign which aimed to infect Windows MS-SQL and phpMyAdmin servers worldwide. Breached machines include over 50,000 servers belonging to companies in the healthcare, telecommunications, media and IT sectors. Once compromised, the targeted servers were infected with malicious payloads. These, in turn, dropped a crypto-miner and installed a sophisticated kernel-mode rootkit to prevent the malware from being terminated.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Actors & Campaigns"
        ],
        "refs": [
          "https://www.guardicore.com/2019/05/nansh0u-campaign-hackers-arsenal-grows-stronger/"
        ]
      },
      "uuid": "7cf238b8-4140-11ea-b77f-2e728ce88125",
      "value": "OSRS Actors AND Campaigns: Nansh0u Campaign"
    },
	{
      "description": "#OpJerusalem2019, an operation that was conducted to deliver the JCry ransomware. #OpJerusalem2019 is recently launched a cyber attack against the Israeli Government and the private websites including Coca-Cola, ToysRUs, McDonalds. In result, An anonymous hacker group compromised hundreds of websites and destroyed nearly 1 million Israeli based webpages that belong to some of the leading brands. Attackers goal was “erasing Israel from the Internet” in protest against the Israeli government’s conduct in the Israel-Palestine conflict.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Actors & Campaigns"
        ],
        "refs": [
          "https://securityaffairs.co/wordpress/82030/hacking/opjerusalem-2019-jcry-ransomware.html",
		  "https://gbhackers.com/jcry-ransomware/"
        ]
      },
      "uuid": "7cf23a0c-4140-11ea-b77f-2e728ce88125",
      "value": "OSRS Actors AND Campaigns: OpJerusalem2019"
    },
	{
      "description": "Operation conducted by threat actor TICK (a.k.a. Bronze Butler, RedBaldKnight). Focus of the campaign is to target defense, aerospace, chemical, and satellite industries in Japan who also has subsidiaries in China.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Actors & Campaigns"
        ],
        "refs": [
          "https://blog.trendmicro.com/trendlabs-security-intelligence/operation-endtrade-finding-multi-stage-backdoors-that-tick/"
        ]
      },
      "uuid": "7cf23b2e-4140-11ea-b77f-2e728ce88125",
      "value": "OSRS Actors AND Campaigns: Operation ENDTRADE"
    },
	{
      "description": "The Dukes (aka APT29 and Cozy Bear) have been in the spotlight after their suspected involvement in the breach of the Democratic National Committee in the run-up to the 2016 US elections. Since then, except for a one-off, suspected comeback in November 2018, with a phishing campaign targeting several US-based organizations, no activity has been confidently attributed to the Dukes. This held true until recent months, when we researchers from the cybersecurity vendor ESET uncovered three new malware families that were attribute to the Dukes – PolyglotDuke, RegDuke and FatDuke. These new implants were used until very recently, with the latest observed sample being deployed in June 2019. This means the Dukes have been quite active since 2016, developing new implants and compromising high-value targets. These newly uncovered Dukes activities, collectively, have been placed under the campaign taxonomy Operation Ghost. It is believed by the ESET researchers that Operation Ghost started in 2013 and it is still ongoing.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Actors & Campaigns"
        ],
        "refs": [
          "https://www.welivesecurity.com/2019/10/17/operation-ghost-dukes-never-left/"
        ]
      },
      "uuid": "7cf23c5a-4140-11ea-b77f-2e728ce88125",
      "value": "OSRS Actors AND Campaigns: Operation Ghost"
    },
	{
      "description": "The campaign is named after a GitHub account that provided partial source codes of a malware. An analysis revealed that the malware is a backdoor written in Python. A peculiar Italian-origin malware campaign has been discovered by security researchers. It appears that this campaign has been active since 2016, and came to light only this year. First analyzed by TG Soft and then by Yoroi-Zlab, the attacker group is speculated to be Italian since many file names and scripts were in the Italian language, as well as C2 servers being from Italy. It was also observed that the Pistacchietto campaign targeted both mobile and desktop systems.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Actors & Campaigns"
        ],
        "refs": [
          "https://cyware.com/news/operation-pistacchietto-a-new-italian-malware-campaign-5a32edd6",
		  "https://securityaffairs.co/wordpress/82066/cyber-crime/op-pistacchietto-hacking-campaign.html"
        ]
      },
      "uuid": "7cf23d90-4140-11ea-b77f-2e728ce88125",
      "value": "OSRS Actors AND Campaigns: Operation Pistacchietto"
    },
	{
      "description": "A coordinated operation conducted by law enforcement agencies from Europe, Canada, and the United States targeted vendors and buyers of illegal goods on dark web marketplaces.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Actors & Campaigns"
        ],
        "refs": [
          "https://securityaffairs.co/wordpress/82974/deep-web/operation-sabotor-dark-web.html"
        ]
      },
      "uuid": "7cf23ebc-4140-11ea-b77f-2e728ce88125",
      "value": "OSRS Actors AND Campaigns: Operation SaboTor"
    },
	{
      "description": "Operation ShadowHammer, a newly discovered supply chain attack that leveraged ASUS Live Update software.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Actors & Campaigns"
        ],
        "refs": [
          "https://securelist.com/operation-shadowhammer/89992/"
        ]
      },
      "uuid": "09de1b4c-4142-11ea-b77f-2e728ce88125",
      "value": "OSRS Actors AND Campaigns: Operation ShadowHammer"
    },
	{
      "description": "Operation Windigo – the vivisection of a large Linux server-side credential-stealing malware campaign. The gang behind Operation Windigo uses infected systems to steal credentials, redirect web traffic to malicious content, and send spam messages.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Actors & Campaigns"
        ],
        "refs": [
          "https://www.welivesecurity.com/2014/03/18/operation-windigo-the-vivisection-of-a-large-linux-server-side-credential-stealing-malware-campaign/"
        ]
      },
      "uuid": "09de1dfe-4142-11ea-b77f-2e728ce88125",
      "value": "OSRS Actors AND Campaigns: Operation Windigo"
    },
	{
      "description": "Operation WizardOpium, name give by cybersecurity vendor Kaspersky, leveraged CVE-2019-13720 to attract and exploit individuals using compromised websites.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Actors & Campaigns"
        ],
        "refs": [
          "https://securelist.com/chrome-0-day-exploit-cve-2019-13720-used-in-operation-wizardopium/94866/"
        ]
      },
      "uuid": "09de1f52-4142-11ea-b77f-2e728ce88125",
      "value": "OSRS Actors AND Campaigns: Operation WizardOpium"
    },
	{
      "description": "The Outlaw Hacking Group is typically responsible for DDoS attacks against organizations. They also offer DDoS as a service to the online gaming community.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Actors & Campaigns"
        ],
        "refs": [
          "https://blog.trendmicro.com/trendlabs-security-intelligence/outlaw-hacking-groups-botnet-observed-spreading-miner-perl-based-backdoor/"
        ]
      },
      "uuid": "09de26c8-4142-11ea-b77f-2e728ce88125",
      "value": "OSRS Actors AND Campaigns: Outlaw Hacking Group"
    },
	{
      "description": "For three years, Unit 42 has tracked a set of cyber espionage attack campaigns across Asia, which used a mix of publicly available and custom malware. Unit 42 created the moniker PKPLUG for the threat actor group, or groups, behind these and other documented attacks referenced later in this report. The name comes from the tactic of delivering PlugX malware inside ZIP archive files as part of a DLL side-loading package. The ZIP file format contains the ASCII magic-bytes PK in its header, hence PKPLUG. While tracking these attackers, Unit 42 discovered additional, mostly custom malware families being used by PKPLUG beyond that of just PlugX. The additional payloads include HenBox, an Android app, and Farseer, a Windows backdoor. The attackers also use the 9002 Trojan, which is believed to be shared among a small subset of attack groups. Other publicly available malware seen in relation to PKPLUG activity includes Poison Ivy and Zupdax. Currently victims lay mainly in and around the Southeast Asia region, particularly Myanmar, Taiwan, Vietnam, and Indonesia; and likely also in various other areas in Asia, such as Tibet, Xinjiang, and Mongolia. Based on targeting, content in some of the malware and ties to infrastructure previously documented publicly as being linked to Chinese nation-state adversaries, Unit 42 believes with high confidence that PKPLUG has similar origins.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Actors & Campaigns"
        ],
        "refs": [
          "https://unit42.paloaltonetworks.com/pkplug_chinese_cyber_espionage_group_attacking_asia/"
        ]
      },
      "uuid": "09de284e-4142-11ea-b77f-2e728ce88125",
      "value": "OSRS Actors AND Campaigns: PKPLUG"
    },
	{
      "description": "Between November 2018 and May 2019, senior members of Tibetan groups received malicious links in individually tailored WhatsApp text exchanges with operators posing as NGO workers, journalists, and other fake personas. The links led to code designed to exploit web browser vulnerabilities to install spyware on iOS and Android devices, and in some cases to OAuth phishing pages. This campaign was carried out by what appears to be a single threat operator POISON CARP. POISON CARP employs a total of eight Android browser exploits and one Android spyware kit, as well as one iOS exploit chain and iOS spyware. None of the exploits observed were zero days. POISON CARP overlaps with two recently reported campaigns against the Uyghur community. The iOS exploit and spyware we observed was used in watering hole attacks reported by Google Project Zero, and a website used to serve exploits by POISON CARP was also observed in a campaign called Evil Eye reported by Volexity. The Android malware used in the campaign is a fully featured spyware kit that has not been previously documented. POISON CARP appears to have used Android browser exploits from a variety of sources. In one case, POISON CARP used a working exploit publicly released by Exodus Intelligence for a Google Chrome bug that was fixed in source, but whose patch had not yet been distributed to Chrome users. In other cases, POISON CARP used lightly modified versions of Chrome exploit code published on the personal GitHub pages of a member of Qihoo 360’s Vulcan Team, a member of Tencent’s Xuanwu Lab, and by a Google Project Zero member on the Chrome Bug Tracker. This campaign is the first documented case of one-click mobile exploits used to target Tibetan groups, and reflects an escalation in the sophistication of digital espionage threats targeting the community.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Actors & Campaigns"
        ],
        "refs": [
          "https://citizenlab.ca/2019/09/poison-carp-tibetan-groups-targeted-with-1-click-mobile-exploits/"
        ]
      },
      "uuid": "09de2a88-4142-11ea-b77f-2e728ce88125",
      "value": "OSRS Actors AND Campaigns: POISON CARP"
    },
	{
      "description": "Panda has generated thousands of dollars worth of the Monero cryptocurrency through the use of remote access tools (RATs) and illicit cryptocurrency-mining malware. Panda's willingness to persistently exploit vulnerable web applications worldwide, their tools allowing them to traverse throughout networks, and their use of RATs, means that organizations worldwide are at risk of having their system resources misused for mining purposes or worse, such as exfiltration of valuable information. Panda has shown time and again they will update their infrastructure and exploits on the fly as security researchers publicize indicators of compromises and proof of concepts.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Actors & Campaigns"
        ],
        "refs": [
          "https://blog.talosintelligence.com/2019/09/panda-evolution.html"
        ]
      },
      "uuid": "09de2bc8-4142-11ea-b77f-2e728ce88125",
      "value": "OSRS Actors AND Campaigns: Panda"
    },
	{
      "description": "Threat actor attributed for hacking and stealing information from the spyware maker Hacking Team. Denies working for Russian government, and has released several sensitive databases to the public. Along with the release of Hacking Team data, Phineas Fisher has also targetd banks and oil companies.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Actors & Campaigns"
        ],
        "refs": [
          "https://securityaffairs.co/wordpress/94136/data-breach/cayman-national-bank-data-leak.html",
		  "https://www.vice.com/en_us/topic/phineas-fisher",
		  "https://www.vice.com/en_us/article/qv7y8m/vigilante-hacker-phineas-fisher-denies-working-for-the-russian-government",
		  "https://www.vice.com/en_us/article/vb5agy/phineas-fisher-offers-dollar100000-bounty-for-hacks-against-banks-and-oil-companies"
        ]
      },
      "uuid": "09de2cf4-4142-11ea-b77f-2e728ce88125",
      "value": "OSRS Actors AND Campaigns: Phineas Fisher"
    },
	{
      "description": "Threat actor identified by the cybersecurity vendor Kaspersky and associated with the RevengHotels campaign.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Actors & Campaigns"
        ],
        "refs": [
          "https://securelist.com/revengehotels/95229/"
        ]
      },
      "uuid": "09de2e16-4142-11ea-b77f-2e728ce88125",
      "value": "OSRS Actors AND Campaigns: ProCC Threat Actor"
    },
	{
      "description": "Threat actor identified by the cybersecurity vendor Kaspersky and associated with the RevengHotels campaign.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Actors & Campaigns"
        ],
        "refs": [
          "https://securelist.com/revengehotels/95229/"
        ]
      },
      "uuid": "09de2f38-4142-11ea-b77f-2e728ce88125",
      "value": "OSRS Actors AND Campaigns: RevengHotels Threat Actor"
    },
	{
      "description": "Campaign idenditified by the cybersecurity vendor Kaspersky. Campaign focused on targeting the hotel and hospitality industries in Brazil, Argentina, Bolivia, Chile, Costa Rica, France, Italy, Mexico, Portugal, Spain, Thailand and Turkey. The goal of the campaign is to capture credit card data from guests and travelers stored in hotel systems, as well as credit card data received from popular online travel agencies (OTAs) such as Booking.com.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Actors & Campaigns"
        ],
        "refs": [
          "https://securelist.com/revengehotels/95229/"
        ]
      },
      "uuid": "b0977b90-41d3-11ea-b77f-2e728ce88125",
      "value": "OSRS Actors AND Campaigns: RevengeHotels Campaign"
    },
	{
      "description": "SWEED has been active for at least three years — and a user with that name has been active on various forums, IRC channels and Discord servers since at least 2015. Currently, SWEED is actively targeting small and medium-sized companies around the world. Based on the TTPs used by this group, SWEED should be considered a relatively amateur actor. They use well-known vulnerabilities, commodity stealers and RATs (Pony, Formbook, UnknownRAT, Agent Tesla, etc.) and appear to rely on kits readily available on hacking forums. SWEED consistently leverages packing and crypting in order to minimize detection by anti-malware solutions. We assess that SWEED also does not have effective operational security, as they used several of the same online accounts for about five years, allowing for the discovery of a lot of their information, operations and associates.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Actors & Campaigns"
        ],
        "refs": [
          "https://blog.talosintelligence.com/2019/07/sweed-agent-tesla.html"
        ]
      },
      "uuid": "b0977e56-41d3-11ea-b77f-2e728ce88125",
      "value": "OSRS Actors AND Campaigns: SWEED"
    },
	{
      "description": "Threat actor identified as an individual who deploys the Arcane Stealer malware as a service.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Actors & Campaigns"
        ],
        "refs": [
          "https://www.fidelissecurity.com/threatgeek/threat-intelligence/arcane-stealer-v/",
		  "http://sakarilogs.websell.org"
        ],
        "synonyms": [
        "@SakariHack",
		"SEK1R",
		"Кичкас"
        ]
      },
      "uuid": "b0979da0-41d3-11ea-b77f-2e728ce88125",
      "value": "OSRS Actors AND Campaigns: Sakari"
    },
	{
      "description": "SandCat, on the other hand, is a group that was discovered more recently by Kaspersky. One of the Windows vulnerabilities patched by Microsoft in December had been exploited by both FruityArmor and SandCat in attacks targeting the Middle East and Africa. SandCat has been using FinFisher/FinSpy spyware and CHAINSHOT, a piece of malware analyzed earlier this year by Palo Alto Networks. The group has also used the CVE-2018-8589 and CVE-2018-8611 Windows vulnerabilities in its attacks, both of which had a zero-day status when Microsoft released fixes.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Actors & Campaigns"
        ],
        "refs": [
          "https://malpedia.caad.fkie.fraunhofer.de/actor/sandcat"
        ]
      },
      "uuid": "b0979f58-41d3-11ea-b77f-2e728ce88125",
      "value": "OSRS Actors AND Campaigns: SandCat"
    },
	{
      "description": "Hacking group identified as being responsible for successfully deploying ransomware against the City of Johannesburg (Oct. 25th , 2019).",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Actors & Campaigns"
        ],
        "refs": [
          "https://www.zdnet.com/article/city-of-johannesburg-held-for-ransom-by-hacker-gang/"
        ]
      },
      "uuid": "b097a098-41d3-11ea-b77f-2e728ce88125",
      "value": "OSRS Actors AND Campaigns: Shadow Kill Hackers"
    },
	{
      "description": "Silent Starling, comprised of three main threat actors, has found success in compromising email accounts, gathering data from them, and then targeting appropriate contacts at the right time. The group consistently targets suppliers and vendors in their initial attacks, using phishing emails to encourage employees to divulge passwords, which can then be used to access the email account. Once this information is available, Silent Starling sets up a forwarding rule so the group receives copies of all emails into the account. From there, Silent Starling diverges from a typical BEC group by showing extreme patience—oftentimes waiting months to gather information about employee behavior, standard invoice design, and other financial information that will be useful in an attack. When the time is right, the group will strike. At this point, they use either the original compromised account (or one very similar) to target the vendor’s customer, asking for payment on an invoice. And because the email looks exactly like one they are expecting, only with updated banking details, the customer is likely to fall for the scam.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Actors & Campaigns"
        ],
        "refs": [
          "https://www.agari.com/email-security-blog/silent-starling-vendor-email-compromise/"
        ]
      },
      "uuid": "b097a1c4-41d3-11ea-b77f-2e728ce88125",
      "value": "OSRS Actors AND Campaigns: Silent Starling"
    },
	{
      "description": "Threat actor identified by Palo Alto Unit42, and is attributed to the development as well as proliferation of the Blackremote RAT.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Actors & Campaigns"
        ],
        "refs": [
          "https://unit42.paloaltonetworks.com/blackremote-money-money-money-a-swedish-actor-peddles-an-expensive-new-rat/"
        ],
        "synonyms": [
        "Rafiki"
        ]
      },
      "uuid": "b097a2e6-41d3-11ea-b77f-2e728ce88125",
      "value": "OSRS Actors AND Campaigns: Speccy"
    },
	{
      "description": "Proofpoint researchers nomenclature for threat actor, tracked internally as TA2101, who has targeted German companies and organizations to deliver and install backdoor malware. The actor initiated their campaigns impersonating the Bundeszentralamt fur Steuern, the German Federal Ministry of Finance, with lookalike domains, verbiage, and stolen branding in the emails. For their campaigns in Germany, the actor chose Cobalt Strike, a commercially licensed software tool that is generally used for penetration testing and emulates the type of backdoor framework used by Metasploit, a similar penetration testing tool. The product describes itself as adversary simulation software designed to execute targeted attacks and emulate the post-exploitation actions of advanced threat actors, and is intended for use by organizations to secure their environments. However, despite its extensive legitimate use as a simulation tool, various actors have deployed and executed campaigns using it as actual malware, including Cobalt Group, APT32, and APT19. Proofpoint researchers have also observed this actor distributing Maze ransomware, employing similar social engineering techniques to those it uses for Cobalt Strike, while also targeting organizations in Italy and impersonating the Agenzia Delle Entrate, the Italian Revenue Agency. We have also recently observed the actor targeting organizations in the United States using the IcedID banking Trojan while impersonating the United States Postal Service (USPS).",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Actors & Campaigns"
        ],
        "refs": [
          "https://www.proofpoint.com/us/threat-insight/post/ta2101-plays-government-imposter-distribute-malware-german-italian-and-us"
        ]
      },
      "uuid": "b097a408-41d3-11ea-b77f-2e728ce88125",
      "value": "OSRS Actors AND Campaigns: TA2101"
    },
	{
      "description": "Tracked by security vendor Proofpoint as well as Dell Secureworks, TA407, also known as Silent Librarian, Cobalt Dickens, and Mabna Institute; and typically conducts ongoing academia-focused campaigns. Like many educational phishing attacks, campaigns associated with TA407 are typically not geographically targeted, but rather tied to specific universities, with phishing landing pages developed for library and student or faculty access portals. While many of the attacks are directed at schools in the United States, researchers regularly observe campaigns affecting universities primarily in North America and Europe. Silent Librarian is a prolific financially motivated actor operating out of Iran. In early 2018, the US Department of Justice indicted nine members of the cybercrime group for hacking, wire fraud, and identity theft. In particular, the group was cited for obtaining unauthorized access to computer systems, stealing proprietary data from those systems, and selling that stolen data to Iranian customers, including the Iranian government and Iranian universities.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Actors & Campaigns"
        ],
        "refs": [
          "https://www.proofpoint.com/us/threat-insight/post/threat-actor-profile-ta407-silent-librarian"
        ],
        "synonyms": [
        "Silent Librarian",
		"Cobalt Dickens",
		"Mabna Institute"
        ]
      },
      "uuid": "b097a8b8-41d3-11ea-b77f-2e728ce88125",
      "value": "OSRS Actors AND Campaigns: TA407"
    },
	{
      "description": "Group claiming responsibility for the hack of CarePartners.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Actors & Campaigns"
        ],
        "refs": [
          "https://www.databreaches.net/team_orangeworm-issues-new-threats-to-carepartners/",
		  "https://www.databreaches.net/team-orangeworm-claims-to-be-dumping-carepartners-data-from-2018-breach/"
        ]
      },
      "uuid": "b097aa20-41d3-11ea-b77f-2e728ce88125",
      "value": "OSRS Actors AND Campaigns: Team Orangeworm"
    },
	{
      "description": "SophosLabs monitored a significant spike in crypto mining attacks, which spread quickly across enterprise networks. Starting from a single infection, these attacks use a variety of malicious scripts that, eventually, turn an enterprise’s large pool of CPU resources into efficient cryptocurrency mining slaves. The threat actors behind these campaigns have been using an array of advanced techniques, including fileless script execution, leveraging open source security tools for nefarious purposes, and abuse of exploitable vulnerabilities to rapidly spread laterally to other machines within the same network. In its latest iterations, the threat actor has begun to employ the use of EternalBlue exploits to propagate laterally to other machines in the same network. Some of the malicious scripts use the term $Lemon_Duck as a variable. Sophos and others have started to refer to these attackers as the Lemon_Duck PowerShell campaign.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Actors & Campaigns"
        ],
        "refs": [
          "https://news.sophos.com/en-us/2019/10/01/lemon_duck-powershell-malware-cryptojacks-enterprise-networks/"
        ]
      },
      "uuid": "13b0672c-41d5-11ea-b77f-2e728ce88125",
      "value": "OSRS Actors AND Campaigns: The Lemon_Duck PowerShell Campaign"
    },
	{
      "description": "Tortoiseshell uses both custom and off-the-shelf malware to target IT providers in Saudi Arabia in what appear to be supply chain attacks with the end goal of compromising the IT providers’ customers.Tortoiseshell, has been active since at least July 2018. a total of 11 organizations hit by the group, the majority of which are based in Saudi Arabia. In at least two organizations, evidence suggests that the attackers gained domain admin-level access.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Actors & Campaigns"
        ],
        "refs": [
          "https://www.symantec.com/blogs/threat-intelligence/tortoiseshell-apt-supply-chain"
        ]
      },
      "uuid": "13b069e8-41d5-11ea-b77f-2e728ce88125",
      "value": "OSRS Actors AND Campaigns: Tortoiseshell"
    },
	{
      "description": "Malware campaign that targeted Italian companies using phishing emails with a Total Oil theme.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Actors & Campaigns"
        ],
        "refs": [
          "https://blog.yoroi.company/research/commodity-malware-reborn-the-agenttesla-total-oil-themed-campaign/"
        ]
      },
      "uuid": "13b06b8c-41d5-11ea-b77f-2e728ce88125",
      "value": "OSRS Actors AND Campaigns: Total Oil Campaign"
    },
	{
      "description": "Threat actor that targets unsecured MongoDB databases and deletes them after compromise.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Actors & Campaigns"
        ],
        "refs": [
          "https://securityaffairs.co/wordpress/85766/hacking/unistellar-wiped-12000-mongodb.html"
        ]
      },
      "uuid": "13b06f7e-41d5-11ea-b77f-2e728ce88125",
      "value": "OSRS Actors AND Campaigns: Unistellar"
    },
	{
      "description": "Developer of Unnam3d R@nsomware.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Actors & Campaigns"
        ],
        "refs": [
          "https://www.bleepingcomputer.com/news/security/unnam3d-ransomware-locks-files-in-protected-archives-demands-gift-cards/"
        ]
      },
      "uuid": "13b070e6-41d5-11ea-b77f-2e728ce88125",
      "value": "OSRS Actors AND Campaigns: Unnam3d"
    },
	{
      "description": "A hacktivist who claimed the responsibility for defacing several local U.S. government websites. Motivation was political and called for better government support for medical care in the U.S.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Actors & Campaigns"
        ],
        "refs": [
          "https://www.databreaches.net/dozens-of-government-websites-defaced-by-vandathegod-hacktivists/"
        ]
      },
      "uuid": "13b0721c-41d5-11ea-b77f-2e728ce88125",
      "value": "OSRS Actors AND Campaigns: VandaTheGod"
    },
	{
      "description": "A campaign targeting dozens of mobile Android devices belonging to Israeli citizens.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Actors & Campaigns"
        ],
        "refs": [
          "https://securelist.com/fanning-the-flames-viceleaker-operation/90877/"
        ]
      },
      "uuid": "13b0733e-41d5-11ea-b77f-2e728ce88125",
      "value": "OSRS Actors AND Campaigns: ViceLeaker"
    },
	{
      "description": "Symantec researchers have discovered that this attack group, which we call Whitefly, has been operating since at least 2017, has targeted organizations based mostly in Singapore across a wide variety of sectors, and is primarily interested in stealing large amounts of sensitive information.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Actors & Campaigns"
        ],
        "refs": [
          "https://www.symantec.com/blogs/threat-intelligence/whitefly-espionage-singapore"
        ]
      },
      "uuid": "13b07460-41d5-11ea-b77f-2e728ce88125",
      "value": "OSRS Actors AND Campaigns: Whitefly"
    },
	{
      "description": "Threat actor moniker associated with FireEye report regarding APT41 operational activies.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Actors & Campaigns"
        ],
        "refs": [
          "https://www.fireeye.com/blog/threat-research/2019/08/apt41-dual-espionage-and-cyber-crime-operation.html"
        ]
      },
      "uuid": "13b0758c-41d5-11ea-b77f-2e728ce88125",
      "value": "OSRS Actors AND Campaigns: Wolfzhi"
    },
	{
      "description": "Registered as X4Crow, attributed to the sale of Brazillian citizen information. The records are separated per province and include names, dates of birth, and taxpayer ID (CPF - Cadastro de Pessoas Físicas) of individuals. The database also has taxpayer details about legal entities, or the CNPJ (Cadastro Nacional da Pessoa Jurídica), it is stated in the post. BleepingComputer received a sample of the database and was able to verify that the information on individuals is accurate and also included the mother name, and gender. We used the CPF lookup service on the Brazilian Federal Revenue website, which also provides the year of death in the case of deceased persons. Although the origin of the cache is not revealed in the seller's announcement, BleepingComputer was told that it is a government database. X4Crow says that it contains 92 million unique records that cover almost all Brazilian citizens.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Actors & Campaigns"
        ],
        "refs": [
          "https://www.bleepingcomputer.com/news/security/details-of-92-million-brazilians-auctioned-on-underground-forums/"
        ]
      },
      "uuid": "13b076ae-41d5-11ea-b77f-2e728ce88125",
      "value": "OSRS Actors AND Campaigns: X4Crow"
    },
	{
      "description": "The Yanbian Gang, a Chinese cybercriminal group infamous for stealing money from account holders of South Korean banks.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Actors & Campaigns"
        ],
        "refs": [
          "https://blog.trendmicro.com/trendlabs-security-intelligence/a-look-into-the-connection-between-xloader-and-fakespy-and-their-possible-ties-with-the-yanbian-gang/"
        ]
      },
      "uuid": "434d30cc-41d6-11ea-b77f-2e728ce88125",
      "value": "OSRS Actors AND Campaigns: Yanbian Gang"
    },
	{
      "description": "Threat actor moniker associated with FireEye report regarding APT41 operational activies.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Actors & Campaigns"
        ],
        "refs": [
          "https://www.fireeye.com/blog/threat-research/2019/08/apt41-dual-espionage-and-cyber-crime-operation.html"
        ]
      },
      "uuid": "434d3356-41d6-11ea-b77f-2e728ce88125",
      "value": "OSRS Actors AND Campaigns: Zhang Xuguang"
    },
	{
      "description": "A malicious threat actor leveraging a Google Chrome browser exploit to deliver malvertisements to iOS users. Dubbed eGobbler by researchers at Confiant, the threat actor from April 6-10 ran a massive operation consisting of eight individual campaigns and more than 30 fake creatives. Each mini-campaign lasted around two days and had its own unique targeting, although most affected publishers were based in the U.S.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Actors & Campaigns"
        ],
        "refs": [
          "https://en.wikipedia.org/wiki/Threat_actor",
		  "https://blog.confiant.com/massive-egobbler-malvertising-campaign-leverages-chrome-vulnerability-to-target-ios-users-a534b95a037f",
		  "https://www.scmagazine.com/home/security-news/high-volume-egobbler-malvertising-campaign-exploits-zero-day-chrome-bug/"
        ]
      },
      "uuid": "434d373e-41d6-11ea-b77f-2e728ce88125",
      "value": "OSRS Actors AND Campaigns: eGobbler"
    },
	{
      "description": "Actor claiming responsibility for the Capital One data breach of July 2019.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Actors & Campaigns"
        ],
        "refs": [
          "https://securityaffairs.co/wordpress/89114/data-breach/capital-one-data-breach.html"
        ]
      },
      "uuid": "434d389c-41d6-11ea-b77f-2e728ce88125",
      "value": "OSRS Actors AND Campaigns: erratic"
    },
	{
      "description": "Actor group identified by FireEye researchers. Atributed to the hacking of several India-based healthcare organizations web sites and systems.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Actors & Campaigns"
        ],
        "refs": [
          "https://www.databreaches.net/hackers-attack-indian-healthcare-website-steal-68/"
        ]
      },
      "uuid": "434d39be-41d6-11ea-b77f-2e728ce88125",
      "value": "OSRS Actors AND Campaigns: fallensky519"
    },
	{
      "description": "Threat actor attributed to the creation, sale, and distribution of the malware strain Racoon Stealer.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Actors & Campaigns"
        ],
        "refs": [
          "https://www.cybereason.com/blog/hunting-raccoon-stealer-the-new-masked-bandit-on-the-block"
        ]
      },
      "uuid": "434d3aea-41d6-11ea-b77f-2e728ce88125",
      "value": "OSRS Actors AND Campaigns: glad0ff"
    },
	{
      "description": "Name of the threat actor who developed the first version of the Anubis banking malware.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Actors & Campaigns"
        ],
        "refs": [
          "https://www.threatfabric.com/blogs/anubis_2_malware_and_afterlife.html",
		  "https://securityaffairs.co/wordpress/82874/malware/anubis-ii-malware.html"
        ]
      },
      "uuid": "434d3c20-41d6-11ea-b77f-2e728ce88125",
      "value": "OSRS Actors AND Campaigns: maza-in"
    },
	{
      "description": "mobeebom created a sales thread for his Android Remote Administration Tool (RAT) MobiHok v4, on a prominent English hacking forum. mobeebom is active on multiple Arab-speaking hacking forums under different pseudonyms. mobeebom’s activity in the underground communities, and the analysis of a sample of the malware builder retrieved, it is apparent that the threat actor based MobiHok on the source code of another prominent Android RAT named SpyNote, which was leaked online in 2016. mobeebom probably obtained SpyNote’s source code, made some minor changes, and now resells it as a new RAT under the name MobiHok.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Actors & Campaigns"
        ],
        "refs": [
          "https://blog.sensecy.com/2019/09/15/arabic-speaking-threat-actor-recycles-the-source-code-of-popular-rat-spynote-and-sells-it-in-the-dark-web-as-new/"
        ]
      },
      "uuid": "434d3d42-41d6-11ea-b77f-2e728ce88125",
      "value": "OSRS Actors AND Campaigns: mobeebom"
    },
	{
      "description": "The first known attack in this campaign targeted a Kuwait transportation and shipping company in which the actors installed a backdoor tool named Hisoka. Several custom tools were later downloaded to the system in order to carry out post-exploitation activities. All of these tools appear to have been created by the same developer. Collection of several variations of these tools including one dates back to July 2018. The developer of the collected tools used character names from the anime series Hunter x Hunter, which is the basis for the campaign name xHunt. The names of the tools collected include backdoor tools Sakabota, Hisoka, Netero and Killua. These tools not only use HTTP for their command and control (C2) channels, but certain variants of these tools use DNS tunneling or emails to communicate with their C2 as well.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Actors & Campaigns"
        ],
        "refs": [
          "https://unit42.paloaltonetworks.com/xhunt-campaign-attacks-on-kuwait-shipping-and-transportation-organizations/"
        ]
      },
      "uuid": "434d40d0-41d6-11ea-b77f-2e728ce88125",
      "value": "OSRS Actors AND Campaigns: xHunt Campaign"
    },
	{
      "description": "The HeartBeat campaign is an isolated APT case that targets organizations within South Korea only. Based on research, the campaign started by at least November 2009. They target organizations that are directly or in some ways related to the South Korean government. Specifically, the HeartBeat campaign targets the following sectors - political parties, media outfits a national policy research institute, a military branch of South Korean armed forces, a small business sector organization, and branches of South Korean government. Based on their targets, it is believed that the campaign may be politically motivated. In order to gain access over their targets network, they use a custom remote access tool (RAT). Variants of their RAT contains an embedded campaign code that mostly contains strings that describes their respective decoy documents and a campaign date in MMDD format. Additionally, the attackers behind HeartBeat campaign made sure that their operation as well as their identity remain concealed. For instance, they used legitimate looking file name and registry names for their RAT. They also used XOR encryption for their network communications. To hide their identities, on the other hand, they used a site redirection service that redirects to compromised hosts from different countries. These compromised hosts acts as a proxy server that hides the real location of their C&C servers.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Actors & Campaigns"
        ],
        "refs": [
          "https://blog.trendmicro.com/trendlabs-security-intelligence/pulsing-the-heartbeat-apt/"
        ]
      },
      "uuid": "91f4ad84-6523-11ea-bc55-0242ac130003",
      "value": "OSRS Actors AND Campaigns: Heartbeat Campaign"
    },
	{
      "description": "The Operation Bitter Biscuit campaign is an isolated APT case that targets organizations within South Korea only. Based on research, the campaign started by at least November 2009. They target organizations that are directly or in some ways related to the South Korean government. Specifically, the Operation Bitter Biscuit campaign targets the following sectors - political parties, media outfits a national policy research institute, a military branch of South Korean armed forces, a small business sector organization, and branches of South Korean government. Based on their targets, it is believed that the campaign may be politically motivated. In order to gain access over their targets network, they use a custom remote access tool (RAT). Variants of their RAT contains an embedded campaign code that mostly contains strings that describes their respective decoy documents and a campaign date in MMDD format. Additionally, the attackers behind Operation Bitter Biscuit campaign made sure that their operation as well as their identity remain concealed. For instance, they used legitimate looking file name and registry names for their RAT. They also used XOR encryption for their network communications. To hide their identities, on the other hand, they used a site redirection service that redirects to compromised hosts from different countries. These compromised hosts acts as a proxy server that hides the real location of their C&C servers.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Actors & Campaigns"
        ],
        "refs": [
          "https://image.ahnlab.com/file_upload/asecissue_files/ASEC_REPORT_vol.88.pdf"
        ]
      },
      "uuid": "91f4afb4-6523-11ea-bc55-0242ac130003",
      "value": "OSRS Actors AND Campaigns: Operation Bitter Biscuit"
    },
	{
      "description": "Hacking group associated with the U.S. Central Intelligence Agency. Typicaly acts against high profile and Chinese industry targets.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Actors & Campaigns"
        ],
        "refs": [
          "http://blogs.360.cn/post/APT-C-39_CIA_EN.html"
        ]
      },
      "uuid": "25e4e0a4-67d6-11ea-bc55-0242ac130003",
      "value": "OSRS Actors AND Campaigns: APT-C-39"
    },
	{
      "description": "Threat actor group behind the Maze Ransomware family.  Also known as TA2101 and APT-29. The Maze team is publicly exposing victims by displaying real files exfiltrated from their hacked servers. Threat Actors supposed to have registered the domain mazenews.top to release the exfiltrated data.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Actors & Campaigns"
        ],
        "refs": [
          "https://medium.com/@dinu135dk/maze-ransomware-victims-data-revealed-a45d6c534b3f"
        ],
        "synonyms": [
        "TA2101",
		"APT-29"
        ]
      },
      "uuid": "6ebd1874-686b-11ea-bc55-0242ac130003",
      "value": "OSRS Actors AND Campaigns: Maze Team"
    },
	{
      "description": "The campaign mainly targets online users of various Japanese banks by stealing their banking credentials using a three-pronged attack. Based on telemetry, Operation Overtrap has been active since April 2019 and has been solely targeting online banking users located in Japan. Analysis found that this campaign uses three different attack vectors to steal its victims’ banking credentials - by sending spam emails with a phishing link to a page disguised as a banking website, by sending spam emails asking victims to run a disguised malware’s executable downloaded from a linked phishing page, and by using a custom exploit kit to deliver malware via malvertising.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Actors & Campaigns"
        ],
        "refs": [
          "https://blog.trendmicro.com/trendlabs-security-intelligence/operation-overtrap-targets-japanese-online-banking-users-via-bottle-exploit-kit-and-brand-new-cinobi-banking-trojan/"
        ]
      },
      "uuid": "6324832a-686c-11ea-bc55-0242ac130003",
      "value": "OSRS Actors AND Campaigns: Operation Overtrap"
    },
	{
      "description": "In August 2019, Kaspersky discovered a malicious campaign distributing a fully fledged C++ Trojan that we call Milum. All the victims we registered were organizations from the Middle East. At least some of them are related to industrial sector. Our Kaspersky Threat Attribution Engine (KTAE) doesn’t show any code similarities with known campaigns. Nor have we seen any target intersections. In fact, we found just three almost unique samples, all in one country. So we consider the attacks to be targeted and have currently named this operation WildPressure. The compilation timestamps for all these files is the same – March 2019. This is consistent with the fact that we registered no infections before May 31, 2019, so the compilation dates don’t seem to be spoofed. For their campaign infrastructure, the operators used rented OVH and Netzbetrieb virtual private servers (VPS) and a domain registered with the Domains by Proxy anonymization service. The malware uses the JSON format for configuration data and as a C2 communication protocol over HTTP as well. Inside the encrypted communications within the HTTP POST requests, we found several interesting fields. One of them shows the malware version – 1.0.1. A version number like this indicates an early stage of development. Other fields suggest the existence of, at the very least, plans for non-C++ versions. The only encryption implemented is the RC4 algorithm with different 64-byte keys for different victims. Also, the developers were kind enough to leave RTTI data inside the files.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Actors & Campaigns"
        ],
        "refs": [
          "https://securelist.com/wildpressure-targets-industrial-in-the-middle-east/96360/"
        ]
      },
      "uuid": "50acba7c-6eb2-11ea-bc55-0242ac130003",
      "value": "OSRS Actors AND Campaigns: Operation WildPressure"
    },
	{
      "description": "A recently discovered watering hole attack has been targeting iOS users in Hong Kong. The campaign uses links posted on multiple forums that supposedly lead to various news stories. While these links lead users to the actual news sites, they also use a hidden iframe to load and execute malicious code. The malicious code contains exploits that target vulnerabilities present in iOS 12.1 and 12.2.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Actors & Campaigns"
        ],
        "refs": [
          "https://blog.trendmicro.com/trendlabs-security-intelligence/operation-poisoned-news-hong-kong-users-targeted-with-mobile-malware-via-local-news-links/"
        ]
      },
      "uuid": "62b827ba-729f-11ea-bc55-0242ac130003",
      "value": "OSRS Actors AND Campaigns: Operation Poisoned News"
    },
	{
      "description": "REvil ransomware first was advertised on a Russian language cybercrime forum in June 2019. The main actor associated with advertising and promoting REvil ransomware is called Unknown aka UNKN.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Actors & Campaigns"
        ],
        "refs": [
          "https://blog.intel471.com/2020/03/31/revil-ransomware-as-a-service-an-analysis-of-a-ransomware-affiliate-operation/"
        ],
        "synonyms": [
        "UNKN"
        ]
      },
      "uuid": "b15c334e-74d8-11ea-bc55-0242ac130003",
      "value": "OSRS Actors AND Campaigns: Unknown"
    },
	{
      "description": "Threat actor and moderator on Russian underground forum. Affliated with Gandcrab and Revil RaaS, as well as affiliated with the threat actor UNKN.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Actors & Campaigns"
        ],
        "refs": [
          "https://blog.intel471.com/2020/03/31/revil-ransomware-as-a-service-an-analysis-of-a-ransomware-affiliate-operation/"
        ]
      },
      "uuid": "b15c356a-74d8-11ea-bc55-0242ac130003",
      "value": "OSRS Actors AND Campaigns: kerberos"
    },
	{
      "description": "A cybercrime actor known to participate in GandCrab and REvil ransomware affiliate programs.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Actors & Campaigns"
        ],
        "refs": [
          "https://blog.intel471.com/2020/03/31/revil-ransomware-as-a-service-an-analysis-of-a-ransomware-affiliate-operation/"
        ]
      },
      "uuid": "b15c3664-74d8-11ea-bc55-0242ac130003",
      "value": "OSRS Actors AND Campaigns: lalartu"
    },
	{
      "description": "The actors behind Trickbot are commonly referred to as the Trickbot Gang. Financial gain is the primary motive for this group's actions. The group's operations have grown along with the malware itself. At the time of this writing, the group has ventured into pushing a malicious Android application to victims whose Windows machines have been infected with Trickbot. The intent is to convince the user to install the application on their Android phone, which steals one-time codes that banks send as part of a 2FA sequence. Currently, this attack has only been observed in Germany, but it is likely the use of this technique will increase if it proves to be effective. Trickbot Gang also rents a Trickbot variant to state-sponsored APT groups. Not only are they supplying the malware, but they are also selling the access they have gained to high profile networks across the globe. This cooperation reflects the trend in recent years of state-sponsored cyber espionage groups interacting with cyber criminal organizations. One of the most devastating threats that Trickbot poses is the delivery of the Ryuk ransomware with the help of Emotet. This has proven to be a dangerously effective combination, generating millions of dollars of income in 2019 alone. The reason for this combination of malware is that the Trickbot modules for lateral movement are an efficient means to propagate across a network before deploying Ryuk.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Actors & Campaigns"
        ],
        "refs": [
          "https://blog.talosintelligence.com/2020/03/trickbot-primer.html"
        ]
      },
      "uuid": "5d78c0e2-7750-11ea-bc55-0242ac130003",
      "value": "OSRS Actors AND Campaigns: Trickbot Gang"
    },
	{
      "description": "Guardicore Labs team uncovered a long-running attack campaign which aims to infect Windows machines running MS-SQL servers. Dating back to May 2018, the campaign uses password brute force to breach victim machines, deploys multiple backdoors and executes numerous malicious modules, such as multifunctional remote access tools (RATs) and cryptominers. Dubbed Vollgar after the Vollar cryptocurreny it mines and its offensive, vulgar behaviour.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Actors & Campaigns"
        ],
        "refs": [
          "https://www.guardicore.com/2020/04/vollgar-ms-sql-servers-under-attack/"
        ]
      },
      "uuid": "5a22045e-7754-11ea-bc55-0242ac130003",
      "value": "OSRS Actors AND Campaigns: Vollgar Campaign"
    },
	{
      "description": "On December 4, 2019, Kasperskey researchers discovered watering hole websites that were compromised to selectively trigger a drive-by download attack with fake Adobe Flash update warnings. This campaign has been active since at least May 2019, and targets an Asian religious and ethnic group. The threat actor’s unsophisticated but creative toolset has been evolving a lot since the inception date, may still be in development, and leverages Sojson obfuscation, NSIS installer, Python, open-source code, GitHub distribution, Go language, as well as Google Drive-based C2 channels.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Actors & Campaigns"
        ],
        "refs": [
          "https://securelist.com/holy-water-ongoing-targeted-water-holing-attack-in-asia/96311/"
        ]
      },
      "uuid": "5a22067a-7754-11ea-bc55-0242ac130003",
      "value": "OSRS Actors AND Campaigns: Holy Water Campaign"
    },
	{
      "description": "Uniquely identified magecart threat actor group. Associated with the MakeFrame malware attack.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Actors & Campaigns"
        ],
        "refs": [
          "https://www.riskiq.com/blog/labs/magecart-makeframe/"
        ]
      },
      "uuid": "38aef3ac-7823-11ea-bc55-0242ac130003",
      "value": "OSRS Actors AND Campaigns: Magecart Group 7"
    },
	{
      "description": "A cyberespionage campaign that infects Android and iOS devices with spyware (detected by Trend Micro as AndroidOS_ProjectSpy.HRX and IOS_ProjectSpy.A, respectively). Project Spy uses the ongoing coronavirus pandemic as a lure, posing as an app called Coronavirus Updates. Similarities in two older samples disguised as a Google service and, subsequently, as a music app after further investigation. Researchers have observed a significantly small number of downloads of the app in Pakistan, India, Afghanistan, Bangladesh, Iran, Saudi Arabia, Austria, Romania, Grenada, and Russia.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Actors & Campaigns"
        ],
        "refs": [
          "https://blog.trendmicro.com/trendlabs-security-intelligence/coronavirus-update-app-leads-to-project-spy-android-and-ios-spyware/"
        ]
      },
      "uuid": "e05791ae-7fda-11ea-bc55-0242ac130003",
      "value": "OSRS Actors AND Campaigns: Project Spy Campaign"
    },
	{
      "description": "The attacker, Tag Barnakle, are compromising ad servers and appending their malvertising payload to live creatives. The entry point is always the same obfuscated Javascript payload, but of course there are variations in the obfuscated variable names and in the intermediate fingerprinting domain utilized.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Actors & Campaigns"
        ],
        "refs": [
          "https://blog.confiant.com/tag-barnakle-the-malvertiser-that-hacks-revive-ad-servers-redirects-victims-to-malware-50cdc57435b1"
        ]
      },
      "uuid": "a9d5b930-8ae8-11ea-bc55-0242ac130003",
      "value": "OSRS Actors AND Campaigns: Tag Barnakle"
    },
	{
      "description": "Native Farsi speakers pointed me in the direction of the term ‘nazar’ –roughly translating to ‘supervision’ or ‘monitoring’– transliterated and mangled from Persian to Roman characters. A more recognizable alternative interpretation is the nazar amulet used for protection against evil eye. Some level of speculation is involved so I won’t belabor the point beyond emojying the name for tweetable convenience.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Actors & Campaigns"
        ],
        "refs": [
          "https://www.epicturla.com/blog/the-lost-nazar"
        ]
      },
      "uuid": "a9d5bb60-8ae8-11ea-bc55-0242ac130003",
      "value": "OSRS Actors AND Campaigns: Nazar APT"
    },
	{
      "description": "Campaign discovered by cybersecurity company Kasperky researchers. Masquerades in Google Play dubbed PhantomLance. Considered to have some overlap with threat actor OceanLotus APT. Victims typically reside in Nepal, Malaysia, and Myanmar. Mimics as Flash plugins, cleaners, and updaters. Installs backdoor and info stealers.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Actors & Campaigns"
        ],
        "refs": [
          "https://securelist.com/apt-phantomlance/96772/"
        ]
      },
      "uuid": "b9d75f3c-8fb1-11ea-bc55-0242ac130003",
      "value": "OSRS Actors AND Campaigns: PhantomLance Campaign"
    },
	{
      "description": "In the first quarter of 2020, Group-IB Threat Intelligence team received a lead concerning corporate email account compromise of an Asia-based company. A joint investigation of Group-IB DFIR and Threat Intelligence teams reveals an uptrending phishing technique which is essentially achieved by abusing Microsoft file sharing services, including Sway, SharePoint, and OneNote. Group-IB Threat Intelligence team names this series of phishing attacks the PerSwaysion campaign for the extensive abuse of Sway service. The dubbed PerSwaysion campaign is a collection of small yet targeted phishing attacks run by multiple cyber-criminal groups, attacking small and medium financial services companies, law firms, and real estate groups. Evidence suggests, since mid 2019, at least 156 high ranking officers of given organizations are compromised. Such high-profile victims tend to locate in the US, Canada, while the rest are in global and regional financial hubs such as Germany, the UK, Netherlands, Hong Kong and Singapore and other countries. Group-IB set up a website, where everyone can check if their email address was compromised by PerSwaysion. Group-IB continues to work with the relevant parties in local countries to inform the affected companies of the breach.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Actors & Campaigns"
        ],
        "refs": [
          "https://www.group-ib.com/blog/perswaysion"
        ]
      },
      "uuid": "b9d76162-8fb1-11ea-bc55-0242ac130003",
      "value": "OSRS Actors AND Campaigns: PerSwaysion Campaign"
    },
	{
      "description": "Shiny Hunters is behind the recently reported breaches of Indonesian e-commerce giant Tokopedia and Indian e-learning platform Unacademy, as well as three new breaches affecting meal kit delivery service Home Chef, online printing and photo store Chatbooks and college-oriented news site Chronicle.com.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Actors & Campaigns"
        ],
        "refs": [
          "https://www.scmagazine.com/home/security-news/cybercrime/shiny-hunters-bursts-onto-dark-web-scene-following-breaches-microsoft-data-theft-claims/"
        ]
      },
      "uuid": "86dddb0c-9537-11ea-bb37-0242ac130002",
      "value": "OSRS Actors AND Campaigns: Shiny Hunters (Threat Actor)"
    },
	{
      "description": "Targets global financial industry with the EVILNUM malware. Uses phishing links to initiate the attack which allows for the download of trojanized files. The first version of EVILNUM was identified in 2018. The second version was discovered in an unrelated incident response investigation a year later, having infiltrated a FINTECH company. The initial reporting on this malware was the only sign of its presence, as it briefly faded from view.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Actors & Campaigns"
        ],
        "refs": [
          "https://blog.prevailion.com/2020/05/phantom-in-command-shell5.html"
        ]
      },
      "uuid": "86ddde4a-9537-11ea-bb37-0242ac130002",
      "value": "OSRS Actors AND Campaigns: Phantom in the Command Shell (Campaign)"
    },
	{
      "description": "Cryptomining campaign identified by the cybersecurity company Red Canary. Leverages typical miners such as XMRig.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Actors & Campaigns"
        ],
        "refs": [
          "https://redcanary.com/blog/blue-mockingbird-cryptominer/"
        ]
      },
      "uuid": "86dddf94-9537-11ea-bb37-0242ac130002",
      "value": "OSRS Actors AND Campaigns: Blue Mockingbird Campaign"
    },
	{
      "description": "Threat actor attributed to the ShuangQiang(double gun) campaign that used various DNS manipulation tactics to compromise their targets.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Actors & Campaigns"
        ],
        "refs": [
          "https://blog.netlab.360.com/shuangqiang/"
        ]
      },
      "uuid": "64f4c0e0-a03c-11ea-bb37-0242ac130002",
      "value": "OSRS Actors AND Campaigns: Double Gun (Threat Actor) "
    },
	{
      "description": "Campaign attributed to the threat actor Double Gun.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Actors & Campaigns"
        ],
        "refs": [
          "https://blog.netlab.360.com/shuangqiang/"
        ]
      },
      "uuid": "b6081e4e-a03e-11ea-bb37-0242ac130002",
      "value": "OSRS Actors AND Campaigns: ShuangQiang Campaign (Double Gun)"
    },
	{
      "description": "Hangover Group is a cyberespionage group that was first observed in December 2013 carrying on a cyberattack against a telecom corporation in Norway. Cybersecurity firm Norman reported that the cyberattacks were emerging from India and the group sought and carried on attacks against targets of national interest, such as Pakistan and China. However, there have been indicators of Hangover activity in the U.S. and Europe. Mainly focusing on government, military, and civilian organizations. The Hangover Group’s initial vector of compromise is to carry out spear-phishing campaigns. The group uses local and topical news lures from the South Asia region to make their victims more prone to falling into their social engineering techniques, making them download and execute a weaponized Microsoft Office document. After the user executes the weaponized document, backdoor communication is established between BackConfig and the threat actors, allowing attackers to carry on espionage activity, potentially exfiltrating sensitive data from compromised systems.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Actors & Campaigns"
        ],
        "refs": [
          "https://unit42.paloaltonetworks.com/threat-assessment-hangover-threat-group/"
        ],
        "synonyms": [
        "Neon",
        "Viceroy Tiger",
		"MONSOON"
        ]
      },
      "uuid": "4f757912-ab40-11ea-bb37-0242ac130002",
      "value": "OSRS Actors AND Campaigns: Hangover (Threat Actor)"
    },
	{
      "description": "The Higaisa APT is believed to be tied to the Korean peninsula, and was first disclosed by Tencent Security Threat Intelligence Center in early 2019. The group’s activities go back to at least 2016 and include the use of Trojans such as Gh0st and PlugX, as well as mobile malware. Its targets include government officials and human rights organizations, as well as other entities related to North Korea.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Actors & Campaigns"
        ],
        "refs": [
          "https://blog.malwarebytes.com/threat-analysis/2020/06/higaisa/"
        ]
      },
      "uuid": "4f757bb0-ab40-11ea-bb37-0242ac130002",
      "value": "OSRS Actors AND Campaigns: Higaisa APT"
    },
	{
      "description": "In August 2019, Proofpoint researchers reported that LookBack malware was targeting the United States (U.S.) utilities sector between July and August 2019. We then continued our analysis into additional LookBack campaigns that unfolded between August 21-29, 2019. These campaigns utilized malicious macro-laden documents in order to deliver modular malware to targeted utility providers across the U.S. At the same time as the LookBack campaigns, Proofpoint researchers identified a new, additional malware family named FlowCloud that was also being delivered to U.S. utilities providers. FlowCloud malware, like LookBack, gives attackers complete control over a compromised system. Its remote access trojan (RAT) functionality includes the ability to access installed applications, the keyboard, mouse, screen, files, services, and processes with the ability to exfiltrate information via command and control. Analyzing phishing campaigns between July-November 2019 the researchers have determined that both LookBack and FlowCloud malware can be attributed to a single threat actor we are calling TA410. This conclusion is based on the threat actor’s use of shared attachment macros, malware installation techniques, and overlapping delivery infrastructure. In addition, their analysis found similarities between TA410 and TA429 (APT10) delivery tactics. Specifically, the researchers observed attachment macros that are common to both actors. TA410 campaigns detected in November 2019 included TA429 (APT10)-related infrastructure used in phishing attachment delivery macros. However, Proofpoint analysts believe that intentional reuse of well-publicized TA429 (APT10) techniques and infrastructure may be an attempt by threat actors to create a false flag.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Actors & Campaigns"
        ],
        "refs": [
          "https://www.proofpoint.com/us/blog/threat-insight/ta410-group-behind-lookback-attacks-against-us-utilities-sector-returns-new"
        ]
      },
      "uuid": "4f757cb4-ab40-11ea-bb37-0242ac130002",
      "value": "OSRS Actors AND Campaigns: TA410 (Threat Actor)"
    },
	{
      "description": "Dark Basin is a hack-for-hire group that has targeted thousands of individuals and hundreds of institutions on six continents. Targets include advocacy groups and journalists, elected and senior government officials, hedge funds, and multiple industries. Dark Basin extensively targeted American nonprofits, including organisations working on a campaign called #ExxonKnew, which asserted that ExxonMobil hid information about climate change for decades. Researchers also identify Dark Basin as the group behind the phishing of organizations working on net neutrality advocacy, previously reported by the Electronic Frontier Foundation. Researchers also link Dark Basin with high confidence to an Indian company, BellTroX InfoTech Services, and related entities.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Actors & Campaigns"
        ],
        "refs": [
          "https://citizenlab.ca/2020/06/dark-basin-uncovering-a-massive-hack-for-hire-operation/"
        ]
      },
      "uuid": "4f757d86-ab40-11ea-bb37-0242ac130002",
      "value": "OSRS Actors AND Campaigns: Dark Basin Threat Group"
    },
	{
      "description": "Prevailion researchers detected a new advanced campaign dubbed - The Gh0st Remains the Same. This first campaign likely commenced between May 11th and 12th, 2020. In this engagement, the victims received a compressed RAR folder that contained trojanized files. If the malicious files were engaged, they displayed decoy web pages associated with the software company Zeplin. Zeplin is a software company that developed a platform to create a connected space for product teams, and boasts over three million customers. Some of Zeplin’s more prominent users include - Starbucks, Airbnb, Slack, Dropbox, Pinterest, Shopify, Feedly and MailChimp. It is likely they chose to simulate collaboration-based software with a sizable user base, as a result of the increase in working from home (WFH) during the global pandemic.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Actors & Campaigns"
        ],
        "refs": [
          "https://blog.prevailion.com/2020/06/the-gh0st-remains-same8.html"
        ]
      },
      "uuid": "8d965d28-ab41-11ea-bb37-0242ac130002",
      "value": "OSRS Actors AND Campaigns: The Gh0st Remains the Same (Campaign)"
    },
	{
      "description": "Evil Corp has been operating the Dridex malware since July 2014 and provided access to several groups and individual threat actors. However, towards the end of 2017 Evil Corp became smaller and used Dridex infections almost exclusively for targeted ransomware campaigns by deploying BitPaymer. The majority of victims were in North America (mainly USA) with a smaller number in Western Europe and instances outside of these regions being just scattered, individual cases. During 2018, Evil Corp had a short lived partnership with TheTrick group, specifically, leasing out access to BitPaymer for a while, prior to their use of Ryuk.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Actors & Campaigns"
        ],
        "refs": [
          "https://research.nccgroup.com/2020/06/23/wastedlocker-a-new-ransomware-variant-developed-by-the-evil-corp-group/"
        ]
      },
      "uuid": "354b6adc-b6e0-11ea-b3de-0242ac130004",
      "value": "OSRS Actors AND Campaigns: Evil Corp Group"
    },
	{
      "description": "The attacks, which we dubbed Operation In(ter)ception based on a related malware sample named Inception.dll, were highly targeted and clearly intent on staying under the radar. To compromise their targets, the attackers used social engineering via LinkedIn, hiding behind the ruse of attractive, but bogus, job offers. Having established an initial foothold, the attackers deployed their custom, multistage malware, along with modified open-source tools. Besides malware, the adversaries made use of living off the land tactics, abusing legitimate tools and OS functions. Several techniques were used to avoid detection, including code signing, regular malware recompilation and impersonating legitimate software and companies.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Actors & Campaigns"
        ],
        "refs": [
          "https://www.welivesecurity.com/2020/06/17/operation-interception-aerospace-military-companies-cyberspies/"
        ]
      },
      "uuid": "41601f4c-b6e1-11ea-b3de-0242ac130004",
      "value": "OSRS Actors AND Campaigns: Operation In(ter)ception"
    },
	{
      "description": "Campaign that targeted Australian organizations using copied open source tools to compromise their targets. The actor has been identified leveraging a number of initial access vectors, with the most prevalent being the exploitation of public-facing infrastructure - primarily through the use of remote code execution vulnerabilities in unpatched versions of Telerik UI. Other vulnerabilities in public-facing infrastructure leveraged by the actor include exploitation of a deserialisation vulnerability in Microsoft Internet Information Services (IIS), a 2019 SharePoint vulnerability and the 2019 Citrix vulnerability.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Actors & Campaigns"
        ],
        "refs": [
          "https://www.trustwave.com/en-us/resources/blogs/spiderlabs-blog/copy-paste-threat-actor-in-the-asia-pacific-region/",
		  "https://www.cyber.gov.au/news/advisory-2020-008-copy-paste-compromises-tactics-techniques-and-procedures-used-target-multiple-australian-networks",
		  "https://www.cyber.gov.au/acsc/view-all-content/alerts/copy-paste-compromises"
        ]
      },
      "uuid": "41602172-b6e1-11ea-b3de-0242ac130004",
      "value": "OSRS Actors AND Campaigns: Copy-Paste Campaign"
    },
	{
      "description": "CryptoCore is a group that targets almost exclusively cryptocurrency exchanges and companies working with them via supply-chain attack. The CryptoCore group is known for having accumulated a sum of approximately 70 million USD from its heists on exchanges. Researchers estimate that the group managed to rake in more than 200 million USD in two years. This group is not extremely technically advanced, yet it seems to be swift, persistent, and effective, nevertheless. Researchers assess it to be active at least since May 2018, judging from the timestamp of the first known relevant sample, and it maintained steady activity since then. Its activity has receded in the first half of 2020, one possible reason being the limitations induced by the COVID-19 pandemic, but it didn’t stop completely.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Actors & Campaigns"
        ],
        "refs": [
          "https://www.clearskysec.com/cryptocore-group/"
        ]
      },
      "uuid": "c69185e8-bbbe-11ea-b3de-0242ac130004",
      "value": "OSRS Actors AND Campaigns: CryptoCore Group"
    },
	{
      "description": "Magecart threat actor group that hides web skimmers within EXIF metadata.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Actors & Campaigns"
        ],
        "refs": [
          "https://blog.malwarebytes.com/threat-analysis/2020/06/web-skimmer-hides-within-exif-metadata-exfiltrates-credit-cards-via-image-files/"
        ]
      },
      "uuid": "c691885e-bbbe-11ea-b3de-0242ac130004",
      "value": "OSRS Actors AND Campaigns: Magecart Group 9"
    },
	{
      "description": "StrongPity3 is the evolution of StrongPity2, with a few differences. The latter does not use libcurl anymore and now uses winhttp to perform all requests to C2. The usage of the HKCU_Software_Microsoft_Windows_CurrentVersion_Run registry key has a persistence mechanism that has been replaced by the creation of a service. This service changes its name from package to package. The service executable's only job is to launch the C2 contact module upon service startup. The remaining malware flow is the same on both versions.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Actors & Campaigns"
        ],
        "refs": [
          "https://blog.talosintelligence.com/2020/06/promethium-extends-with-strongpity3.html"
        ]
      },
      "uuid": "c6918976-bbbe-11ea-b3de-0242ac130004",
      "value": "OSRS Actors AND Campaigns: StrongPity3 APT"
    },
	{
      "description": "Threat actor that targets MySQL servers using the MyKings botnet.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Actors & Campaigns"
        ],
        "refs": [
          "https://news.sophos.com/en-us/2020/07/02/mykings-jumps-on-the-corona-train/"
        ]
      },
      "uuid": "9075cfba-c1e4-11ea-b3de-0242ac130004",
      "value": "OSRS Actors AND Campaigns: Mykings Group"
    },
	{
      "description": "200 BEC campaigns linked to Cosmic Lynx since July 2019, targeting individuals in 46 countries on six continents. Unlike most BEC groups that are relatively target agnostic, Cosmic Lynx has a clear target profile: large, multinational organizations. Nearly all of the organizations Cosmic Lynx has targeted have a significant global presence and many of them are Fortune 500 or Global 2000 companies.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Actors & Campaigns"
        ],
        "refs": [
          "https://otx.alienvault.com/pulse/5f04d03c68918d97811bda03?utm_userid=osrs.researchers@gmail.com&utm_medium=InProduct&utm_source=OTX&utm_content=Email&utm_campaign=new_pulse_from_following",
		  "https://www.agari.com/cyber-intelligence-research/whitepapers/acid-agari-cosmic-lynx.pdf"
        ]
      },
      "uuid": "e570f2b4-ccdf-11ea-87d0-0242ac130003",
      "value": "OSRS Actors AND Campaigns: Cosmic Lynx BEC Group"
    },
	{
      "description": "Maze affiliates utilize other malware and are involved with other high-end organized crimeware groups conducting systematic corporate data breaches including Zloader, Gozi and TrickBot.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Actors & Campaigns"
        ],
        "refs": [
          "https://labs.sentinelone.com/enter-the-maze-demystifying-an-affiliate-involved-in-maze-snow/"
        ]
      },
      "uuid": "7f075720-d27f-11ea-87d0-0242ac130003",
      "value": "OSRS Actors AND Campaigns: SNOW (Maze Affiliate)"
    },
	{
      "description": "Threat actor attributed to the distribution of the Valak malware via email.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Actors & Campaigns"
        ],
        "refs": [
          "https://unit42.paloaltonetworks.com/valak-evolution/"
        ],
        "synonyms": [
        "Shathak"
        ]
      },
      "uuid": "7f075928-d27f-11ea-87d0-0242ac130003",
      "value": "OSRS Actors AND Campaigns: TA551"
    },
	{
      "description": "Threat actor attributed to the distribution of the Golden Chickens MaaS tool.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Actors & Campaigns"
        ],
        "refs": [
          "https://quointelligence.eu/2020/07/golden-chickens-evolution-of-the-maas/"
        ]
      },
      "uuid": "7f075b76-d27f-11ea-87d0-0242ac130003",
      "value": "OSRS Actors AND Campaigns: GC05"
    },
	{
      "description": "Threat actor attributed to the distribution of the Golden Chickens MaaS tool.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Actors & Campaigns"
        ],
        "refs": [
          "https://quointelligence.eu/2020/07/golden-chickens-evolution-of-the-maas/"
        ]
      },
      "uuid": "7f075c5c-d27f-11ea-87d0-0242ac130003",
      "value": "OSRS Actors AND Campaigns: GC06.tmp"
    },
	{
      "description": "From early May 2020, The Vatican and the Catholic Diocese of Hong Kong were among several Catholic Church-related organizations that were targeted by RedDelta, a Chinese-state sponsored threat activity group tracked by Insikt Group. This series of suspected network intrusions also targeted the Hong Kong Study Mission to China and the Pontifical Institute for Foreign Missions (PIME), Italy. These organizations have not been publicly reported as targets of Chinese threat activity groups prior to this campaign. These network intrusions occured ahead of the anticipated September 2020 renewal of the landmark 2018 China-Vatican provisional agreement, a deal which reportedly resulted in the Chinese Communist Party (CCP) gaining more control and oversight over the country’s historically persecuted underground Catholic community. In addition to the Holy See itself, another likely target of the campaign includes the current head of the Hong Kong Study Mission to China, whose predecessor was considered to have played a vital role in the 2018 agreement.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Actors & Campaigns"
        ],
        "refs": [
          "https://www.recordedfuture.com/reddelta-targets-catholic-organizations/"
        ]
      },
      "uuid": "3d6d4554-d7e3-11ea-87d0-0242ac130003",
      "value": "OSRS Actors AND Campaigns: RedDelta Threat Group"
    },
	{
      "description": "CactusPete (also known as Karma Panda or Tonto Team) is an APT group that has been publicly known since at least 2013. Some of the group’s activities have been previously described in public by multiple sources. We have been investigating and privately reporting on this group’s activity for years as well. Historically, their activity has been focused on military, diplomatic and infrastructure targets in Asia and Eastern Europe.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Actors & Campaigns"
        ],
        "refs": [
          "https://securelist.com/cactuspete-apt-groups-updated-bisonal-backdoor/97962/"
        ]
      },
      "uuid": "ba5971f8-e2df-11ea-87d0-0242ac130003",
      "value": "OSRS Actors AND Campaigns: CactusPete APT"
    },
	{
      "description": "Beginning in the first half of 2020, the rapid international spread of the COVID-19 virus introduced a shift within the threat landscape towards pandemic-themed social engineering lures. Public research has noted several Chinese APT groups adopting COVID-19 phishing lures in recent months to carry out espionage campaigns against established and expanding target sets. In March 2020,  researchers observed a phishing campaign impersonating the World Health Organization’s (WHO) guidance on COVID-19 critical preparedness to deliver a new malware family that researchers have dubbed Sepulcher. This campaign targeted European diplomatic and legislative bodies, non-profit policy research organizations, and global organizations dealing with economic affairs.  Additionally, a sender email identified in this campaign has been linked to historic Chinese APT targeting of the international Tibetan community using payloads linked to LuckyCat malware. Subsequently, a phishing campaign from July 2020 targeting Tibetan dissidents was identified delivering the same strain of Sepulcher malware. Operator email accounts identified in this campaign have been publicly linked to historic Chinese APT campaigns targeting the Tibetan community delivering ExileRAT malware. Based on the use of publicly known sender addresses associated with Tibetan dissident targeting and the delivery of Sepulcher malware payloads,  researchers have attributed both campaigns to the APT actor TA413, which has previously been documented in association with ExileRAT. The usage of publicly known Tibetan-themed sender accounts to deliver Sepulcher malware demonstrates a short-term realignment of TA413’s targets of interest. While best known for their campaigns against the Tibetan diaspora, this APT group associated with the Chinese state interest prioritized intelligence collection around Western economies reeling from COVID-19 in March 2020 before resuming more conventional targeting later this year.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Actors & Campaigns"
        ],
        "refs": [
          "https://www.proofpoint.com/us/blog/threat-insight/chinese-apt-ta413-resumes-targeting-tibet-following-covid-19-themed-economic"
        ]
      },
      "uuid": "363dc11a-eeb2-11ea-adc1-0242ac120002",
      "value": "OSRS Actors AND Campaigns: TA413 (Threat Actor)"
    },
	{
      "description": "The Salfram Campaign is a series of email campaigns utilizing links to malicious documents hosted on legitimate file-sharing platforms to spread malware. The campaign distributed various malware payloads including Gozi ISFB, ZLoader, SmokeLoader and AveMaria, among others. Ongoing campaigns are distributing various malware families using the same crypter. While effective, this crypting mechanism contains an easy-to-detect flaw - the presence of a specific string value Salfram makes it easy to track over time. Obfuscated binaries are completely different, from both a binary and execution flow graph perspective. The techniques used by this crypter can confuse weak API behavior-based systems and static analysis tools. This crypter appears to be undergoing active development and improvement over time.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Actors & Campaigns"
        ],
        "refs": [
          "https://blog.talosintelligence.com/2020/09/salfram-robbing-place-without-removing.html"
        ]
      },
      "uuid": "363dc4d0-eeb2-11ea-adc1-0242ac120002",
      "value": "OSRS Actors AND Campaigns: Salfram Campaign"
    },
	{
      "description": "The actor behind Inter has used several aliases over the years but is best known in the skimming world as Sochi. However, when the actor first surfaced in 2014, they went by poter. In 2016, poter developed the SniFall skimmer and began selling it on an underground internet forum. In late 2018, the actor created a new skimmer they dubbed Inter and started advertising it on forums under a new alias, Sochi.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Actors & Campaigns"
        ],
        "refs": [
          "https://www.riskiq.com/blog/external-threat-management/inter-skimmer/",
		  "https://community.riskiq.com/article/30f22a00"
        ],
        "synonyms": [
        "poter"
        ]
      },
      "uuid": "56df7dba-f366-11ea-adc1-0242ac120002",
      "value": "OSRS Actors AND Campaigns: Sochi (Threat Actor)"
    },
	{
      "description": "Between the months of May and July 2020, four members of PRODAFT Threat Intelligence team have conducted operation BlueRaven. A case study which originated from discovering a minor OpSec failure of a seemingly unimportant group of threat actors. Of course these threat actors have later been found to have ties with the notorious Fin7 (a.k.a.Carbanak) threat actors.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Actors & Campaigns"
        ],
        "refs": [
          "https://threatintel.blog/OPBlueRaven-Part1/"
        ]
      },
      "uuid": "56df7fb8-f366-11ea-adc1-0242ac120002",
      "value": "OSRS Actors AND Campaigns: opBlueRaven Campaign"
    },
	{
      "description": "A set of malicious Excel documents, also known as maldocs, that deliver malware through VBA-activated spreadsheets. While the malicious VBA code and the dropped payloads were something we had seen before, it was the specific way in which the Excel documents themselves were created that caught our attention. The creators of the malicious Excel documents used a technique that allows them to create macro-laden Excel workbooks, without actually using Microsoft Office. As a side effect of this particular way of working, the detection rate for these documents is typically lower than for standard maldocs.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Actors & Campaigns"
        ],
        "refs": [
          "https://blog.nviso.eu/2020/09/01/epic-manchego-atypical-maldoc-delivery-brings-flurry-of-infostealers/"
        ]
      },
      "uuid": "56df80bc-f366-11ea-adc1-0242ac120002",
      "value": "OSRS Actors AND Campaigns: Epic Manchego Campaign"
    },
	{
      "description": "The group was identified by experts from PT Expert Security Center in 2018 and used an unusual method of anchoring in the infrastructure, based on creating specific tasks (tasks) in the task scheduler. Which was the reason for the name - TaskMasters. The GitHub code for the ASPXSpy2014 web shell used in the attack contains links to Chinese developers. However, the version we found contains a link to google.com instead.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Actors & Campaigns"
        ],
        "refs": [
          "https://www.ptsecurity.com/ru-ru/research/pt-esc-threat-intelligence/shadowpad-novaya-aktivnost-gruppirovki-winnti/",
		  "https://www.ptsecurity.com/upload/corporate/ru-ru/analytics/Operation-Taskmasters-2019-rus.pdf"
        ]
      },
      "uuid": "465529ea-f81b-11ea-adc1-0242ac120002",
      "value": "OSRS Actors AND Campaigns: TaskMasters Group"
    },
	{
      "description": "The cybercrime group TeamTNT has been tracked by various research groups for a while now, with several articles that were written about their activity that is focused on Docker workloads. In May, TrendMicro research team described the group’s attempts to spread cryptocurrency miners via exposed Docker API servers. In August, Aqua Security released an analysis of several images that are stored under TeamTNT’s Dockerhub account - hildeteamtnt.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Actors & Campaigns"
        ],
        "refs": [
          "https://techcommunity.microsoft.com/t5/azure-security-center/teamtnt-activity-targets-weave-scope-deployments/ba-p/1645968"
        ]
      },
      "uuid": "46552c10-f81b-11ea-adc1-0242ac120002",
      "value": "OSRS Actors AND Campaigns: TeamTNT Cybercrime Group"
    },
	{
      "description": "Named Malsmoke, the group has operated on a scale far above similar other cybercrime operations and has abused practically all adult ad networks. According to cyber-security firm Malwarebytes, which has been tracking Malsmoke's attacks, for most of the time, the group has managed to place malicious ads (malverts) on mid-tier adult portals, but they recently hit the jackpot when they managed to sneak malverts on xHamster, one of the biggest adult video portals today, and one of the biggest sites on the internet, with billions of visitors each month. The role of the group's malicious ads was to use JavaScript trickery and redirect users from the adult portal to a malicious site that was hosting an exploit kit. The exploit kits would then use vulnerabilities in Adobe Flash Player or Internet Explorer to install malware on the user's computers, with the most common payloads being Smoke Loader, Raccoon Stealer, and ZLoader. Naturally, only users still using Internet Explorer or Adobe Flash were targeted by these malicious ads. The attacks can be considered as a last hurrah attempt to infect users with old-school hacking tools like exploit kits, whose usage has declined in recent years as modern browsers have become harder to hack.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Actors & Campaigns"
        ],
        "refs": [
          "https://www.zdnet.com/article/porn-site-users-targeted-with-malicious-ads-redirecting-to-exploit-kits-malware/#ftag=RSSbaffb68"
        ]
      },
      "uuid": "46552f44-f81b-11ea-adc1-0242ac120002",
      "value": "OSRS Actors AND Campaigns: Malsmoke Threat Actor"
    },
	{
      "description": "Research unraveled an ongoing surveillance operation by Iranian entities that has been targeting Iranian expats and dissidents for years. Four variants of Windows infostealers intended to steal the victim’s personal documents as well as access to their Telegram Desktop and KeePass account information. Android backdoor that extracts two-factor authentication codes from SMS messages, records the phone’s voice surroundings and more. Telegram phishing pages, distributed using fake Telegram service accounts.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Actors & Campaigns"
        ],
        "refs": [
          "https://research.checkpoint.com/2020/rampant-kitten-an-iranian-espionage-campaign/"
        ]
      },
      "uuid": "ecfb1a00-fd9f-11ea-adc1-0242ac120002",
      "value": "OSRS Actors AND Campaigns: Rampant Kitten (Iranian Espionage Campaign)"
    },
	{
      "description": "Grayfly has been particularly active in recent years, mounting high volume espionage attacks against organizations spread across Asia, Europe, and North America. They are interested in a wide range of sectors, including food, financial, healthcare, hospitality, manufacturing, telecoms, and government. It is known for using the Barlaiy/POISONPLUG and Crosswalk/ProxIP (Backdoor.Motnug) malware families in its attacks. Victims are frequently compromised by exploiting public facing web servers.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Actors & Campaigns"
        ],
        "refs": [
          "https://symantec-enterprise-blogs.security.com/blogs/threat-intelligence/apt41-indictments-china-espionage"
        ]
      },
      "uuid": "3414de2a-031e-11eb-adc1-0242ac120002",
      "value": "OSRS Actors AND Campaigns: Grayfly APT"
    },
	{
      "description": "This group—dubbed Jointworm—has been active since at least August 2017 and appears to be financially motivated. This latest campaign aimed at the financial sector appears to have started in December 2019. Researchers spotted Jointworm in at least seven organizations in the period from December 2019 to June 2020. Jointworm is identified by its use of a JavaScript backdoor (or EVILNUM) which is custom to the group. This backdoor is typically delivered via malicious emails that contain a link to a ZIP archive. The archive file contains an LNK attachment masquerading as an Office document, an Excel sheet for example, which contains malicious JavaScript. Its targets in this recent campaign include companies in the financial sector internationally, including those that operate within the stock exchange markets, and some tech companies that develop technologies for use by financial organizations (also known as fintech companies). A media company was also targeted in this campaign. The group was able to spend a significant amount of time on the networks of some of its victims. Jointworm was present on the network of one financial sector organization for 184 days, and another financial sector victim for 123 days.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Actors & Campaigns"
        ],
        "refs": [
          "https://symantec.broadcom.com/hubfs/SED-Threats-Financial-Sector.pdf"
        ]
      },
      "uuid": "3414e050-031e-11eb-adc1-0242ac120002",
      "value": "OSRS Actors AND Campaigns: Jointworm (Evilnum APT)"
    },
	{
      "description": "GADOLINIUM is a nation-state activity group that has been compromising targets for nearly a decade with a worldwide focus on the maritime and health industries. As with most threat groups, GADOLINIUM tracks the tools and techniques of security practitioners looking for new techniques they can use or modify to create new exploit methods.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Actors & Campaigns"
        ],
        "refs": [
          "https://www.microsoft.com/security/blog/2020/09/24/gadolinium-detecting-empires-cloud/"
        ]
      },
      "uuid": "3414e14a-031e-11eb-adc1-0242ac120002",
      "value": "OSRS Actors AND Campaigns: GADOLINIUM Threat Group"
    },
	{
      "description": "In June 2020, 360 Security Center discovered a new backdoor Pyark written in Python by the fileless attack protection function. Through in-depth excavation and trace analysis of the backdoor, we discovered a series of advanced threat actions that have been active since 2019. By invading various military institutions in Venezuela, the attackers deployed backdoor to continuously monitor and steal the latest military secrets. We named it APT-C-43 based on 360’s way of naming the APT organization. When tracing the attacker’s source, we found that the duration of this attack coincided with the Venezuelan political chaos, and the network assets used by the attackers were mostly deployed in Colombia, and some assets were frequently found in Venezuela and Colombia. After the United Venezuelan coup, the reactionary government headed by Juan Gerardo Guaidó Márquez fled to Colombia to seek military assistance. We guess the political background of APT-C -43’s campaign may be to help the reactionaries led by Juan steal military secrets of the Venezuelan military and provide intelligence support for the confrontation between the reactionary government and the current Venezuelan government. Therefore, we named this series of attacks HpReact.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Actors & Campaigns"
        ],
        "refs": [
          "https://blog.360totalsecurity.com/en/apt-c-43-steals-venezuelan-military-secrets-to-provide-intelligence-support-for-the-reactionaries-hpreact-campaign/"
        ]
      },
      "uuid": "3414e21c-031e-11eb-adc1-0242ac120002",
      "value": "OSRS Actors AND Campaigns: APT-C-43"
    },
	{
      "description": "In June 2020, 360 Security Center discovered a new backdoor Pyark written in Python by the fileless attack protection function. Through in-depth excavation and trace analysis of the backdoor, we discovered a series of advanced threat actions that have been active since 2019. By invading various military institutions in Venezuela, the attackers deployed backdoor to continuously monitor and steal the latest military secrets. We named it APT-C-43 based on 360’s way of naming the APT organization. When tracing the attacker’s source, we found that the duration of this attack coincided with the Venezuelan political chaos, and the network assets used by the attackers were mostly deployed in Colombia, and some assets were frequently found in Venezuela and Colombia. After the United Venezuelan coup, the reactionary government headed by Juan Gerardo Guaidó Márquez fled to Colombia to seek military assistance. We guess the political background of APT-C -43’s campaign may be to help the reactionaries led by Juan steal military secrets of the Venezuelan military and provide intelligence support for the confrontation between the reactionary government and the current Venezuelan government. Therefore, we named this series of attacks HpReact.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Actors & Campaigns"
        ],
        "refs": [
          "https://blog.360totalsecurity.com/en/apt-c-43-steals-venezuelan-military-secrets-to-provide-intelligence-support-for-the-reactionaries-hpreact-campaign/"
        ]
      },
      "uuid": "2dd6303a-031f-11eb-adc1-0242ac120002",
      "value": "OSRS Actors AND Campaigns: HpReact Campaign"
    },
	{
      "description": "Group-IB Threat Intelligence team recently tracked a successful attack conducted on a Russian medical company by OldGremlin, a new criminal group. The threat actor encrypted the company's entire corporate network and demanded a $50,000 ransom. It is common knowledge that Russian hackers have an unspoken rule about not working within Russia and post-Soviet countries. Yet OldGremlin, made up of Russian speakers, is actively attacking Russian companies -  banks, industrial enterprises, medical organizations, software developers… According to Group-IB expert estimations, since the spring OldGremlin has conducted at least seven phishing campaigns. The hackers have impersonated the self-regulatory organization Mikrofinansirovaniye i Razvitiye (SRO MiR), a Russian metallurgical holding company, the Belarusian plant Minsk Tractor Works, a dental clinic, and the media holding company RBC.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Actors & Campaigns"
        ],
        "refs": [
          "https://www.group-ib.com/blog/oldgremlin"
        ]
      },
      "uuid": "31a02886-0335-11eb-adc1-0242ac120002",
      "value": "OSRS Actors AND Campaigns: OldGremlin APT"
    },
	{
      "description": "The actor, known as TA2552, uses well-crafted Spanish language lures that leverage a narrow range of themes and brands. The lures entice users to click a link in the message, taking them to the legitimate Microsoft third-party apps consent page. There they are prompted to grant a third-party application read-only user permissions to their O365 account via OAuth2 or other token-based authorization methods. TA2552 seeks access to specific account resources like the user’s contacts and mail. Requesting read-only permissions for such account resources could be used to conduct account reconnaissance, silently steal data, or to intercept password reset messages from other accounts such as those at financial institutions. While organizations with global presence have received messages from this group, they appear to choose recipients who are likely Spanish speakers.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Actors & Campaigns"
        ],
        "refs": [
          "https://www.proofpoint.com/us/blog/threat-insight/ta2552-uses-oauth-access-token-phishing-exploit-read-only-risks"
        ]
      },
      "uuid": "6dc1d5bc-0899-11eb-adc1-0242ac120002",
      "value": "OSRS Actors AND Campaigns: TA2552 APT"
    },
	{
      "description": "Palmerworm uses a combination of custom malware, dual use tools, and living-off-the-land tactics in this campaign. Palmerworm has been active since at least 2013, with the first activity seen in this campaign in August 2019.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Actors & Campaigns"
        ],
        "refs": [
          "https://symantec-enterprise-blogs.security.com/blogs/threat-intelligence/palmerworm-blacktech-espionage-apt"
        ]
      },
      "uuid": "6dc1d83c-0899-11eb-adc1-0242ac120002",
      "value": "OSRS Actors AND Campaigns: Palmerworm Espionage Gang"
    },
	{
      "description": "Targets crypto currency companies using various malwares.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Actors & Campaigns"
        ],
        "refs": [
          "https://vblocalhost.com/uploads/VB2020-18.pdf"
        ],
        "synonyms": [
        "Dangerous Password APT",
        "CageyChameleon APT",
		"Leery Turtle APT",
		"CryptoCore APT"
        ]
      },
      "uuid": "6dc1db16-0899-11eb-adc1-0242ac120002",
      "value": "OSRS Actors AND Campaigns: CryptoMimic APT"
    },
	{
      "description": "Threat actor and exploit author.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Actors & Campaigns"
        ],
        "refs": [
          "https://research.checkpoint.com/2020/graphology-of-an-exploit-volodya/"
        ]
      },
      "uuid": "6dc1dc10-0899-11eb-adc1-0242ac120002",
      "value": "OSRS Actors AND Campaigns: Volodya Threat Actor"
    },
	{
      "description": "Threat actor and exploit author.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Actors & Campaigns"
        ],
        "refs": [
          "https://research.checkpoint.com/2020/graphology-of-an-exploit-volodya/"
        ]
      },
      "uuid": "6dc1dcec-0899-11eb-adc1-0242ac120002",
      "value": "OSRS Actors AND Campaigns: PlayBit Threat Actor"
    },
	{
      "description": "Campaign conducted by Chinese threat actor. Targets East Asian countries. Malware includes Royal Road, Poison Ivy, and Cotx RAT.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Actors & Campaigns"
        ],
        "refs": [
          "https://vblocalhost.com/uploads/VB2020-20.pdf"
        ]
      },
      "uuid": "3345aec6-089a-11eb-adc1-0242ac120002",
      "value": "OSRS Actors AND Campaigns: Campaign - LagTime IT"
    },
	{
      "description": "ESET malware researchers Matthieu Faou and Francis Labelle say that the group has been running cyber-espionage campaigns since at least 2011. XDSpy’s main interest is in the Eastern Europe and Balkans regions (Belarus, Moldova, Russia, Serbia, and Ukraine), targeting primarily government agencies (military, Ministries of Foreign Affairs), although private companies are also among its victims.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Actors & Campaigns"
        ],
        "refs": [
          "https://www.bleepingcomputer.com/news/security/xdspy-cyber-espionage-group-operated-discretely-for-nine-years/"
        ]
      },
      "uuid": "dd08a9d2-08b2-11eb-adc1-0242ac120002",
      "value": "OSRS Actors AND Campaigns: XDSpy APT"
    },
	{
      "description": "In summer 2020 we uncovered a previously unknown multi-module C++ toolset used in highly targeted industrial espionage attacks dating back to 2018. Initially the reason for our interest in this malware was its rarity, the obviously targeted nature of the campaign and the fact that there are no obvious similarities with already known campaigns at the level of code, infrastructure or TTPs. To date, we consider this toolset and the actor behind it to be new. The malware authors named the toolset MT3, following this abbreviation we have named the toolset MontysThree.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Actors & Campaigns"
        ],
        "refs": [
          "https://securelist.com/montysthree-industrial-espionage/98972/"
        ]
      },
      "uuid": "85cd71f4-0e14-11eb-adc1-0242ac120002",
      "value": "OSRS Actors AND Campaigns: MT3 Threat Actor"
    },
	{
      "description": "While the public has only recently discovered this set of activity, IAmTheKing has been very active for a few years. Considering the type of organizations that cybercriminals have been targeting, we felt that there was little public interest in raising awareness about this group beyond our trusted circle of industry partners. However, now that researchers have started investigating this threat actor, we want to assist the community as much as possible by providing this brief summary of our knowledge of IAmTheKing. Based on the type of information IAmTheKing is after, we believe that it is state-sponsored. Its toolset is rapidly evolving, and it is not afraid to experiment with non-standard communications channels. The group is characterized by a mastery of traditional pentesting methodologies and a solid command of Powershell. Data available to us indicates that it has achieved operational success on numerous occasions.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Actors & Campaigns"
        ],
        "refs": [
          "https://securelist.com/iamtheking-and-the-slothfulmedia-malware-family/99000/"
        ]
      },
      "uuid": "0a09f014-146e-11eb-adc1-0242ac120002",
      "value": "OSRS Actors AND Campaigns: IAmTheKing Threat Actor"
    },
	{
      "description": "A ransomware gang going by the of Egregor has leaked data it claims to have obtained from the internal networks of two of today's largest gaming companies — Ubisoft and Crytek.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Actors & Campaigns"
        ],
        "refs": [
          "https://www.zdnet.com/article/ubisoft-crytek-data-posted-on-ransomware-gangs-site/"
        ]
      },
      "uuid": "0a09f244-146e-11eb-adc1-0242ac120002",
      "value": "OSRS Actors AND Campaigns: Egregor Ransomware Gang"
    },
	{
      "description": "This is not the first time that Iranian threat actors use wipers as part of their TTPs. The threat actor APT33 used wipers in at least three different attacks, the most notorious of them being the Shamoon attack. In contrast to APT33, MuddyWater is known for their social engineering campaigns. The primary objectives of previous MuddyWater campaigns were espionage and information theft. In Operation Quicksand we uncovered the first known instance of a potentially destructive attack executed by MuddyWater, focusing on prominent organizations in Israel and in other countries around the world. We identified a repetitive PDB path in the networks that were researched containing the word Covic. This may indicate a covid-19 inspiration and suggests the possible dates in which MuddyWater might have developed the malware.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Actors & Campaigns"
        ],
        "refs": [
          "https://www.clearskysec.com/operation-quicksand/",
		  "https://www.clearskysec.com/wp-content/uploads/2020/10/Operation-Quicksand.pdf"
        ]
      },
      "uuid": "0a09f33e-146e-11eb-adc1-0242ac120002",
      "value": "OSRS Actors AND Campaigns: Operation Quicksand"
    },
	{
      "description": "Threat actor associated with the threat group PhantomGhost. Also suspected to be the owner of the KashmirBlack botnet.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Actors & Campaigns"
        ],
        "refs": [
          "https://www.zdnet.com/article/kashmirblack-botnet-behind-attacks-on-cmss-like-wordpress-joomla-drupal-others/",
		  "https://www.imperva.com/blog/crimeops-of-the-kashmirblack-botnet-part-i/",
		  "https://www.imperva.com/blog/crimeops-of-the-kashmirblack-botnet-part-ii/",
		  "https://www.imperva.com/blog/wp-content/uploads/sites/9/2020/10/CrimeOps-of-the-KashmirBlack-Botnet-Appendix.pdf"
        ]
      },
      "uuid": "ce04be5c-1925-11eb-adc1-0242ac120002",
      "value": "OSRS Actors AND Campaigns: Exect1337 (Threat Actor)"
    },
	{
      "description": "Threat group suspected to be the owner of the KashmirBlack botnet.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Actors & Campaigns"
        ],
        "refs": [
          "https://www.zdnet.com/article/kashmirblack-botnet-behind-attacks-on-cmss-like-wordpress-joomla-drupal-others/",
		  "https://www.imperva.com/blog/crimeops-of-the-kashmirblack-botnet-part-i/",
		  "https://www.imperva.com/blog/crimeops-of-the-kashmirblack-botnet-part-ii/",
		  "https://www.imperva.com/blog/wp-content/uploads/sites/9/2020/10/CrimeOps-of-the-KashmirBlack-Botnet-Appendix.pdf"
        ]
      },
      "uuid": "ce04c0a0-1925-11eb-adc1-0242ac120002",
      "value": "OSRS Actors AND Campaigns: PhantomGhost Threat Group"
    },
	{
      "description": "We recently published a research paper on Operation Earth Kitsune, a watering hole campaign aiming to steal information by compromising websites. Besides its heavy use of SLUB malware, researchers also uncovered two new espionage backdoors associated with the campaign - agfSpy and dneSpy, dubbed as such following the attackers’ three-letter naming scheme. Previous research on the operation found that, while SLUB was primarily used to exfiltrate data, agfSpy and dneSpy were employed for the same purpose but also for seizing control of affected systems.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Actors & Campaigns"
        ],
        "refs": [
          "https://www.trendmicro.com/en_us/research/20/j/operation-earth-kitsune-a-dance-of-two-new-backdoors.html"
        ]
      },
      "uuid": "ab9a45d4-1e9e-11eb-adc1-0242ac120002",
      "value": "OSRS Actors AND Campaigns: Operation Earth Kitsune"
    },
	{
      "description": "Through Mandiant investigation of intrusions, the FLARE Advanced Practices team observed a group we track as UNC1945 compromise managed service providers and operate against a tailored set of targets within the financial and professional consulting industries by leveraging access to third-party networks (see this blog post for an in-depth description of UNC groups). UNC1945 targeted Oracle Solaris operating systems, utilized several tools and utilities against Windows and Linux operating systems, loaded and operated custom virtual machines, and employed techniques to evade detection. UNC1945 demonstrated access to exploits, tools and malware for multiple operating systems, a disciplined interest in covering or manipulating their activity, and displayed advanced technical abilities during interactive operations.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Actors & Campaigns"
        ],
        "refs": [
          "https://www.fireeye.com/blog/threat-research/2020/11/live-off-the-land-an-overview-of-unc1945.html"
        ]
      },
      "uuid": "96f2d032-2421-11eb-adc1-0242ac120002",
      "value": "OSRS Actors AND Campaigns: UNC1945 Threat Group"
    },
	{
      "description": "Recently, we’ve observed several cases where DLL side-loading was used to execute the malicious code. Side-loading is the use of a malicious DLL spoofing a legitimate one, relying on legitimate Windows executables to load and execute the malicious code. While the technique is far from new—we first saw it used by (mostly Chinese) APT groups as early as 2013, before cybercrime groups started to add it to their arsenal—this particular payload was not one we’ve seen before. It stands out because the threat actors used several plaintext strings written in poor English with politically inspired messages in their samples. The cases are connected by a common artifact: the program database (PDB) path. All samples share a similar PDB path, with several of them containing the folder name KilllSomeOne. Based on the targeting of the attacks—against non-governmental organizations and  other organizations  in Myanmar— and other characteristics of the malware involved, we have reason to believe that the actors involved are a Chinese APT group.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Actors & Campaigns"
        ],
        "refs": [
          "https://www.zdnet.com/article/new-active-hacking-group-leverages-killlsomeone-dll-side-loading/#ftag=RSSbaffb68",
		  "https://news.sophos.com/en-us/2020/11/04/a-new-apt-uses-dll-side-loads-to-killlsomeone/"
        ]
      },
      "uuid": "96f2d294-2421-11eb-adc1-0242ac120002",
      "value": "OSRS Actors AND Campaigns: PlugX APT"
    },
	{
      "description": "Recently, Check Point Research encountered a series of worldwide attacks relevant to VoIP, specifically to Session initiation Protocol (SIP) servers. Based on information provided by our global sensors, there appears to be a systematic exploitation pattern of SIP servers from different manufactures. Further exploration revealed that this is part of a large, profitable business model run by hackers. Hacking SIP servers and gaining control allows hackers to abuse them in several ways. One of the more complex and interesting ways is abusing the servers to make outgoing phone calls, which are also used to generate profits. Making calls is a legitimate feature, therefore it’s hard to detect when a server has been exploited. During our research, we discovered a new campaign targeting Sangoma PBX (an open-source web GUI that manages Asterisk).  Asterisk is the world’s most popular VoIP PBX system, and it is used by many Fortune 500 companies for telecommunications. The attack exploits CVE-2019-19006, a critical vulnerability in Sangoma, granting the attacker admin access to the system. During the first half of 2020, we observed numerous attack attempts on sensors worldwide. We exposed the attacker’s entire attack flow, from the initial exploitation of CVE-2019-19006 to uploading encoded PHP files that leverage the compromised system. The group shares a number of tools related to SIP server exploitation - scanners, authentication bypass, and remote code execution scripts. Among these scripts, we found a variant of the brute-force script seen in the Pastebin of INJ3CTOR3. The group’s main purpose is to sell phone numbers, calls plans, and live access to VoIP services compromised as part of the Inj3ct0r attacks.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Actors & Campaigns"
        ],
        "refs": [
          "https://research.checkpoint.com/2020/inj3ctor3-operation-leveraging-asterisk-servers-for-monetization/"
        ]
      },
      "uuid": "96f2d3ac-2421-11eb-adc1-0242ac120002",
      "value": "OSRS Actors AND Campaigns: INJ3CTOR3 Operation"
    },
	{
      "description": "Referred to as PyXie by BlackBerry Cylance and GOLD DUPONT by SecureWorks, has been actively conducting successful ransomware operations that have impacted organizations in a number of sectors including healthcare, education, government and technology while remaining under the radar.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Actors & Campaigns"
        ],
        "refs": [
          "https://unit42.paloaltonetworks.com/vatet-pyxie-defray777/"
        ],
        "synonyms": [
        "Gold Dupont"
        ]
      },
      "uuid": "d3f3721c-29a2-11eb-adc1-0242ac120002",
      "value": "OSRS Actors AND Campaigns: PyXie APT"
    },
	{
      "description": "The North African Fox organization's load delivery methods are mainly phishing websites and third-party file hosting websites, and different load delivery methods are used at different time periods.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Actors & Campaigns"
        ],
        "refs": [
          "https://blogs.360.cn/post/APT-C-44.html"
        ],
        "synonyms": [
        "APT-C-44"
        ]
      },
      "uuid": "d3f3750a-29a2-11eb-adc1-0242ac120002",
      "value": "OSRS Actors AND Campaigns: North African Fox"
    },
	{
      "description": "During the past six months, the BlackBerry Research and Intelligence team have been monitoring a cyber-espionage campaign that is targeting disparate victims around the globe. The campaign, dubbed CostaRicto by BlackBerry, appears to be operated by hackers-for-hire, a group of APT mercenaries who possess bespoke malware tooling and complex VPN proxy and SSH tunnelling capabilities. Mercenary groups offering APT-style attacks are becoming more and more popular. Their tactics, techniques, and procedures (TTPs) often resemble highly sophisticated state-sponsored campaigns, but the profiles and geography of their victims are far too diverse to be aligned with a single bad actor’s interests. Although in theory the customers of a mercenary APT might include anyone who can afford it, the more sophisticated actors will naturally choose to work with patrons of the highest profile – be it large organizations, influential individuals, or even governments. Having a lot at stake, the cybercriminals must choose very carefully when selecting their commissions to avoid the risk of being exposed. Outsourcing an espionage campaign, or part of it, to a mercenary group might be very compelling, especially to businesses and individuals who seek intelligence on their competition yet may not have the required tooling, infrastructure and experience to conduct an attack themselves. But even notorious adversaries experienced in cyber-espionage can benefit from adding a layer of indirection to their attacks. By using a mercenary as their proxy, the real attacker can better protect their identity and thwart attempts at attribution.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Actors & Campaigns"
        ],
        "refs": [
          "https://blogs.blackberry.com/en/2020/11/the-costaricto-campaign-cyber-espionage-outsourced"
        ]
      },
      "uuid": "736a93a2-29a3-11eb-adc1-0242ac120002",
      "value": "OSRS Actors AND Campaigns: The CostaRicto Campaign"
    },
	{
      "description": "DeathStalker is a threat actor that’s been active since at least 2012, and we exposed most of their past activities in a previous article, as well as during a GREAT Ideas conference in August 2020. The actor drew our attention in 2018 because of distinctive attack characteristics that didn’t fit in with the usual cybercrime or state-sponsored activities, leading us to believe DeathStalker is a hack-for-hire group. DeathStalker has leveraged several malware strains and delivery chains over the years, from the Python- and VisualBasic-based Janicab to the PowerShell-based Powersing and the JavaScript-based Evilnum. The actor consistently used what we call dead-drop resolvers (DDRs), which is obfuscated content hosted on major public web services like YouTube, Twitter or Reddit, once decoded by malware this content reveals a command-and-control (C2) server address. DeathStalker also consistently leveraged anti-detection and antivirus evasion techniques, as well as intricate delivery chains that drop lots of files to the target’s filesystems. To kick-start an infection, DeathStalker usually relies on spear-phishing emails with attachments, or links to public file sharing services, as well as script execution based on Windows shortcuts. We have identified how DeathStalker’s malware compromises in clusters or targets various types of entities in all parts of the world, with a possible focus on law and consultancy offices, as well as FINTECH companies, but without a clearly identifiable or consistent interest. The targeting does not seem to be politically or strategically defined and doesn’t appear to be the usual financially motived crime. Because of this, we conclude that DeathStalker is a cyber-mercenary organization. While tracking DeathStalker’s Powersing-based activities in May 2020, we detected a previously unknown implant that leveraged DNS over HTTPS as a C2 channel, as well as parts of its delivery chain. We named this new malware PowerPepper. We first spotted a variant of PowerPepper in the wild in mid-July 2020, dropped from a Word document that had been submitted on a public multiscanner service. Since then, the PowerPepper implant and the associated delivery chain has been continuously operating and developing.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Actors & Campaigns"
        ],
        "refs": [
          "https://securelist.com/what-did-deathstalker-hide-between-two-ferns/99616/"
        ]
      },
      "uuid": "6d32c9d2-3961-11eb-adc1-0242ac120002",
      "value": "OSRS Actors AND Campaigns: DeathStalker APT"
    },
	{
      "description": "ESET researchers discovered that chat software called Able Desktop, part of a business management suite popular in Mongolia and used by 430 government agencies in Mongolia (according to Able), was used to deliver the HyperBro backdoor (commonly used by LuckyMouse), the Korplug RAT (also known as PlugX), and a RAT called Tmanger (which was first documented by NTT Security and was used during Operation Lagtime IT campaigns attributed to TA428 by Proofpoint). A connection with the ShadowPad backdoor, which is now used by at least five different threat actors, was also found. Two different trojanized installers, as well as a likely compromised update system, were used to deliver the payloads. According to our telemetry we think the Able update system has been compromised since at least June 2020 and trojanized installers delivered since at least May 2018.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Actors & Campaigns"
        ],
        "refs": [
          "https://www.welivesecurity.com/2020/12/10/luckymouse-ta428-compromise-able-desktop/"
        ]
      },
      "uuid": "54edec4e-3e11-11eb-b378-0242ac130002",
      "value": "OSRS Actors AND Campaigns: Operation StealthyTrident"
    },
	{
      "description": "Threat group that targets Asian countries such as Taiwan. Inects java script backdoors to steal information from target systems. Also employs modified versions of the backdoor Cobalt Strike.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Actors & Campaigns"
        ],
        "refs": [
          "https://www.trendmicro.com/en_us/research/21/a/earth-wendigo-injects-javascript-backdoor-to-service-worker-for-.html"
        ]
      },
      "uuid": "8b5246ae-5036-11eb-ae93-0242ac130002",
      "value": "OSRS Actors AND Campaigns: Earth Wendigo Threat Group"
    },
	{
      "description": "With Bitcoin on the rise and a market exceeding billions of dollars, cryptocurrency has attracted threat actors wishing to leverage these capitals for their own financial gain. In December, researchers discovered a wide-ranging operation targeting cryptocurrency users, estimated to have initiated in January 2020. This extensive operation is composed of a full-fledged marketing campaign, custom cryptocurrency-related applications and a new Remote Access Tool (RAT) written from scratch. The campaign includes Domain registrations, researchersbsites, trojanized applications, fake social media accounts and a new undetected RAT that researchers have named ElectroRAT. ElectroRAT is written in Golang and compiled to target multiple operating systems Windows, Linux and MacOS. It is rather common to see various information stealers trying to collect private keys to access victims’ wallets. Horesearchersver, it is rare to see tools written from scratch and used to target multiple operating systems for these purposes. The attacker behind this operation has lured cryptocurrency users to download trojanized applications by promoting them in dedicated online forums and on social media. Researchers estimate this campaign has already infected thousands of victims—based on the number of unique visitors to the pastebin pages used to locate the command and control servers.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Actors & Campaigns"
        ],
        "refs": [
          "https://www.intezer.com/blog/research/operation-electrorat-attacker-creates-fake-companies-to-drain-your-crypto-wallets/"
        ]
      },
      "uuid": "07c883ec-5037-11eb-ae93-0242ac130002",
      "value": "OSRS Actors AND Campaigns: Operation ElectroRAT"
    },
	{
      "description": "On December 13, 2020, FireEye published a blog post detailing a supply chain attack leveraging Orion IT, an infrastructure monitoring and management platform by SolarWinds. In parallel, Volexity published an article with their analysis of related attacks, attributed to an actor named Dark Halo. FireEye did not link this activity to any known actor; instead, they gave it an unknown, temporary moniker – UNC2452.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Actors & Campaigns"
        ],
        "refs": [
          "https://securelist.com/sunburst-backdoor-kazuar/99981/"
        ],
        "synonyms": [
        "UNC2452"
        ]
      },
      "uuid": "0a6aa8cc-567d-11eb-ae93-0242ac130002",
      "value": "OSRS Actors AND Campaigns: Dark Halo Threat Group"
    },
	{
      "description": "NCC Group and Fox-IT have been tracking a threat group with a wide set of interests, from intellectual property (IP) from victims in the semiconductors industry through to data from the airline industry. In their intrusions they regularly abuse cloud services from Google and Microsoft to achieve their goals. NCC Group and Fox-IT observed this threat actor during various incident response engagements performed between October 2019 until April 2020. Our threat intelligence analysts noticed clear overlap between the various cases in infrastructure and capabilities, and as a result we assess with moderate confidence that one group was carrying out the intrusions across multiple victims operating in Chinese interests. In open source this actor is referred to as Chimera by CyCraft. NCC Group and Fox-IT have seen this actor remain undetected, their dwell time, for up to three years. As such, if you were a victim, they might still be active in your network looking for your most recent crown jewels.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Actors & Campaigns"
        ],
        "refs": [
          "https://research.nccgroup.com/2021/01/12/abusing-cloud-services-to-fly-under-the-radar/"
        ]
      },
      "uuid": "0a6aab9c-567d-11eb-ae93-0242ac130002",
      "value": "OSRS Actors AND Campaigns: Chimera Threat Actor"
    },
	{
      "description": "ClearSky researchers identified a malicious .docx file that was uploaded to VirusTotal from Russia in mid-December. The file contains an obfuscated URL to a remote template which contains malicious VBA, eventually leading to the execution of VBS on the infected machine. The attack’s purpose is to stealthily exfiltrate information without running any external executables on the system. Notably, the process is escalated on a certain day of the week, suggesting a possible familiarity with the intended victim or victims. We estimate with medium confidence that the same threat actor responsible for the attacks described in this paper also conducted an attack named Operation Domino that occurred earlier in 2020. We decided to name the operation Kremlin due to the use of a parameter named kreml in the poslai (meaning send in Russian) function that exfiltrates the data.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Actors & Campaigns"
        ],
        "refs": [
          "https://www.clearskysec.com/operation-kremlin/"
        ]
      },
      "uuid": "8541d4bc-567d-11eb-ae93-0242ac130002",
      "value": "OSRS Actors AND Campaigns: Operation Kremlin"
    },
	{
      "description": "In 2020 ESET saw several attacks targeting Colombian entities exclusively. These attacks are still ongoing at the time of writing and are focused on both government institutions and private companies. For the latter, the most targeted sectors are energy and metallurgical. The attackers rely on the use of remote access trojans, most likely to spy on their victims. They have a large network infrastructure for command and control: ESET observed at least 24 different IP addresses in use in the second half of 2020. These are probably compromised devices that act as proxies for their C&C servers. This, combined with the use of dynamic DNS services, means that their infrastructure never stays still. We have seen at least 70 domain names active in this timeframe and they register new ones on a regular basis.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Actors & Campaigns"
        ],
        "refs": [
          "https://www.welivesecurity.com/2021/01/12/operation-spalax-targeted-malware-attacks-colombia/"
        ]
      },
      "uuid": "8541d840-567d-11eb-ae93-0242ac130002",
      "value": "OSRS Actors AND Campaigns: Operation Spalax"
    },
	{
      "description": "In 2019, Unit 42 researchers documented cloud-targeted malware used by the Rocke Group to conduct cryptojacking attacks to mine for Monero. Since then, cybersecurity companies have had the malware on their radar, which hampered Rocke Group’s cryptojacking operation. In response, the threat actors updated the malware. Here, we uncover a revised version of the same cloud-targeted cryptojacking malware, which now includes new and improved rootkit and worm capabilities. We also detail the hiding techniques used by the malware to dodge cybersecurity companies’ detection methods, while explaining its four-module structure. We’ve named the malware Pro-Ocean after the name the attacker chose for the installation script. Pro-Ocean uses known vulnerabilities to target cloud applications . In our analysis, we found Pro-Ocean targeting Apache ActiveMQ (CVE-2016-3088), Oracle WebLogic (CVE-2017-10271) and Redis (unsecure instances). In the case that the malware runs in Tencent Cloud or Alibaba Cloud, it will use the exact code of the previous malware to uninstall monitoring agents to avoid detection. Additionally, it attempts to remove other malware and miners including Luoxk, BillGates, XMRig and Hashfish before installation. Once installed, the malware kills any process that uses the CPU heavily, so that it’s able to use 100% of the CPU and mine Monero efficiently.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Actors & Campaigns"
        ],
        "refs": [
          "https://unit42.paloaltonetworks.com/pro-ocean-rocke-groups-new-cryptojacking-malware/"
        ]
      },
      "uuid": "09f44a34-6626-11eb-ae93-0242ac130002",
      "value": "OSRS Actors AND Campaigns: Rocke Group APT"
    },
	{
      "description": "During 2020, ESET research reported various supply-chain attacks, such as the case of WIZVERA VeraPort, used by government and banking websites in South Korea, Operation StealthyTrident compromising the Able Desktop chat software used by several Mongolian government agencies, and Operation SignSight, compromising the distribution of signing software distributed by the Vietnamese government. In January 2021, we discovered a new supply-chain attack compromising the update mechanism of NoxPlayer, an Android emulator for PCs and Macs, and part of BigNox’s product range with over 150 million users worldwide. This software is generally used by gamers in order to play mobile games from their PCs, making this incident somewhat unusual. Three different malware families were spotted being distributed from tailored malicious updates to selected victims, with no sign of leveraging any financial gain, but rather surveillance-related capabilities. We spotted similarities in loaders we have been monitoring in the past with some of the ones used in this operation, such as instances we discovered in a Myanmar presidential office website supply-chain compromise on 2018, and in early 2020 in an intrusion into a Hong Kong university.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Actors & Campaigns"
        ],
        "refs": [
          "https://www.welivesecurity.com/2021/02/01/operation-nightscout-supply-chain-attack-online-gaming-asia//"
        ]
      },
      "uuid": "09f44c8c-6626-11eb-ae93-0242ac130002",
      "value": "OSRS Actors AND Campaigns: Operation NightScout"
    },
	{
      "description": "TAIPEI (Taiwan News) — Following an FBI alert about China-backed malicious cyber activity, Taiwan's Ministry of Justice Investigation Bureau is warning of a threat from two hacking groups backed by the Chinese government and revealed a list of 11 domain names that government-linked agencies and businesses should block. The bureau on Wednesday (Aug 19) suggested that Taidoor and Blacktech — two hacking groups linked to the Chinese government — have often infiltrated government agencies and their contracted information service providers. A poor network architecture resulting from insufficient investment in cybersecurity solutions makes them vulnerable to cyber attacks, it stated. The hackers targeted loopholes in the systems of Taiwan government information service providers, and then sneaked into the remote desktop shared by government agencies to steal secrets or personal information. Government agencies have been asked to increase scrutiny of their service providers.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Actors & Campaigns"
        ],
        "refs": [
          "https://unit42.paloaltonetworks.com/bendybear-shellcode-blacktech/",
		  "https://www.taiwannews.com.tw/en/news/3991160"
        ]
      },
      "uuid": "427ecf7c-6bae-11eb-9439-0242ac130002",
      "value": "OSRS Actors AND Campaigns: BlackTech Threat Group"
    },
	{
      "description": "LodaRAT operators and or developers now have a new tool, Loda4Android. This new malware follows the same principles of other Android-based RATs that we have seen on the threat landscape. Along with this new Android variant, an updated version of Loda for Windows has been identified in the same campaign. These new versions for Loda4Windows and Loda4Android show that the development effort is clearly carried out by the same group we are calling Kasablanca.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Actors & Campaigns"
        ],
        "refs": [
          "https://blog.talosintelligence.com/2021/02/kasablanka-lodarat.html"
        ]
      },
      "uuid": "427ed1fc-6bae-11eb-9439-0242ac130002",
      "value": "OSRS Actors AND Campaigns: Kasablanka Group"
    },
	{
      "description": "Ransomware group that targets various types of industries.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Actors & Campaigns"
        ],
        "refs": [
          "https://www.cadosecurity.com/post/punk-kitty-ransom-analysing-hellokitty-ransomware-attacks"
        ]
      },
      "uuid": "cdfe454c-7125-11eb-9439-0242ac130002",
      "value": "OSRS Actors AND Campaigns: HelloKitty Ransome Group"
    },
	{
      "description": "While primarily known for desktop malware, the Confucius group was previously reported to have started leveraging mobile malware in 2017, with the Android surveillanceware ChatSpy. However, research discovery of SunBird and Hornbill shows that Confucius may have been spying on mobile users up to a year before it started using ChatSpy. Targets of these tools include personnel linked to Pakistan’s military, nuclear authorities, and Indian election officials in Kashmir. Hornbill and SunBird have sophisticated capabilities to exfiltrate SMS, encrypted messaging app content, and geolocation, among other types of sensitive information.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Actors & Campaigns"
        ],
        "refs": [
          "https://blog.lookout.com/lookout-discovers-novel-confucius-apt-android-spyware-linked-to-india-pakistan-conflict"
        ]
      },
      "uuid": "cdfe4d4e-7125-11eb-9439-0242ac130002",
      "value": "OSRS Actors AND Campaigns: Confucius APT"
    },
	{
      "description": "Starting in mid-December 2020, malicious actors that Mandiant tracks as UNC2546 exploited multiple zero-day vulnerabilities in Accellion’s legacy File Transfer Appliance (FTA) to install a newly discovered web shell named DEWMODE.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Actors & Campaigns"
        ],
        "refs": [
          "https://www.fireeye.com/blog/threat-research/2021/02/accellion-fta-exploited-for-data-theft-and-extortion.html"
        ]
      },
      "uuid": "4316764a-76d2-11eb-9439-0242ac130002",
      "value": "OSRS Actors AND Campaigns: UNC2546 Threat Group"
    },
	{
      "description": "We are currently tracking the exploitation of the zero-day Accellion FTA vulnerabilities and data theft from companies running the legacy FTA product as UNC2546, and the subsequent extortion activity as UNC2582. We have identified overlaps between UNC2582, UNC2546, and prior FIN11 operations, and we will continue to evaluate the relationships between these clusters of activity.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Actors & Campaigns"
        ],
        "refs": [
          "https://www.fireeye.com/blog/threat-research/2021/02/accellion-fta-exploited-for-data-theft-and-extortion.html"
        ]
      },
      "uuid": "4316794c-76d2-11eb-9439-0242ac130002",
      "value": "OSRS Actors AND Campaigns: UNC2582 Threat Group"
    },
	{
      "description": "The Baby Elephant organization is an APT attack organization from the direction of the South Asian subcontinent.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Actors & Campaigns"
        ],
        "refs": [
          "https://mp.weixin.qq.com/s/y2kRbYCt94yPu-5jtcZ_AA"
        ]
      },
      "uuid": "43167a82-76d2-11eb-9439-0242ac130002",
      "value": "OSRS Actors AND Campaigns: Baby Elephant APT"
    },
	{
      "description": "Unit 42 researchers are exposing one of the largest and longest-lasting Monero cryptojacking operations known to exist. The operation is called WatchDog, taken from the name of a Linux daemon called watchdogd. The WatchDog mining operation has been running since Jan. 27, 2019, and has collected at least 209 Monero (XMR), valued to be around $32,056 USD. Researchers have determined that at least 476 compromised systems, composed primarily of Windows and NIX cloud instances, have been performing mining operations at any one time for over two years.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Actors & Campaigns"
        ],
        "refs": [
          "https://unit42.paloaltonetworks.com/watchdog-cryptojacking/"
        ]
      },
      "uuid": "7e6c9bce-76d3-11eb-9439-0242ac130002",
      "value": "OSRS Actors AND Campaigns: Operation Watchdog"
    },
	{
      "description": "Threat actor group identified by Malwarebytes researchers. Leverages phishing and other common backdoor TTPs.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Actors & Campaigns"
        ],
        "refs": [
          "https://blog.malwarebytes.com/malwarebytes-news/2021/02/lazyscripter-from-empire-to-double-rat/"
        ]
      },
      "uuid": "4f9f69c4-7cf1-11eb-9439-0242ac130002",
      "value": "OSRS Actors AND Campaigns: LazyScripter APT"
    },
	{
      "description": "Threat actor who uses ICEDID infections to deploy MAZE or EGREGOR ransomware.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Actors & Campaigns"
        ],
        "refs": [
          "https://www.fireeye.com/blog/threat-research/2021/02/melting-unc2198-icedid-to-ransomware-operations.html"
        ]
      },
      "uuid": "4f9f6c1c-7cf1-11eb-9439-0242ac130002",
      "value": "OSRS Actors AND Campaigns: UNC2198 APT"
    },
	{
      "description": "UNC2374 began as its own distinct cluster where BEACON, WINDARC, and SYSTEMBC were observed during an incident at a Managed Defense customer. Initial similarities in tooling did not constitute a strong enough link to merge UNC2374 with UNC2198 yet.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Actors & Campaigns"
        ],
        "refs": [
          "https://www.fireeye.com/blog/threat-research/2021/02/melting-unc2198-icedid-to-ransomware-operations.html"
        ]
      },
      "uuid": "4f9f6fa0-7cf1-11eb-9439-0242ac130002",
      "value": "OSRS Actors AND Campaigns: UNC2374 APT"
    },
	{
      "description": "Threat group associated with two other threat groups - UNC2198 and UNC2374.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Actors & Campaigns"
        ],
        "refs": [
          "https://www.fireeye.com/blog/threat-research/2021/02/melting-unc2198-icedid-to-ransomware-operations.html"
        ]
      },
      "uuid": "4f9f707c-7cf1-11eb-9439-0242ac130002",
      "value": "OSRS Actors AND Campaigns: UNC2414 APT"
    },
	{
      "description": "Security researchers at Recorded Future have spotted a suspected Chinese APT actor targeting critical infrastructure operators in India. The list of targets includes power plants, electricity distribution centers, and seaports in the country. The attacks surged while relations between India and China have deteriorated significantly following border clashes in May 2020. Recorded future tracked the APT group as “RedEcho” and pointed out that its operations have a significant overlap with the China-linked APT41/Barium actor.  Experts noticed that at least 3 of the targeted Indian IP addresses were previously hit by APT41 in a November 2020 campaign aimed at Indian Oil and Gas sectors.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Actors & Campaigns"
        ],
        "refs": [
          "https://securityaffairs.co/wordpress/115156/apt/china-apt41-india.html?utm_source=feedly&utm_medium=rss&utm_campaign=china-apt41-india",
		  "https://go.recordedfuture.com/hubfs/reports/cta-2021-0228.pdf"
        ]
      },
      "uuid": "4f9f7144-7cf1-11eb-9439-0242ac130002",
      "value": "OSRS Actors AND Campaigns: RedEcho Threat Group"
    },
	{
      "description": "Microsoft has detected multiple 0-day exploits being used to attack on-premises versions of Microsoft Exchange Server in limited and targeted attacks. In the attacks observed, the threat actor used these vulnerabilities to access on-premises Exchange servers which enabled access to email accounts, and allowed installation of additional malware to facilitate long-term access to victim environments. Microsoft Threat Intelligence Center (MSTIC) attributes this campaign with high confidence to HAFNIUM, a group assessed to be state-sponsored and operating out of China, based on observed victimology, tactics and procedures. The vulnerabilities recently being exploited were CVE-2021-26855, CVE-2021-26857, CVE-2021-26858, and CVE-2021-27065.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Actors & Campaigns"
        ],
        "refs": [
          "https://www.microsoft.com/security/blog/2021/03/02/hafnium-targeting-exchange-servers/"
        ]
      },
      "uuid": "4f9f728e-7cf1-11eb-9439-0242ac130002",
      "value": "OSRS Actors AND Campaigns: HAFNIUM Threat Group"
    },
	{
      "description": "During June-August of 2020, ClearSky’s analysis team had investigated an offensive campaign attributed with high probability to North Korea, which we call Dream Job. This campaign has been active since the beginning of the year and it succeeded, in our assessment, to infect several dozens of companies and organizations in Israel and globally. Its main targets include defense, governmental companies, and specific employees of those companies. We assess this to be this year’s main offensive campaign by the Lazarus group, and it embodies the sum of the group’s accumulative knowledge on infiltration to companies and organizations around the globe. In our estimation, the group operates dozens of researchers and intelligence personnel to maintain the campaign globally.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Actors & Campaigns"
        ],
        "refs": [
          "https://www.clearskysec.com/operation-dream-job/"
        ],
        "synonyms": [
        "Operation Dream Job"
        ]
      },
      "uuid": "ae06d8a2-7cf2-11eb-9439-0242ac130002",
      "value": "OSRS Actors AND Campaigns: Operation DeathNote"
    },
	{
      "description": "While tracking the Lazarus group’s continuous campaigns targeting various industries, researchers discovered that they recently researchersnt after COVID-19-related entities. They attacked a pharmaceutical company at the end of September, and during our investigation researchers discovered that they had also attacked a government ministry related to the COVID-19 response. Each attack used different tactics, techniques and procedures (TTPs), but researchers found connections betresearchersen the two cases and evidence linking those attacks to the notorious Lazarus group.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Actors & Campaigns"
        ],
        "refs": [
          "https://securelist.com/lazarus-covets-covid-19-related-intelligence/99906/",
		  "https://www.welivesecurity.com/2020/11/16/lazarus-supply-chain-attack-south-korea/"
        ]
      },
      "uuid": "ae06daf0-7cf2-11eb-9439-0242ac130002",
      "value": "OSRS Actors AND Campaigns: Operation Bookcode"
    },
	{
      "description": "SPRITE SPIDER is an eCrime actor that conducts low-volume BGH ransomware campaigns using the Defray777 ransomware. Other tools used by SPRITE SPIDER include the Vatet loader and the PyXie remote access tool (RAT). The adversary has established initial access by exploiting vulnerable Citrix Application Delivery Controllers, as well as by using LUNAR SPIDER’s BokBot trojan. To avoid detection, SPRITE SPIDER often stages payloads on internal servers within a victim network and uses in-memory-only deployments of its later-stage tooling. SPRITE SPIDER uses both PyXie and Cobalt Strike to move laterally within a victim environment after obtaining initial access.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Actors & Campaigns"
        ],
        "refs": [
          "https://www.crowdstrike.com/blog/carbon-spider-sprite-spider-target-esxi-servers-with-ransomware/"
        ]
      },
      "uuid": "4ffba4f6-7eb7-11eb-9439-0242ac130002",
      "value": "OSRS Actors AND Campaigns: Sprite Spider Threat Group"
    },
	{
      "description": "Threat actor attributed to the hacking of a technology contractor, SyTech, used by the Russian Federal Security Service (FSB). It was reported that the actor was able to exfiltrate over 7 terabytes of data regarding secret projects being worked on by the company.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Actors & Campaigns"
        ],
        "refs": [
          "https://securityaffairs.co/wordpress/88657/intelligence/fsb-contractor-sytech-hacked.html"
        ],
        "synonyms": [
        "truniger"
        ]
      },
      "uuid": "7d87df84-4132-11ea-b77f-2e728ce88125",
      "value": "OSRS Actors AND Campaigns: 0v1ru$"
    }
	  ],
	"version": 23
}
