{
  "category": "OSRS-BOTNET",
  "description": "Cluster designed for tagging OSINT artifacts that relate to OSRS artifacts that describe malicious botnets.",
  "name": "OSRS Botnet",
  "source": "OSRS DEV",
  "type": "CMCF-BLOCK-OSRS",
  "uuid": "deb05256-49bf-11ea-b77f-2e728ce88125",
  "values": [
	{
      "description": "AESDDoS botnet malware variant detected by Trend Micro as Backdoor.Linux.AESDDOS.J exploiting a server-side template injection vulnerability CVE-2019-3396 in the Widget Connector macro in Atlassian Confluence Server, a collaboration software program used by DevOps professionals.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Botnet"
        ],
        "refs": [
          "https://blog.trendmicro.com/trendlabs-security-intelligence/aesddos-botnet-malware-exploits-cve-2019-3396-to-perform-remote-code-execution-ddos-attacks-and-cryptocurrency-mining/"
        ]
      },
      "uuid": "a8707c14-29be-11ea-978f-2e728ce88125",
      "value": "OSRS Botnet: AESDDoS.J"
    },
	{
      "description": "AveMaria is a new botnet, whose first version we found in September 2018, right after the arrests of the FIN7 members. We have medium confidence that this botnet falls under the FIN7 umbrella. In fact, AveMaria is a classic infostealer bot that collects all possible credentials from various types of software (browsers, email clients, messengers, etc.), and can act as a keylogger.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Botnet"
        ],
        "refs": [
          "https://securelist.com/fin7-5-the-infamous-cybercrime-rig-fin7-continues-its-activities/90703/"
        ]
      },
      "uuid": "77a0c1e8-41e2-11ea-b77f-2e728ce88125",
      "value": "OSRS Botnet: AveMaria"
    },
	{
      "description": "A Bashlite variant that seems to refer to itself as Ayedz. Based on this malware’s file name. Upon execution, Ayedz will send the following information about the infected device back to the host IP address. Ayedz is capable of running several backdoor commands for launching DDoS attacks. Ayedz also features several attack and flood options.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Botnet"
        ],
        "refs": [
          "https://blog.trendmicro.com/trendlabs-security-intelligence/back-to-back-campaigns-neko-mirai-and-bashlite-malware-variants-use-various-exploits-to-target-several-routers-devices/"
        ]
      },
      "uuid": "77a0c4c2-41e2-11ea-b77f-2e728ce88125",
      "value": "OSRS Botnet: Ayedz"
    },
	{
      "description": "Based on Marcher malware family.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Botnet"
        ],
        "refs": [
          "https://www.threatfabric.com/blogs/anubis_2_malware_and_afterlife.html"
        ]
      },
      "uuid": "77a0c88c-41e2-11ea-b77f-2e728ce88125",
      "value": "OSRS Botnet: Bubabot"
    },
	{
      "description": "Bulehero is a worm that uses the compromised computer's resources to mine cryptocurrency. Hosts that have the ThinkPHP vulnerability and are exposed to the Internet are at a high risk of being infected by this worm.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Botnet"
        ],
        "refs": [
          "https://forums.juniper.net/t5/Threat-Research/Anatomy-of-the-Bulehero-Cryptomining-Botnet/ba-p/458787",
		  "https://www.symantec.com/security_response/writeup.jsp?docid=2019-051514-0005-99&om_rssid=sr-mixed30days",
		  "https://www.alibabacloud.com/blog/threat-alert-multiple-cryptocurrency-miner-botnets-start-to-exploit-the-new-thinkphp-vulnerability_594369"
        ]
      },
      "uuid": "77a0c9fe-41e2-11ea-b77f-2e728ce88125",
      "value": "OSRS Botnet: Bulehero"
    },
	{
      "description": "The core of the artifact is the integration of different botnet source codes, as it is also well documented by reading the now deleted Instagram profile of the 13 years old scriptbots/unholdable, who implemented this Botnet . STD attack, Tsunami, Christmas DDoS attacks were adapted from Kaiten botnet, along with more flood combination taken from Qbot/Lizkebab/Torlus/Gafgyt variants: multiple attack methods integrating multiple source code in the same artifact and provided a As-a-Service to other teens or threat actors and sold offhandedly on Instagram. From Mirai source code the Cayosin was taken the table scheme to hide strings used by the botnet to hack the login credential of the vulnerable telnet accounts for known IOT devices, along with other Mirai botnet functionalities. Obviously, the coder was not updating much feature of the C2 which explains how the base protocol of the botnet is still made by Qbot/Torlus basis.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Botnet"
        ],
        "refs": [
          "https://securityaffairs.co/wordpress/80858/cyber-crime/cayosin-botnet-mmd.html",
		  "https://imgur.com/a/4YxuSfV"
        ]
      },
      "uuid": "77a0cb34-41e2-11ea-b77f-2e728ce88125",
      "value": "OSRS Botnet: CAYOSIN"
    },
	{
      "description": "Android banking trojan.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Botnet"
        ],
        "refs": [
          "https://twitter.com/LukasStefanko/status/1102937833071935491"
        ]
      },
      "uuid": "77a0cc6a-41e2-11ea-b77f-2e728ce88125",
      "value": "OSRS Botnet: CometBot"
    },
	{
      "description": "Variant of the Mirai botnet. Most of the exploitation code it includes is for unpatched IoT devices, but enterprise apps Oracle WebLogic and VMware SD-Wan are among the targets, too.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Botnet"
        ],
        "refs": [
          "https://www.itnewsafrica.com/2019/09/echobot-launches-widespread-attack-against-iot-devices/",
		  "https://threatvector.cylance.com/en_us/home/mirai-botnet-spawns-echobot-malware.html",
		  "https://www.bleepingcomputer.com/news/security/echobot-botnet-spreads-via-26-exploits-targets-oracle-vmware-apps/",
		  "https://www.bleepingcomputer.com/news/security/new-echobot-botnet-variant-uses-over-50-exploits-to-propagate/"
        ]
      },
      "uuid": "77a0cd96-41e2-11ea-b77f-2e728ce88125",
      "value": "OSRS Botnet: Echobot"
    },
	{
      "description": "Attacks other coinminer botnets. Utilizes blockchain DNS services. Behaves like Satori botnet. Also used to take over security camera systems.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Botnet"
        ],
        "refs": [
          "https://blog.netlab.360.com/the-new-developments-of-the-fbot-en/",
		  "https://blog.netlab.360.com/threat-alert-a-new-worm-fbot-cleaning-adbminer-is-using-a-blockchain-based-dns-en/"
        ]
      },
      "uuid": "77a0d214-41e2-11ea-b77f-2e728ce88125",
      "value": "OSRS Botnet: FBot"
    },
	{
      "description": "The Geost Android banking botnet was discovered as part of a larger malware analysis operation. During an experiment in which a sample of the HtBot malware was executed, the traffic analysis revealed a very unusual communication pattern that stood out from the rest. HtBot operates by converting its victims into unwilling private illegal Internet proxies. The infected victims relay communications from the HtBot users to the Internet. HtBot is regarded as an underground proxy network that is difficult for security analysts to tap, since its traffic is continually redirected to new victims. The users of the HtBot network pay the HtBot botmasters to provide them with high-speed, semi-private communications for their operations.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Botnet"
        ],
        "refs": [
          "https://blog.avast.com/avast-researcher-helps-expose-banking-botnet-geost",
		  "http://public.avast.com/research/VB2019-Garcia-etal.pdf"
        ]
      },
      "uuid": "77a0d3a4-41e2-11ea-b77f-2e728ce88125",
      "value": "OSRS Botnet: Geost"
    },
	{
      "description": "GoLang Botnet.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Botnet"
        ],
        "refs": [
          "https://blog.yoroi.company/research/gobrut-a-new-golang-botnet/"
        ]
      },
      "uuid": "77a0d4e4-41e2-11ea-b77f-2e728ce88125",
      "value": "OSRS Botnet: GoBrut"
    },
	{
      "description": "RDP, the remote desktop protocol, made the news recently after Microsoft patched a critical remote code execution vulnerability (CVE-2019-0708). While the reporting around this Bluekeep vulnerability focused on patching vulnerable servers, exposing RDP to the Internet has never been a good idea. Botnets have been scanning for these servers and are using weak and reused passwords to gain access to them. The latest example of such a botnet is an ongoing malicious campaign we are refering to as GoldBrute. This botnet is currently brute forcing a list of about 1.5 million RDP servers exposed to the Internet. Shdoan lists about 2.4 million exposed servers. GoldBrute uses its own list and is extending it as it continues to scan and grow. The GoldBrute botnet is controlled by a single command and control server. Bots are exchanging data with it via AES encrypted WebSocket connections to port 8333. An infected system will first be instructed to download the bot code. The download is very large (80 MBytes) and includes the complete Java Runtime. The bot itself is implemented in a Java class called GoldBrute. Initially, the bot will start scanning random IP addresses to find more hosts with exposed RDP servers. These IPs are reported back to the C&C server. After the bot reported 80 new victims, the C&C server will assign a set of targets to brute force to the bot. Each bot will only try one particular username and password per target. This is possibly a strategy to fly under the radar of security tools as each authentication attempt comes from different addresses.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Botnet"
        ],
        "refs": [
          "https://isc.sans.edu/forums/diary/GoldBrute+Botnet+Brute+Forcing+15+Million+RDP+Servers/25002/"
        ]
      },
      "uuid": "ab2ad8be-41e2-11ea-b77f-2e728ce88125",
      "value": "OSRS Botnet: GoldBrute"
    },
	{
      "description": "SecNiche Security Labs discovered a new IOT bot named GUCCI. It seems like the IOT botnet is named after an Italian luxury brand of fashion and leather goods. The botnet operator was found to be very proactive. The whole analysis and obtaining C&C access was like an arms race. It is anticipated the Gucci botnet is still in active phase and targeting European region. However, the attacks triggered by Gucci bot could be broad based or targeted depending on the requirements.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Botnet"
        ],
        "refs": [
          "https://securityaffairs.co/wordpress/91942/malware/gucci-iot-bot.html",
		  "https://adityaksood.com/#blogs"
        ]
      },
      "uuid": "ab2adb66-41e2-11ea-b77f-2e728ce88125",
      "value": "OSRS Botnet: Gucci"
    },
	{
      "description": "The MIPS binary is a bot that is having a mission to infect the host it was dropped into. So, it needs a dropping scheme to go to the infected host beforehand, making a malicious process called cloudprocess, send message of airdopping clouds through the standard output that can be piped later on. It is recording its PID and fork its process for the further step. The message of airdropping clouds is the this botnet is called AirDropBot; eventhough the coder prefer to use Cloudbot, which there is also a legitimate good software that uses that name too as their brand. Upon successful forking it will extract the what the coder so-called encrypted array, it's ala Mirai table crypted keywords in its concept, but it is different in implementation. It could be originally coded to avoid XOR operation which is the worst Mirai bug, but this encrypt_array is just ending up to an encoded obfuscation function. The value from this decrypted coded is used for further malware process. Then the malware tries to connect to the C2 which its IP address is hard-coded in the binary, on a success connection attempt to C2 server, it will parse the commands sent by the C2 to perform three weaponized functions on the binary to perform TCP, and UDP DDoS attack with either using the specific hex-coded payload, or the latter on is using a custom pattern so-called hex-attack that sends DoS packet in a hex escape strings format to the targeted host.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Botnet"
        ],
        "refs": [
          "https://blog.malwaremustdie.org/2019/09/mmd-0064-2019-linuxairdropbot.html"
        ]
      },
      "uuid": "ab2adcc4-41e2-11ea-b77f-2e728ce88125",
      "value": "OSRS Botnet: Linux AirDropBot"
    },
	{
      "description": "Botnet that is delivered via malicious attachments that redirect to URL shorteners. It also uses sites like Pastebin to retrive additional commands.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Botnet"
        ],
        "refs": [
          "https://blog.prevailion.com/2019/10/mastermana-botnet.html"
        ]
      },
      "uuid": "ab2addfa-41e2-11ea-b77f-2e728ce88125",
      "value": "OSRS Botnet: MasterMana"
    },
	{
      "description": "A variant of the Mirai botnet. It uses protocols for encrypted commands while scanning for other vulnerable hosts on the network. One similarity it does share with other Mirai variants is that XOR was used to encrypt a part of its configuration data and the list of telnet/SSH credentials used for the malware’s brute-force capabilities.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Botnet"
        ],
        "refs": [
          "https://blog.trendmicro.com/trendlabs-security-intelligence/new-miori-variant-uses-unique-protocol-to-communicate-with-cc/?"
        ]
      },
      "uuid": "ab2adf26-41e2-11ea-b77f-2e728ce88125",
      "value": "OSRS Botnet: Miori"
    },
	{
      "description": "The Neko botnet is capable of executing several backdoor commands. It can execute shell commands as well as launch user datagram protocol or UDP and UPD-HEX flood attacks, inundating a router’s ability to properly process and respond to information. It is also capable of killing processes. Neko holds within it an extensive kill list of other malware-related processes that it will terminate. Further examination of the Neko botnet code shows that it comes with scanners that are capable of looking for multiple exploits that would allow the malware to propagate itself to other vulnerable devices.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Botnet"
        ],
        "refs": [
          "https://blog.trendmicro.com/trendlabs-security-intelligence/back-to-back-campaigns-neko-mirai-and-bashlite-malware-variants-use-various-exploits-to-target-several-routers-devices/"
        ]
      },
      "uuid": "ab2ae2dc-41e2-11ea-b77f-2e728ce88125",
      "value": "OSRS Botnet: Neko"
    },
	{
      "description": "Based on Marcher malware family.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Botnet"
        ],
        "refs": [
          "https://www.threatfabric.com/blogs/anubis_2_malware_and_afterlife.html"
        ]
      },
      "uuid": "ab2ae426-41e2-11ea-b77f-2e728ce88125",
      "value": "OSRS Botnet: Neobot"
    },
	{
      "description": "The bot first emerged in November 2018. According to Trend Micro, the malware is the work of the Outlaw group, a rough translation derived from haiduc, a Romanian phrase which has been bequeathed to the main hacking tool the group uses.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Botnet"
        ],
        "refs": [
          "https://www.zdnet.com/article/outlaws-shellbot-infects-servers-for-monero-mining/"
        ]
      },
      "uuid": "ab2ae552-41e2-11ea-b77f-2e728ce88125",
      "value": "OSRS Botnet: Outlaw Shellbot"
    },
	{
      "description": "The Downloader and Bot modules of the Roboto Botnet, have both a vulnerability scanning module and a P2P control module. The botnet mainly supports 7 functions - reverse shell, self-uninstall, gather process' network information, gather Bot information, execute system commands, run encrypted files specified in URLs, DDoS attack, etc. However, DDoS is not its main goal. At the same time, it also uses Curve25519, Ed25519, TEA, SHA256, HMAC-SHA256 and other algorithms to ensure the integrity and security of its components and P2P network, create the corresponding Linux self-starting script based on the target system, and disguise its own files and processes name to gain persistence control. Propigation is via the Webmin RCE vulnerability CVE-2019-15107. The main function of Roboto Downloader is to download the corresponding encrypted Roboto Bot program from the specified URL according to the CPU architecture of the victim machine, and then decrypt and execute it.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Botnet"
        ],
        "refs": [
          "https://blog.netlab.360.com/the-awaiting-roboto-botnet-en/"
        ]
      },
      "uuid": "ab2ae674-41e2-11ea-b77f-2e728ce88125",
      "value": "OSRS Botnet: Roboto Botnet"
    },
	{
      "description": "The Joker, a new Trojan on GooglePlay. 24 apps with over 472,000+ installs in total. The malware — going by the name the Joker (which was borrowed from one of the C&C domain names) — delivers a second stage component, which silently simulates the interaction with advertisement websites, steals the victim’s SMS messages, the contact list and device info. The automated interaction with the advertisement websites includes simulation of clicks and entering of the authorization codes for premium service subscriptions. This strategy works by automating the necessary interaction with the premium offer webpage, entering the operator offer code, then waiting for a SMS message with a confirmation code and extracting it using regular expressions. Finally, the Joker submits the extracted code to the offer webpage, in order to authorize the premium subscription. The Joker malware only attacks targeted countries. Most of the infected apps contain a list of Mobile Country Codes (MCC) and the victim has to be using a SIM card from one of these countries in order to receive the second stage payload. The majority of the discovered apps target the EU and Asian countries, however, some apps allow for any country to join. Furthermore, most of the discovered apps have an additional check, which will make sure that the payload will not execute when running within the US or Canada. The UI of C&C panel and some of the bot code comments are written in Chinese, which could be a hint in terms of geographical attribution.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Botnet"
        ],
        "refs": [
          "https://medium.com/csis-techblog/analysis-of-joker-a-spy-premium-subscription-bot-on-googleplay-9ad24f044451"
        ]
      },
      "uuid": "ab2ae796-41e2-11ea-b77f-2e728ce88125",
      "value": "OSRS Botnet: The Joker"
    },
	{
      "description": "This spambot is interesting because it can steal passwords, spy on its victims’ screen using FFmpeg when they watch pornographic content online, and communication to the C&C server is done through Tor, while spam is sent as regular internet traffic. This article describes the functionality of the malware.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Botnet"
        ],
        "refs": [
          "https://www.welivesecurity.com/2019/08/08/varenyky-spambot-campaigns-france/"
        ]
      },
      "uuid": "ccaaa2f6-41e4-11ea-b77f-2e728ce88125",
      "value": "OSRS Botnet: Varenyky"
    },
	{
      "description": "A cryptocurrency-mining bonet in operation since late 2018. Capable of leveraging the BlueKeep RDP exploit.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Botnet"
        ],
        "refs": [
          "https://www.intezer.com/blog-watching-the-watchbog-new-bluekeep-scanner-and-linux-exploits/"
        ]
      },
      "uuid": "ccaaa8c8-41e4-11ea-b77f-2e728ce88125",
      "value": "OSRS Botnet: WatchBog"
    },
	{
      "description": "Yowai detected by Trend Micro as BACKDOOR.LINUX.YOWAI.A has a configuration table thatâ€™s similar to those of other Mirai variants. Its configuration table can be decrypted with the same procedures, and adds the ThinkPHP exploit with other known vulnerabilities in its list of infection entry vectors. Yowai listens on port 6 to receive commands from the command and control server. After it infects a router, it uses dictionary attack in an attempt to infect other devices. The affected router now becomes part of a botnet that enables its operator to use the affected devices for launching DDoS attacks.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Botnet"
        ],
        "refs": [
          "https://blog.trendmicro.com/trendlabs-security-intelligence/thinkphp-vulnerability-abused-by-botnets-hakai-and-yowai/3/"
        ]
      },
      "uuid": "ccaaaa3a-41e4-11ea-b77f-2e728ce88125",
      "value": "OSRS Botnet: Yowai"
    },
	{
      "description": "PBot is a versatile IRC bot written in Perl using Net::IRC.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Botnet"
        ],
        "refs": [
          "https://sourceforge.net/p/pbot2/wiki/Home/"
        ]
      },
      "uuid": "ccaaab70-41e4-11ea-b77f-2e728ce88125",
      "value": "OSRS Botnet: pBot"
    },
	{
      "description": "Mirai variant. Mukashi brute forces the logins using different combinations of default credentials, while informing its command and control (C2) server of the successful login attempts. Multiple, if not all, Zyxel NAS products running firmware versions up to 5.21 are vulnerable to this pre-authentication command injection vulnerability.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Botnet"
        ],
        "refs": [
          "https://unit42.paloaltonetworks.com/new-mirai-variant-mukashi/"
        ]
      },
      "uuid": "d2e3038c-6d1a-11ea-bc55-0242ac130003",
      "value": "OSRS Botnet: Mukashi Botnet"
    },
	{
      "description": "At present, the moobot uses the mirai scanning mechanism to scan the entire internet, the scan result is reported to the Loader, and then the loader implants sample to the victims.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Botnet"
        ],
        "refs": [
          "https://blog.netlab.360.com/the-botnet-cluster-on-185-244-25-0-24-en/",
		  "https://blog.netlab.360.com/multiple-botnets-are-spreading-using-lilin-dvr-0-day-en/"
        ]
      },
      "uuid": "d2e305a8-6d1a-11ea-bc55-0242ac130003",
      "value": "OSRS Botnet: Moobot Botnet"
    },
	{
      "description": "The malware is built on the Gafgyt/Bashlite malware family codebase, dubbed Hoaxcalls, based on the name of the IRC channel used for command and control (C2) communications, and is capable of launching a variety of DDoS attacks based on the C2 commands received. In addition to its advanced DDoS capabilities, Hoaxcalls is also capable of propagation by exploiting critical vulnerabilities.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Botnet"
        ],
        "refs": [
          "https://unit42.paloaltonetworks.com/new-hoaxcalls-ddos-botnet/"
        ]
      },
      "uuid": "4ff29116-7825-11ea-bc55-0242ac130003",
      "value": "OSRS Botnet: Hoaxcalls DDoS Botnet"
    },
	{
      "description": "P2P botnet that is primarily used to mine for XMR.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Botnet"
        ],
        "refs": [
          "https://blog.netlab.360.com/ddg-upgrade-to-new-p2p-hybrid-model/"
        ]
      },
      "uuid": "fd68262a-79ac-11ea-bc55-0242ac130003",
      "value": "OSRS Botnet: DDG Mining Botnet"
    },
	{
      "description": "Additional miner payload that is associatied with the DDG Mining Botnet.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Botnet"
        ],
        "refs": [
          "https://blog.netlab.360.com/ddg-upgrade-to-new-p2p-hybrid-model/"
        ]
      },
      "uuid": "fd68283c-79ac-11ea-bc55-0242ac130003",
      "value": "OSRS Botnet: systemdMiner"
    },
	{
      "description": "DDoS botnet. DDoS disguised as browser-generated traffic. Telnet scanners. Uses socks5 proxies. Telnet credential stuffing. Compiled for at least 12 different CPU architectures.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Botnet"
        ],
        "refs": [
          "https://www.bitdefender.com/files/News/CaseStudies/study/319/Bitdefender-PR-Whitepaper-DarkNexus-creat4349-en-EN-interactive.pdf"
        ]
      },
      "uuid": "fd682940-79ac-11ea-bc55-0242ac130003",
      "value": "OSRS Botnet: dark_nexus IoT Botnet"
    },
	{
      "description": "Mozi is evolved from the source code of several known malware families – Gafgyt, Mirai and IoT Reaper – that have been brought together to form a peer-to-peer (P2P) botnet capable of DDoS attacks, data exfiltration and command or payload execution. The malware targets IoT devices, predominantly routers and DVRs that are either unpatched or have weak telnet passwords.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Botnet"
        ],
        "refs": [
          "https://blog.centurylink.com/new-mozi-malware-family-quietly-amasses-iot-bots/"
        ]
      },
      "uuid": "f1b29fd4-83c7-11ea-bc55-0242ac130003",
      "value": "OSRS Botnet: Mozi Botnet"
    },
	{
      "description": "ESET researchers recently discovered a previously undocumented botnet that we have named VictoryGate. It has been active since at least May 2019 and, since then, three different variants of the initial module have been identified, in addition to approximately 10 secondary payloads that are downloaded from file hosting websites. The initial module is detected by ESET security products as MSIL/VictoryGate. This botnet is composed mainly of devices in Latin America, specifically Peru, where over 90% of the compromised devices are located. We’ve been actively sinkholing several command and control (C&C) domains, allowing us to monitor this botnet’s activity. The combination of the sinkhole data and our telemetry data allows us to estimate the botnet’s size to be at least 35,000 devices. To control its botnet, VictoryGate used only subdomains registered at the dynamic DNS provider No-IP. ESET reported the malicious subdomains to No-IP, who swiftly took them all down, effectively removing control of the bots from the attacker. Also, ESET is collaborating with non-profit Shadowserver Foundation by sharing sinkhole logs in an effort to further remediate this threat.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Botnet"
        ],
        "refs": [
          "https://www.welivesecurity.com/2020/04/23/eset-discovery-monero-mining-botnet-disrupted/"
        ]
      },
      "uuid": "1c65ee74-8aea-11ea-bc55-0242ac130003",
      "value": "OSRS Botnet: VictoryGate Botnet"
    },
	{
      "description": "On March 26, 2020, researchers captured a suspicious sample. Although the samples have the word mirai in their names and most antivirus engines identified it as Mirai, its network traffic is totally new,which had got our attention. The sample borrowed some of Mirai’s Reporter and Loader mechanism, but the encryption method and Bot program, as well as C2 communication protocol had been totally redesigned. For regular Mirai and their variations, normally the changes are fairly minor, changing C2s or encryption keys, or integrate some new vulnerabilities, nothing dramatic. But this one is different. Its encryption method is unique, and communication protocol is more rigorous. Also it is very likely a new branch from the Moobot group and is in active development. The researchers decide to name it LeetHozer because of theH0z3r string contained with a network request by the botnet.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Botnet"
        ],
        "refs": [
          "https://blog.netlab.360.com/the-leethozer-botnet-en/"
        ]
      },
      "uuid": "40ce8684-8fb0-11ea-bc55-0242ac130003",
      "value": "OSRS Botnet: LeetHozer Botnet"
    },
	{
      "description": "Lucy is a Malware-as-a-Service (MaaS) botnet and dropper for Android devices.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Botnet"
        ],
        "refs": [
          "https://research.checkpoint.com/2020/lucys-back-ransomware-goes-mobile/"
        ],
        "synonyms": [
        "Black Rose Lucy"
        ]
      },
      "uuid": "40ce888c-8fb0-11ea-bc55-0242ac130003",
      "value": "OSRS Botnet: Lucy MaaS Botnet"
    },
	{
      "description": "Kaiji spreads exclusively via SSH brute forcing by targeting the root user only. Accessing root is important to its operation since some DDoS attacks are only available via crafting custom network packets. In Linux, custom network packets are only given to a privileged user such as root. Once a SSH connection is established, a bash script is executed which sets up the environment for the malware. Kaiji has simple features. It consists of an arsenal of multiple DDoS attacks such as ipspoof and synack attacks, an ssh bruteforcer module to continue the spread, and another ssh spreader which relies on hijacking local SSH keys to infect known hosts which the server has connected to in the past.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Botnet"
        ],
        "refs": [
          "https://intezer.com/blog/research/kaiji-new-chinese-linux-malware-turning-to-golang/"
        ]
      },
      "uuid": "40ce8990-8fb0-11ea-bc55-0242ac130003",
      "value": "OSRS Botnet: Kaiji Botnet"
    },
	{
      "description": "This malicious installer consisted of a file named pyclient.cmd, which contains malicious commands. The cmd_shell.exe file is a self-extracting archive (SFX) containing new_script.txt, which contains the C&C server, madleets.ddns.net and shell.bat to gain persistence, and a copy of the zoom.exe installer in the v5.0.1 version. The botnet_start.vbs file runs pyclient.cmd, while the dropped component boot-startup.vbs runs to gain persistence. The repurposed installer will drop the tampered app installer, the malicious archive and codes, and the commands for persistence and communication.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Botnet"
        ],
        "refs": [
          "https://blog.trendmicro.com/trendlabs-security-intelligence/backdoor-devil-shadow-botnet-hidden-in-fake-zoom-installers/"
        ]
      },
      "uuid": "2609d01c-a03e-11ea-bb37-0242ac130002",
      "value": "OSRS Botnet: Devil Shadow Botnet"
    },
	{
      "description": "Botnet used by the MyKings Group threat actor. Targets MySQL servers.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Botnet"
        ],
        "refs": [
          "https://news.sophos.com/en-us/2020/07/02/mykings-jumps-on-the-corona-train/"
        ]
      },
      "uuid": "0cb5891c-c1e5-11ea-b3de-0242ac130004",
      "value": "OSRS Botnet: Mykings Botnet "
    },
	{
      "description": "On June 17, 2020, 360Netlab Threat Detecting System flagged an interesting ELF sample (dd7c9d99d8f7b9975c29c803abdf1c33), further analysis shows that this is a DDos Bot program that propagates through the CVE-2020-8515 vulnerability which targets the DrayTek Vigor router device, and it uses DGA (Domain generation algorithm) to generate C2 domain names. The program uses viktor as file name (/tmp/viktor) in the propagation process, also a special string 0xB16B00B5(big boobs) was used in the sample , we combined the two and named it Bigviktor. From the network’s perspective, Bigviktor’s DGA generates 1000 domain names every month, and traverses the 1000 domain names by requesting RC4 encryption & ECSDA256 signed s.jpeg , When a live C2 responses the request, bot then takes the next step to request for image.jpeg from C2 to get more instructions.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Botnet"
        ],
        "refs": [
          "https://blog.netlab.360.com/bigviktor-dga-botnet/"
        ]
      },
      "uuid": "33ca31c8-cce0-11ea-87d0-0242ac130003",
      "value": "OSRS Botnet: Bigviktor Botnet"
    },
	{
      "description": "The actor employs various methods to spread across the network, like SMB with stolen credentials, psexec, WMI and SMB exploits. The adversary also uses several crafted tools that helps the botnet increase the amount of systems participating in its Monero-mining pool. The infection starts with the main botnet file which is copied from other infected systems by means of SMB, using passwords retrieved by a modified Mimikatz module and exploits such as Eternal Blue. The actor is also aware of the latest SMB vulnerabilities such as SMBGhost, but no evidence of using this exploit has been found. The botnet has more than 15 executable modules that all get downloaded and driven by the main module, which constantly communicates with the command and control (C2) server over HTTP. However, the encrypted data is sent using RC4 encryption, and the module shares the key with the C2 using asymmetric encryption. Apart from a large focus on spreading across the environment, Prometei also tries to recover administrator passwords. The discovered passwords are sent to the C2 and then reused by other modules that attempt to verify the validity of the passwords on other systems using SMB and RDP protocols.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Botnet"
        ],
        "refs": [
          "https://blog.talosintelligence.com/2020/07/prometei-botnet-and-its-quest-for-monero.html?utm_source=feedburner&utm_medium=feed&utm_campaign=Feed%3A+feedburner%2FTalos+%28Talos%E2%84%A2+Blog%29"
        ]
      },
      "uuid": "059a7f32-d330-11ea-87d0-0242ac130003",
      "value": "OSRS Botnet: Prometei Botnet"
    },
	{
      "description": "Doki uses a previously undocumented method to contact its operator by abusing the Dogecoin cryptocurrency blockchain in a unique way in order to dynamically generate its C2 domain address. The malware has managed to stay under the radar for over six months despite samples being publicly available in VirusTotal.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Botnet"
        ],
        "refs": [
          "https://www.intezer.com/container-security/watch-your-containers-doki-infecting-docker-servers-in-the-cloud/"
        ]
      },
      "uuid": "d74a0cf2-d7e3-11ea-87d0-0242ac130003",
      "value": "OSRS Botnet: Doki Botnet"
    },
	{
      "description": "This botnet hides its C2s(Downloader and Reporter server) by using the ngrok reverse proxy service to periodically generate large number of random subdomain names. Botnet master does not have control over what the subdomains will be, as the subdomains are generated randomly by ngrok service, which in this case is actually a bless for the botnet. Because there is no good way for the security defender to tell which ones are good and which ones are bad by just looking at the dns names. All have same pattern and all are mixed in the big naming pool.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Botnet"
        ],
        "refs": [
          "https://www.intezer.com/container-security/watch-your-containers-doki-infecting-docker-servers-in-the-cloud/",
		  "https://blog.netlab.360.com/a-new-mining-botnet-blends-its-c2s-into-ngrok-service/"
        ]
      },
      "uuid": "d74a0f4a-d7e3-11ea-87d0-0242ac130003",
      "value": "OSRS Botnet: Ngrok Mining Botnet"
    },
	{
      "description": "Tencent Security has named this new malware gang MrbMiner, after one of the domains used by the group to host their malware. The Chinese company says the botnet has exclusively spread by scanning the internet for MSSQL servers and then performing brute-force attacks by repeatedly trying the admin account with various weak passwords. Once the attackers gained a foothold on a system, they downloaded an initial assm.exe file, which they used to establish a (re)boot persistence mechanism and to add a backdoor account for future access. The last step of the infection process was to connect to the command and control server and download an app that mines the Monero (XMR) cryptocurrency by abusing local server resources and generating XMR coins into accounts controlled by the attackers.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Botnet"
        ],
        "refs": [
          "https://s.tencent.com/research/report/1105.html",
		  "https://www.zdnet.com/article/new-mrbminer-malware-has-infected-thousands-of-mssql-databases/"
        ]
      },
      "uuid": "ecfb1640-fd9f-11ea-adc1-0242ac120002",
      "value": "OSRS Botnet: MrbMiner Botnet"
    },
	{
      "description": "Researchers encountered an attack that drops both a malicious cryptocurrency miner and a distributed denial-of-service (DDoS) bot on a Docker container built using Alpine Linux as its base image. A similar attack was also reported by Trend Micro in May; in that previous attack, threat actors created a malicious Alpine Linux container to also host a malicious cryptocurrency miner and a DDoS bot.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Botnet"
        ],
        "refs": [
          "https://www.trendmicro.com/en_us/research/20/i/exposed-docker-server-abused-to-drop-cryptominer-ddos-bot-.html"
        ]
      },
      "uuid": "ecfb1848-fd9f-11ea-adc1-0242ac120002",
      "value": "OSRS Botnet: H2Miner Botnet"
    },
	{
      "description": "Spreader botnet for the distribution of miners.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Botnet"
        ],
        "refs": [
          "https://research.checkpoint.com/2020/rudeminer-blacksquid-and-lucifer-walk-into-a-bar/"
        ]
      },
      "uuid": "ecfb1938-fd9f-11ea-adc1-0242ac120002",
      "value": "OSRS Botnet: Rudeminer Botnet"
    },
	{
      "description": "Specter is a remote control Trojan (RAT) for the Linux platform. It consists of 3 parts, Dropper, Loader, and Plugin. The main function is determined by Loader&Plugin. The main functions of Specter are file management, download and upload management, shell service, Socket5 proxy, report device information, execute the script issued by C2, and executing C2 to deliver executable files.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Botnet"
        ],
        "refs": [
          "https://blog.netlab.360.com/ghost-in-action-the-specter-botnet/"
        ]
      },
      "uuid": "2dd62f36-031f-11eb-adc1-0242ac120002",
      "value": "OSRS Botnet: Specter Botnet"
    },
	{
      "description": "In May 2019, researchers from Anomali discovered a new Golang malware targeting Windows, which they dubbed IPStorm (InterPlanetary Storm). IPStorm is a botnet that abuses a legitimate Peer-to-peer (p2p) network called InterPlanetary File System (IPFS) as a means to obscure malicious traffic. It was found the malware eventually allowed attackers to execute arbitrary PowerShell commands on the victim’s Windows machine. Our research team recently identified new Linux variants of IPStorm targeting various Linux architectures (ARM, AMD64, Intel 80386) and platforms (servers, Android, IoT). We have also detected a macOS variant. The macOS variant and most of the Linux samples are fully undetected in VirusTotal at the time of this publication. IPStorm is written in Golang, which enabled Intezer Analyze to detect cross-platform code connections between the Linux samples and the Windows malware first reported by Anomali. The Linux variant has additional features over the documented Windows version, such as using SSH brute-force as a means to spread to additional victims and fraudulent network activity abusing Steam gaming and advertising platforms. The Linux variant has adjusted some features in order to account for the fundamental differences that exist between this operating system and Windows.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Botnet"
        ],
        "refs": [
          "https://www.intezer.com/blog/research/a-storm-is-brewing-ipstorm-now-has-linux-malware/",
		  "https://blog.barracuda.com/2020/10/01/threat-spotlight-new-interplanetary-storm-variant-iot/"
        ],
        "synonyms": [
        "InterPlanetary Storm Botnet"
        ]
      },
      "uuid": "3345b3da-089a-11eb-adc1-0242ac120002",
      "value": "OSRS Botnet: IPStorm Botnet"
    },
	{
      "description": "Recently, 360Netlab threat detection system captured a batch of unknown samples. The CPU architectures supported by this batch of samples are broad, including x86(32/64), ARM(32/64), MIPS(MIPS32/MIPS-III) and PPC, it is spreading through brute force of the Telnet service on ports 23/2323, which means the bot does not really care of what the end devices are, as long as it can enter the device, it will try its luck to infect the target. The botnet is written in Go language, and uses proprietary P2P protocol, we named it HEH Botnet.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Botnet"
        ],
        "refs": [
          "https://blog.netlab.360.com/heh-an-iot-p2p-botnet/"
        ]
      },
      "uuid": "85cd72bc-0e14-11eb-adc1-0242ac120002",
      "value": "OSRS Botnet: HEH Botnet"
    },
	{
      "description": "Named KashmirBlack, the botnet started operating in November 2019. Security researchers from Imperva —who analyzed the botnet last week in a two-part series— said the botnet's primary purpose appears to be to infect websites and then use their servers for cryptocurrency mining, redirecting a site's legitimate traffic to spam pages, and to a lesser degree, showing web defacements. Imperva said the botnet started out small, but after months of constant growth, it has evolved into a sophisticated behemoth capable of attacking thousands of sites per day. The biggest changes occurred in May this year when the botnet increased both its command-and-control (C&C) infrastructure, but also its exploit arsenal. Nowadays, KashmirBlack is managed by one C&C (Command and Control) server and uses more than 60 – mostly innocent surrogate – servers as part of its infrastructure, Imperva said. The botnet handles hundreds of bots, each communicating with the C&C to receive new targets, perform brute force attacks, install backdoors, and expand the size of the botnet.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Botnet"
        ],
        "refs": [
          "https://www.zdnet.com/article/kashmirblack-botnet-behind-attacks-on-cmss-like-wordpress-joomla-drupal-others/",
		  "https://www.imperva.com/blog/crimeops-of-the-kashmirblack-botnet-part-i/",
		  "https://www.imperva.com/blog/crimeops-of-the-kashmirblack-botnet-part-ii/",
		  "https://www.imperva.com/blog/wp-content/uploads/sites/9/2020/10/CrimeOps-of-the-KashmirBlack-Botnet-Appendix.pdf"
        ]
      },
      "uuid": "ce04c19a-1925-11eb-adc1-0242ac120002",
      "value": "OSRS Botnet: KashmirBlack Botnet"
    },
	{
      "description": "Cisco Talos recently discovered a cryptocurrency-mining botnet attack we're calling Xanthe, which attempted to compromise one of Cisco's security honeypots for tracking Docker-related threats. These threats demonstrate several techniques of the MITRE ATT&CK framework, most notably Disabling Security Tools - T1089, External Remote Services - T1133, Exploit Public-Facing Application - T1190, Resource Hijacking - T1496, Scheduled Task - T1053, Bash History - T1139, SSH Hijacking - T1184 and Rootkit - T1014.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Botnet"
        ],
        "refs": [
          "https://blog.talosintelligence.com/2020/12/xanthe-docker-aware-miner.html?utm_source=feedburner&utm_medium=feed&utm_campaign=Feed%3A+feedburner%2FTalos+%28Talos%E2%84%A2+Blog%29"
        ]
      },
      "uuid": "46c04454-3962-11eb-adc1-0242ac120002",
      "value": "OSRS Botnet: Xanthe Botnet"
    },
	{
      "description": "Juniper Threat Labs is seeing active attacks on Oracle WebLogic software using CVE-2020-14882. This vulnerability, if successfully exploited, allows unauthenticated remote code execution. As of this writing, we found 3,109 open Oracle WebLogic servers using Shodan. We are seeing at least five different variants of attacks/payload. For the purpose of this blog, we will focus on one particular payload that installs a bot called DarkIRC. This bot performs a unique command and control domain generation algorithm that relies on the sent value of a particular crypto wallet. This bot is currently being sold on hack forums for $75USD.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Botnet"
        ],
        "refs": [
          "https://blogs.juniper.net/en-us/threat-research/darkirc-bot-exploits-oracle-weblogic-vulnerability"
        ]
      },
      "uuid": "46c0468e-3962-11eb-adc1-0242ac120002",
      "value": "OSRS Botnet: DarkIRC Botnet"
    },
	{
      "description": "A novel Linux-based cryptocurrency mining botnet that exploits a disputed PostgreSQL remote code execution (RCE) vulnerability that compromises database servers for cryptojacking. Targets vulnerability CVE-2019-9193.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Botnet"
        ],
        "refs": [
          "https://unit42.paloaltonetworks.com/pgminer-postgresql-cryptocurrency-mining-botnet/"
        ]
      },
      "uuid": "54edea28-3e11-11eb-b378-0242ac130002",
      "value": "OSRS Botnet: PGMiner Cryptocurrency Mining Botnet"
    },
	{
      "description": "FreakOut is an attack campaign that utilizes three vulnerabilities, including some newly released, to compromise different servers. The threat actor behind the attack, named Freak, managed to infect many devices in a short period of time, and incorporated them into a botnet, which in turn is used for DDoS attacks and crypto-mining.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Botnet"
        ],
        "refs": [
          "https://research.checkpoint.com/2021/freakout-leveraging-newest-vulnerabilities-for-creating-a-botnet/"
        ]
      },
      "uuid": "c606f30a-5b33-11eb-ae93-0242ac130002",
      "value": "OSRS Botnet: FreakOut Botnet"
    },
	{
      "description": "Necro is a classic family of botnet written in Python that was first discovered in 2015, at the beginning, it targeted Windows systems and often tagged by security vendors as Python.IRCBot and called N3Cr0m0rPh (Necromorph) by the author himself.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Botnet"
        ],
        "refs": [
          "https://blog.netlab.360.com/necro/"
        ],
        "synonyms": [
        "Necromorph"
        ]
      },
      "uuid": "747489ec-60c1-11eb-ae93-0242ac130002",
      "value": "OSRS Botnet: N3Cr0m0rPh Botnet"
    },
	{
      "description": "The malware is a variant of SystemdMiner, which consists of a series of Executable and Linkable Format (ELF) binaries and Unix shell scripts. Some components of the botnet have been analyzed in the past with the malware dating back to early 2019. Many of the DreamBus modules are poorly detected by security products. This is in part because Linux-based malware is less common than Windows-based malware, and thus receives less scrutiny from the security community. However, many critical business systems run on Linux systems, and malware that is able to gain access to these systems can cause significant disruption and irreparable harm to organizations that fail to secure their servers properly. The DreamBus malware exhibits worm-like behavior that is highly effective in spreading due its multifaceted approach to propagating itself across the internet and laterally through an internal network using a variety of methods. These techniques include numerous modules that exploit implicit trust, weak passwords, and unauthenticated remote code execution (RCE) vulnerabilities in popular applications, including Secure Shell (SSH), IT administration tools, a variety of cloud-based applications, and databases. These particular applications are targeted because they often run on systems that have powerful underlying hardware with significant amounts of memory and powerful CPUs—all of which allow threat actors to maximize their ability to monetize these resources through mining cryptocurrency. While the primary DreamBus malware payload is an open source Monero cryptocurrency miner known as XMRig, the threat actor can potentially pivot in the future to carrying out more destructive activities, such as ransomware or stealing an organization’s data and holding it hostage.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Botnet"
        ],
        "refs": [
          "https://www.zscaler.com/blogs/security-research/dreambus-botnet-technical-analysis"
        ]
      },
      "uuid": "74748c58-60c1-11eb-ae93-0242ac130002",
      "value": "OSRS Botnet: DreamBus Botnet"
    },
	{
      "description": "As early as 2015, the Groundhog DDOS botnet began proliferating via SSH brute force attacks. The botnet is believed to have a China nexus and has been active since its inception. In early December 2020, Lacework started monitoring recent activity along with botnet traffic from a sinkhole operation. Our analysis revealed the botnet is rapidly expanding by hundreds of new infections daily and has to date infected at least 26K servers. The majority of infections were found within Brazil, US, and India and include clusters of cloud infrastructure from major providers such as Amazon, GCP and Azure. The Groundhog botnet is composed of two closely related malware variants - XOR.DDOS & Groundhog. This blog summarizes the XOR.DDOS malware component and provides details on the botnet and infrastructure.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Botnet"
        ],
        "refs": [
          "https://www.lacework.com/groundhog-botnet-rapidly-infecting-cloud/"
        ]
      },
      "uuid": "fba00418-6626-11eb-ae93-0242ac130002",
      "value": "OSRS Botnet: Groundhog Botnet"
    },
	{
      "description": "On January 25, 2021, 360 netlab BotMon system labeled a suspicious ELF file as Mirai, but the network traffic did not match Mirai's characteristics. This anomaly caught our attention, and after analysis, we determined that it was a new botnet that reused the Mirai framework, propagated through the ADB interface, and targeted Android-like devices with the main purpose of DDoS attacks. It redesigns the encryption algorithm and obtains TOR C2 and the TOR proxys from remote hosts via DNS TXT. The encryption algorithm implemented in this botnet and the process of obtaining C2 are nested in layers, like Russian nesting dolls. For this reason we named it Matryosh. As the analysis progresses, more details emerge. Based on the similarity of C2 instructions, we speculate that it is another attempt by the Moobot group, which is very active at the moment. Matryosh has no integrated scanning, vulnerability exploitation modules, the main function is DDoS attack, it supports tcpraw, icmpecho, and udpplain attacks.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Botnet"
        ],
        "refs": [
          "https://blog.netlab.360.com/matryosh-botnet-is-spreading-en/"
        ]
      },
      "uuid": "fba00666-6626-11eb-ae93-0242ac130002",
      "value": "OSRS Botnet: Matryosh Botnet"
    },
	{
      "description": "The family consists of two core modules - the scanner responsible for scanning and the miner responsible for mining, both of which are written in bash scripts. Because the scanner module uses a file starting with /tmp/rinfo to save the results, the family is named rinfo. It is worth noting that both the scanner and miner modules are implanted separately by the loader, and they have no binding relationship in the code. Based on the samples, researchers infer that the scanner should be the starting module. After the target host is scanned and reported, the attacker can either choose to continue to implant the scanner module or the miner module. In theory, the attacker may also implant other functional modules.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Botnet"
        ],
        "refs": [
          "https://blog.netlab.360.com/rinfojuan-tu-zhong-lai-zheng-zai-feng-kuang-sao-miao-he-wa-kuang/"
        ]
      },
      "uuid": "6777e678-6baf-11eb-9439-0242ac130002",
      "value": "OSRS Botnet: rinfo Botnet"
    },
	{
      "description": "z0Miner is a malicious mining family that started to be active last year, and the industry has publicly analyzed it . When z0Miner was initially active, it used Weblogic's unauthorized command execution vulnerability to spread.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Botnet"
        ],
        "refs": [
          "https://blog.netlab.360.com/fast-analyze-z0miner/"
        ]
      },
      "uuid": "63c0d6a0-826d-11eb-8dcd-0242ac130003",
      "value": "OSRS Botnet: z0Miner Botnet"
    },
	{
      "description": "ZHtrap's propagation uses 4 Nday vulnerabilities, the main function is DDoS and scanning, while integrating some backdoor features. Zhtrap sets up honeypot on the infected device. Zhtrap takes snapshots for the victim devices, and disables the running of new commands based on the snapshot, thus achieving exclusivity over the device. For C2 communication, ZHtrap takes a cue from the Matryosh botnet we previous reported, using Tor and cloud-based configuration.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Botnet"
        ],
        "refs": [
          "https://blog.netlab.360.com/new_threat_zhtrap_botnet_en/"
        ]
      },
      "uuid": "64bf0270-8583-11eb-8dcd-0242ac130003",
      "value": "OSRS Botnet: ZHtrap Botnet"
    },
	{
      "description": "XOR DDoS is a Linux Trojan malware with rootkit capabilities that was used to launch large-scale DDoS attacks. Its name stems from the heavy usage of XOR encryption in both malware and network communication to the C&Cs. It is built for multiple Linux architectures like ARM, x86 and x64. Noteworthy about XOR DDoS is the ability to hide itself with an embedded rootkit component which is obtained by multiple installation steps. It was discovered in September 2014 by MalwareMustDie, a white hat malware research group. From November 2014 it was involved in massive brute force campaign that lasted at least for three months.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Botnet"
        ],
        "refs": [
          "https://www.intezer.com/blog/malware-analysis/new-linux-backdoor-redxor-likely-operated-by-chinese-nation-state-actor/",
		  "https://en.wikipedia.org/wiki/Xor_DDoS"
        ]
      },
      "uuid": "64bf04a0-8583-11eb-8dcd-0242ac130003",
      "value": "OSRS Botnet: XOR.DDOS Botnet"
    },
	{
      "description": "Soon after researchers made Necro public in January , it stopped spreading, but starting on March 2, the BotMon system detected that Necro started spreading again. Honeypot data shows that in addition to the previous TerraMaster RCE (CVE_2020_35665) and Zend RCE (CVE-2021-3007), two neresearchersr vulnerabilities Laravel RCE (CVE-2021-3129) and researchersbLogic RCE researchersre added (CVE-2020-14882). Through sample analysis, we found that the new version of Necro has undergone major changes after a month of silence, and its functions have been further enhanced, as reflected in - Started attacking the Windws system and used Rootkit to hide itself on the Windows platform. The DGA mechanism was updated, and the C2 domain name was generated using the method of subdomain DGA and dynamic domain name. C2 communication supports Tor and adds a new Tor-based DDoS attack method. Can spread Gafgyt_tor for specific Linux targets. It can tamper with the web service page on the victim machine, realize browser mining, steal user data, and turn the browser of the user of the lost website into a bot to fight DDoS attacks, do hash blasting, etc.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Botnet"
        ],
        "refs": [
          "https://blog.netlab.360.com/necro-shi-yong-tor-dong-tai-yu-ming-dga-shuang-sha-windows-linux/"
        ]
      },
      "uuid": "bf1cc936-8b0b-11eb-8dcd-0242ac130003",
      "value": "OSRS Botnet: Necro Botnet"
    },
	{
      "description": "Saint Bot is a downloader that appeared quite recently, and slowly is getting momentum. It was seen dropping stealers (i.e. Taurus Stealer, or a simple AutoIt-based stealer) as well as further loaders (example). Yet its design allows to utilize it for distributing any kind of malware. Although currently it does not appear to be widespread, there is indication that it is being actively developed. Furthermore, Saint Bot employs a wide variety of techniques which, although not novel, indicate some level of sophistication considering its relatively new appearance.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Botnet"
        ],
        "refs": [
          "https://blog.malwarebytes.com/threat-analysis/2021/04/a-deep-dive-into-saint-bot-downloader/"
        ]
      },
      "uuid": "6e444ac0-9c68-11eb-a8b3-0242ac130003",
      "value": "OSRS Botnet: Saint Bot"
    },
	{
      "description": "A novel piece of banking malware for Android OS has surfaced around December 2020, attacking users in Spain.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Botnet"
        ],
        "refs": [
          "https://blog.nviso.eu/2021/04/19/how-to-analyze-mobile-malware-a-cabassous-flubot-case-study/",
		  "https://medium.com/csis-techblog/the-brief-glory-of-cabassous-flubot-a-private-android-banking-botnet-bc2ed7917027"
        ],
        "synonyms": [
        "Cabassous"
        ]
      },
      "uuid": "916f6258-a68d-11eb-bcbc-0242ac130002",
      "value": "OSRS Botnet: FluBot Botnet"
    },
	{
      "description": "A CTV-centric botnet.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Botnet"
        ],
        "refs": [
          "https://www.humansecurity.com/blog/pareto-a-technical-analysis"
        ]
      },
      "uuid": "916f65c8-a68d-11eb-bcbc-0242ac130002",
      "value": "OSRS Botnet: PARETO Botnet"
    },
	{
      "description": "HackBoss is a simple cryptocurrency-stealing malware, but its monetary gain is significant. The most interesting aspect of this malware is the way it is delivered to the victims. HackBoss’ authors own a Telegram channel which they use as the main source for spreading the malware. A Telegram channel is a tool for broadcasting public messages to a large audience. Anyone can subscribe to a specific channel and get a notification on their phone with each new post. Also, only admins of the channel have the right to post and each post shows the name of the channel as a publisher, not a name of a person.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Botnet"
        ],
        "refs": [
          "https://decoded.avast.io/romanalinkeova/hackboss-a-cryptocurrency-stealing-malware-distributed-through-telegram/"
        ]
      },
      "uuid": "916f66c2-a68d-11eb-bcbc-0242ac130002",
      "value": "OSRS Botnet: HackBoss Miner"
    },
	{
      "description": "Simps Botnet binary uses Mirai and Gafgyt modules for DDOS functionality. The Botnet might be in the early stages of development because of the presence of the infected.log file after execution. The author behind this Botnet has a Youtube channel and Discord Server for the usage and demonstration of the Botnet. The Youtube channel and the historical data provided evidence that Simps Botnet is active since April 2021. The Discord server discussions and threat intel data provided us evidence of the possible association of Simps Botnet to Keksec group.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Botnet"
        ],
        "refs": [
          "https://www.uptycs.com/blog/discovery-of-simps-botnet-leads-ties-to-keksec-group"
        ]
      },
      "uuid": "2d59954a-ba42-11eb-8529-0242ac130003",
      "value": "OSRS Botnet: Simps Botnet"
    },
	{
      "description": "A Mirai variant. Typical of Mirai, this variant infects devices with a BusyBox, which is a software suite for devices with limited resources. It first checks for BusyBox presence by executing the bin busybox any string command. If the device’s system responds with any string applet not found, the bot will proceed with its operation. The malware variant’s authors used the any string part to name the malware; in this case, they used Asher.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Botnet"
        ],
        "refs": [
          "https://blog.trendmicro.com/trendlabs-security-intelligence/back-to-back-campaigns-neko-mirai-and-bashlite-malware-variants-use-various-exploits-to-target-several-routers-devices/"
        ]
      },
      "uuid": "2def9a6a-41e2-11ea-b77f-2e728ce88125",
      "value": "OSRS Botnet: AESDDoS.J"
    }
	  ],
	"version": 12
}
