{
  "category": "OSRS-BACKDOORS",
  "description": "Cluster designed for tagging OSINT artifacts that relate to OSRS artifacts that describe malicious backdoors.",
  "name": "OSRS Backdoor",
  "source": "OSRS DEV",
  "type": "CMCF-BLOCK-OSRS",
  "uuid": "deb05256-49bf-11ea-b77f-2e728ce88125",
  "values": [
	{
      "description": "A backdoor that can be used on linux and windows systems. Both instances of this malware are practically identical in terms of overall functionality, with minor implementation differences. Both malware instances share the same protocol to communicate with the same CNC server. However, these instances have different delivery vectors. The windows instance has been observed being delivered by the Fallout Exploit Kit. The main function is not obfuscated and appears to be straightforward in logic. In the Windows variant we can see how some strings are decoded in the beginning of the function. After initial string decoding the malware serializes the victim by collecting architecture, system, and MAC address information. The way the Windows variant collects this information is by calling the correspondent Windows API functions in order to retrieve the subject information such as IsWow64Process. The Linux variant, on the other hand, uses a different technique that mainly relies on uname system call to retrieve architecture and system information, in addition to a combination of socket as well as ioctl system calls to retrieve the MAC address. After victim information has been serialized, the malware will apply some persistence mechanisms. The Windows instance will initialize a registry entry so that the malware will be executed on system start-up. The Linux instance will set up various symbolic links and add an initrd script for the malware to also run on system start-up.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Backdoor"
        ],
        "refs": [
          "https://www.intezer.com/blog-acbackdoor-analysis-of-a-new-multiplatform-backdoor/"
        ]
      },
      "uuid": "2186503c-29bb-11ea-978f-2e728ce88125",
      "value": "OSRS Backdoor: ACBackdoor"
    },
	{
      "description": "BalkanDoor is a simple backdoor with a small number of commands (download and execute a file, create a remote shell, take a screenshot). It can be used to automate tasks on the compromised computer or to automatically control several affected computers at once. We have seen six versions of the backdoor, ranging in supported commands, evolving since 2016.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Backdoor"
        ],
        "refs": [
          "https://www.welivesecurity.com/2019/08/14/balkans-businesses-double-barreled-weapon/"
        ]
      },
      "uuid": "e12b4fc6-41d7-11ea-b77f-2e728ce88125",
      "value": "OSRS Backdoor: BalkanDoor"
    },
	{
      "description": "During analysis of the xHunt campaign, researchers from UNIT42 observed several domains with ties to the pasta58.com domain associated with known Sakabota command and control (C2) activity. In June 2019, they also observed one of these overlapping domains, specifically, windows64x.com, being used as the C2 server for a new PowerShell based backdoor that has been named by UNIT42 researchers as CASHY200. This PowerShell backdoor used DNS tunneling to communicate with its C2 server, specifically by issuing DNS A queries to the actor controlled name server at the aforementioned domain. CASHY200 parses data provided by the C2 server within DNS answers to run commands on the system and send the results back to the C2 via DNS queries. In several samples, CASHY200 used randomly generated identifiers that are stored in the registry and used the command value 200 to communicate with the C2 server. By analyzing the lineage of this tool, UNIT42 researchers found that actors may have used CASHY200 when targeting Kuwaiti government organizations starting in the spring of 2018 and continuing throughout 2019.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Backdoor"
        ],
        "refs": [
          "https://unit42.paloaltonetworks.com/more-xhunt-new-powershell-backdoor-blocked-through-dns-tunnel-detection/"
        ]
      },
      "uuid": "e12b52b4-41d7-11ea-b77f-2e728ce88125",
      "value": "OSRS Backdoor: CASHY200"
    },
	{
      "description": "DELPHSTATS, a backdoor written in the Delphi programming language, emerged. DELPHSTATS queries the C&C server for a .dat file before executing it via the Powershell.exe process. Like SHARPSTATS, DELPHSTATS employs custom PowerShell script with code similarities to the one embedded into the former.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Backdoor"
        ],
        "refs": [
          "https://blog.trendmicro.com/trendlabs-security-intelligence/muddywater-resurfaces-uses-multi-stage-backdoor-powerstats-v3-and-new-post-exploitation-tools/"
        ]
      },
      "uuid": "e12b566a-41d7-11ea-b77f-2e728ce88125",
      "value": "OSRS Backdoor: DELPHSTATS"
    },
	{
      "description": "A multiprotocol backdoor called DNSbot, which is used to exchange commands and push data to and from compromised machines. Primarily, it operates over DNS traffic, but can also switch to encrypted channels such as HTTPS or SSL.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Backdoor"
        ],
        "refs": [
          "https://www.flashpoint-intel.com/blog/fin7-revisited-inside-astra-panel-and-sqlrat-malware/"
        ]
      },
      "uuid": "e12b57c8-41d7-11ea-b77f-2e728ce88125",
      "value": "OSRS Backdoor: DNSbot"
    },
	{
      "description": "Empire is a post-exploitation framework that includes a pure-PowerShell2.0 Windows agent, and a pure Python 2.6/2.7 Linux/OS X agent. It is the merge of the previous PowerShell Empire and Python EmPyre projects. The framework offers cryptologically-secure communications and a flexible architecture. On the PowerShell side, Empire implements the ability to run PowerShell agents without needing powershell.exe, rapidly deployable post-exploitation modules ranging from key loggers to Mimikatz, and adaptable communications to evade network detection, all wrapped up in a usability-focused framework. PowerShell Empire premiered at BSidesLV in 2015 and Python EmPyre premeiered at HackMiami 2016.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Backdoor"
        ],
        "refs": [
          "https://github.com/EmpireProject/Empire"
        ]
      },
      "uuid": "e12b58fe-41d7-11ea-b77f-2e728ce88125",
      "value": "OSRS Backdoor: Empire Backdoor"
    },
	{
      "description": "Attributed to The Dukes (aka APT29 and Cozy Bear), this sophisticated backdoor implements a lot of functionalities and has a very flexible configuration. Its code is also well obfuscated using many opaque predicates. They re-compile it and modify the obfuscation frequently to bypass security product detections.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Backdoor"
        ],
        "refs": [
          "https://www.welivesecurity.com/2019/10/17/operation-ghost-dukes-never-left/"
        ]
      },
      "uuid": "e12b5b06-41d7-11ea-b77f-2e728ce88125",
      "value": "OSRS Backdoor: FatDuke"
    },
	{
      "description": "FlowerPippi collects some of the user’s information, which it sends to the C&C server. When collecting information, FlowerPippi generates the victim ID from the system’s MAC address using the FNV-1a hash algorithm.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Backdoor"
        ],
        "refs": [
          "https://blog.trendmicro.com/trendlabs-security-intelligence/latest-spam-campaigns-from-ta505-now-using-new-malware-tools-gelup-and-flowerpippi/"
        ]
      },
      "uuid": "e12b5c5a-41d7-11ea-b77f-2e728ce88125",
      "value": "OSRS Backdoor: FlowerPippi"
    },
	{
      "description": "The malware installs two instances of itself on the system. The second instance (watchdog) monitors whether the first instance is still active and reinstalls it if it has been removed from the system. The malware employs antivirus bypass techniques (it allocates large chunks of memory and delays execution of the malicious payload to prevent antivirus engines from emulating the code due to resource constraints). The malware can detect selected security and analytical tools, such as debuggers. If detected, it terminates itself. The malware terminates itself if IP information of the victim suggests one of several blacklisted organizations (e.g. Amazon, BitDefender, Cisco, ESET). It uses external legitimate websites for querying IP information and searches for hardcoded strings in this information (e.g. cloud, Cisco, Microsoft), rather than using API functions. The malware terminates itself if its file name consists of 32 hexadecimal characters, which prevents the payload from being executed in some automated sandboxes.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Backdoor"
        ],
        "refs": [
          "https://www.welivesecurity.com/2019/07/08/south-korean-users-backdoor-torrents/"
        ]
      },
      "uuid": "e12b5d7c-41d7-11ea-b77f-2e728ce88125",
      "value": "OSRS Backdoor: GoBot2"
    },
	{
      "description": "Variant of the GoBot2 backdoor specifically modified for Asian targets.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Backdoor"
        ],
        "refs": [
          "https://en.wikipedia.org/wiki/Backdoor_(computing)"
        ]
      },
      "uuid": "e12b622c-41d7-11ea-b77f-2e728ce88125",
      "value": "OSRS Backdoor: GoBotKR"
    },
	{
      "description": "Godlua Backdoor has a redundant communication mechanism for C2 connection, a combination of hardcoded dns name, Pastebin.com, GitHub.com as well as DNS TXT are used to store the C2 address, which is not something we see often. At the same time, it uses HTTPS to download Lua byte-code files, and uses DNS over HTTPS to get the C2 name to ensure secure communication between the bots, the Web Server and the C2.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Backdoor"
        ],
        "refs": [
          "https://blog.netlab.360.com/an-analysis-of-godlua-backdoor-en/"
        ]
      },
      "uuid": "e12b63a8-41d7-11ea-b77f-2e728ce88125",
      "value": "OSRS Backdoor: GodLua"
    },
	{
      "description": "HIGHNOON is a backdoor that consists of multiple components, including a loader, dynamic-link library (DLL), and a rootkit. When loaded, the DLL may deploy one of two embedded drivers to conceal network traffic and communicate with its command and control server to download and launch memory-resident DLL plugins.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Backdoor"
        ],
        "refs": [
          "https://www.fireeye.com/blog/threat-research/2019/08/game-over-detecting-and-stopping-an-apt41-operation.html"
        ]
      },
      "uuid": "ec151ff6-41d8-11ea-b77f-2e728ce88125",
      "value": "OSRS Backdoor: HIGHNOON"
    },
	{
      "description": "Hannotog is a custom backdoor which provides the attackers with a persistent presence on the victim’s network. It has been used in conjunction with several other Thrip tools, including Sagerunex, another custom backdoor providing remote access to the attackers, and Catchamas (Infostealer.Catchamas), a custom Trojan deployed on selected computers of interest and designed to steal information.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Backdoor"
        ],
        "refs": [
          "https://www.symantec.com/blogs/threat-intelligence/thrip-apt-south-east-asia"
        ]
      },
      "uuid": "ec152618-41d8-11ea-b77f-2e728ce88125",
      "value": "OSRS Backdoor: Hannotog"
    },
	{
      "description": "Hisoka is a backdoor malware that uses both HTTP and DNS tunneling for C2 communication. In several instances, historical infrastructure analysis shows potential overlaps between both Hisoka and Sakabota activities, as well as with OilRig ISMAgent campaigns and DNS Hijacking activity infrastructure.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Backdoor"
        ],
        "refs": [
          "https://unit42.paloaltonetworks.com/xhunt-campaign-attacks-on-kuwait-shipping-and-transportation-organizations/"
        ]
      },
      "uuid": "ec152794-41d8-11ea-b77f-2e728ce88125",
      "value": "OSRS Backdoor: Hisoka"
    },
	{
      "description": "The Ivoke backdoor is a completely fileless Trojan. Its main task is to collect information about the infected system and load the next stage upon command from the CnC server.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Backdoor"
        ],
        "refs": [
          "https://www.group-ib.com/resources/threat-research/silence_2.0.going_global.pdf"
        ]
      },
      "uuid": "ec1528c0-41d8-11ea-b77f-2e728ce88125",
      "value": "OSRS Backdoor: Ivoke"
    },
	{
      "description": "A backdoor used by the threat actor Ke3chang - and, sometimes used in conjunction with the Okrum backdoor.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Backdoor"
        ],
        "refs": [
          "https://www.welivesecurity.com/wp-content/uploads/2019/07/ESET_Okrum_and_Ketrican.pdf"
        ]
      },
      "uuid": "ec1529f6-41d8-11ea-b77f-2e728ce88125",
      "value": "OSRS Backdoor: Ketrican"
    },
	{
      "description": "Killua functions as a backdoor similar to Hisoka, but unlike its Hisoka cousin, Killua was not developed in C# — rather it was coded in Visual C++. Killua also appears to be newer than known Hisoka samples as Killua samples were not compiled until June 25 and 30, 2019. Similar to Hisoka, Killua writes its configuration to the registry.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Backdoor"
        ],
        "refs": [
          "https://unit42.paloaltonetworks.com/xhunt-campaign-attacks-on-kuwait-shipping-and-transportation-organizations/"
        ]
      },
      "uuid": "ec152b22-41d8-11ea-b77f-2e728ce88125",
      "value": "OSRS Backdoor: Killua"
    },
	{
      "description": "LOWKEY is a passive backdoor that supports commands for a reverse shell, uploading and downloading files, listing and killing processes and file management. There are two variants of the LOWKEY backdoor. The first is a TCP variant that listens on port 53, and the second is an HTTP variant that listens on TCP port 80.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Backdoor"
        ],
        "refs": [
          "https://www.fireeye.com/blog/threat-research/2019/10/lowkey-hunting-for-the-missing-volume-serial-id.html"
        ]
      },
      "uuid": "ec152cf8-41d8-11ea-b77f-2e728ce88125",
      "value": "OSRS Backdoor: LOWKEY"
    },
	{
      "description": "This backdoor, dubbed LightNeuron, has been specifically targeting Microsoft Exchange mail servers since at least 2014. Although no samples were available for analysis, code artefacts in the Windows version lead us to believe that a Linux variant exists.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Backdoor"
        ],
        "refs": [
          "https://www.welivesecurity.com/2019/05/07/turla-lightneuron-email-too-far/"
        ]
      },
      "uuid": "ec152e6a-41d8-11ea-b77f-2e728ce88125",
      "value": "OSRS Backdoor: LightNeuron"
    },
	{
      "description": "Meterpreter is an advanced, dynamically extensible payload that uses in-memory DLL injection stagers and is extended over the network at runtime. It communicates over the stager socket and provides a comprehensive client-side Ruby API.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Backdoor"
        ],
        "refs": [
          "https://www.symantec.com/blogs/threat-intelligence/waterbug-espionage-governments"
        ]
      },
      "uuid": "ec153266-41d8-11ea-b77f-2e728ce88125",
      "value": "OSRS Backdoor: Meterpreter"
    },
	{
      "description": "Neptun is installed on Microsoft Exchange servers and is designed to passively listen for commands from the attackers. This passive listening capability makes the malware more difficult to detect. Neptun is also able to download additional tools, upload stolen files, and execute shell commands.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Backdoor"
        ],
        "refs": [
          "https://www.symantec.com/blogs/threat-intelligence/waterbug-espionage-governments"
        ]
      },
      "uuid": "ec1533b0-41d8-11ea-b77f-2e728ce88125",
      "value": "OSRS Backdoor: Neptun"
    },
	{
      "description": "Netero is embedded in the Hisoka tool within a resource named msdtd and is saved to the system in the event that Hisoka needs to use that functionality. The process of moving the functionality out of Hisoka into another tool suggests the author was seeking a more modular architecture in an attempt to evade detection. The payload is base64 encoded and exists as a certificate, which Hisoka v0.9 uses certutil.exe.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Backdoor"
        ],
        "refs": [
          "https://unit42.paloaltonetworks.com/xhunt-campaign-attacks-on-kuwait-shipping-and-transportation-organizations/"
        ]
      },
      "uuid": "45e54844-41d9-11ea-b77f-2e728ce88125",
      "value": "OSRS Backdoor: Netero"
    },
	{
      "description": "Backdoor that allows for system information discovery, network communication over HTTP, and file access. Used by the threat actor known as Ke3chang.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Backdoor"
        ],
        "refs": [
          "https://www.welivesecurity.com/wp-content/uploads/2019/07/ESET_Okrum_and_Ketrican.pdf"
        ]
      },
      "uuid": "45e54b0a-41d9-11ea-b77f-2e728ce88125",
      "value": "OSRS Backdoor: Okrum"
    },
	{
      "description": "POISONPLUG is a highly obfuscated modular backdoor with plug-in capabilities. The malware is capable of registry or service persistence, self-removal, plug-in execution, and network connection forwarding. POISONPLUG has been observed using social platforms to host encoded command and control commands.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Backdoor"
        ],
        "refs": [
          "https://www.fireeye.com/blog/threat-research/2019/10/lowkey-hunting-for-the-missing-volume-serial-id.html"
        ]
      },
      "uuid": "45e54c5e-41d9-11ea-b77f-2e728ce88125",
      "value": "OSRS Backdoor: POISONPLUG"
    },
	{
      "description": "A multi-stage PowerShell-based backdoor called POWERSTATS v3. The spear-phishing email that contains a document embedded with a malicious macro drops a VBE file encoded with Microsoft Script Encoder. The VBE file, which holds a base64-encoded block of data containing obfuscated PowerShell script, will then execute. This block of data will be decoded and saved to the %PUBLIC% directory under various names ending with image file extensions such as .jpeg and .png. The PowerShell code will then use custom string obfuscation and useless code blocks to make it difficult to analyze.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Backdoor"
        ],
        "refs": [
          "https://blog.trendmicro.com/trendlabs-security-intelligence/muddywater-resurfaces-uses-multi-stage-backdoor-powerstats-v3-and-new-post-exploitation-tools/"
        ]
      },
      "uuid": "45e54d94-41d9-11ea-b77f-2e728ce88125",
      "value": "OSRS Backdoor: POWERSTATS v3"
    },
	{
      "description": "Pluox can spread itself over a local network via an exploit, provide access to the attacked network, and install miners and other malicious software on victim computers. What’s more, the backdoor is modular, which means that its functionality can be expanded with the aid of plugins, as required.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Backdoor"
        ],
        "refs": [
          "https://securelist.com/plurox-modular-backdoor/91213/"
        ]
      },
      "uuid": "45e55064-41d9-11ea-b77f-2e728ce88125",
      "value": "OSRS Backdoor: Plurox"
    },
	{
      "description": "The PortReuse backdoor does not use a C2 server; it waits for an incoming connection that sends a magic packet. To do so, it doesn’t open an additional TCP port; it injects into an existing process to reuse a port that is already open. To be able to parse incoming data to search for the magic packet, two techniques are used - hooking of the receiving function (WSARecv or even the lower level NtDeviceIoControlFile) or registering a handler for a specific URL resource on an IIS server using HttpAddUrl with a URLPrefix. There are variants that different services and ports. They include DNS (53), HTTP (80), HTTPS (443), RDP (3389) and WinRM (5985).",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Backdoor"
        ],
        "refs": [
          "https://www.welivesecurity.com/2019/10/14/connecting-dots-exposing-arsenal-methods-winnti/",
		  "https://www.fireeye.com/blog/threat-research/2019/10/lowkey-hunting-for-the-missing-volume-serial-id.html"
        ]
      },
      "uuid": "45e551ae-41d9-11ea-b77f-2e728ce88125",
      "value": "OSRS Backdoor: PortReuse"
    },
	{
      "description": "Allows a user to run PowerShell scripts without executing powershell.exe, therefore the user may bypass detection aimed at identifying malicious PowerShell usage.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Backdoor"
        ],
        "refs": [
          "https://www.symantec.com/blogs/threat-intelligence/waterbug-espionage-governments"
        ]
      },
      "uuid": "45e552da-41d9-11ea-b77f-2e728ce88125",
      "value": "OSRS Backdoor: PowerShellRunner"
    },
	{
      "description": "PowerShower, named and previously disclosed by Palo Alto Networks in their blogspot (see above), is a malicious piece of PowerShell designed to receive PowerShell and VBS modules to execute on the local computer. This malware has been used since October 2018 by Cloud Atlas as a validator and now as a second stage. The differences in the two versions reside mostly in anti-forensics features for the validator version of PowerShower.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Backdoor"
        ],
        "refs": [
          "https://securelist.com/recent-cloud-atlas-activity/92016/"
        ]
      },
      "uuid": "45e553fc-41d9-11ea-b77f-2e728ce88125",
      "value": "OSRS Backdoor: PowerShower"
    },
	{
      "description": "In the ProCC campaigns, the downloaded files are Delphi binaries. The backdoor is developed from scratch and is able to collect data from the clipboard and printer spooler, and capture screenshots. Because the personnel in charge of confirming reservations usually need to pull credit card data from OTA websites, it’s possible to collect card numbers by monitoring the clipboard and the documents sent to the printer.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Backdoor"
        ],
        "refs": [
          "https://securelist.com/revengehotels/95229/"
        ]
      },
      "uuid": "45e5574e-41d9-11ea-b77f-2e728ce88125",
      "value": "OSRS Backdoor: ProCC Backdoor"
    },
	{
      "description": "SHARPSTATS, a .NET-written backdoor that supports DOWNLOAD, UPLOAD, and RUN functions.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Backdoor"
        ],
        "refs": [
          "https://blog.trendmicro.com/trendlabs-security-intelligence/muddywater-resurfaces-uses-multi-stage-backdoor-powerstats-v3-and-new-post-exploitation-tools/"
        ]
      },
      "uuid": "45e558a2-41d9-11ea-b77f-2e728ce88125",
      "value": "OSRS Backdoor: SHARPSTATS"
    },
	{
      "description": "It supports writing and reading files, modification of file properties, an interactive command shell, TCP relay functionality and listing running processes. Data received by the backdoor is encrypted with RC4 using the key CreateThread and then XORed with 0x77. All data sent by the backdoor uses the same encryption in reverse order (first XOR with 0x77, then RC4 encrypted with the key CreateThread). Encrypted data is preceded by a 16-byte header which is unencrypted containing an identifier and the size of the following encrypted packet.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Backdoor"
        ],
        "refs": [
          "https://www.fireeye.com/blog/threat-research/2019/10/lowkey-hunting-for-the-missing-volume-serial-id.html"
        ],
        "synonyms": [
        "SK3.x.exe"
        ]
      },
      "uuid": "591c02de-41e0-11ea-b77f-2e728ce88125",
      "value": "OSRS Backdoor: SK3 Backdoor"
    },
	{
      "description": "The backdoor dubbed SLUB by the Trend Micro Cyber Safety Solutions Team who detected it in the wild is part of a multi-stage infection process designed by capable threat actors who programmed it in C++. SLUB uses statically-linked curl, boost, and JsonCpp libraries for performing HTTP request, extracting commands from gist snippets, and parsing Slack channel communication.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Backdoor"
        ],
        "refs": [
          "https://www.bleepingcomputer.com/news/security/new-slub-backdoor-uses-slack-github-as-communication-channels/"
        ]
      },
      "uuid": "591c055e-41e0-11ea-b77f-2e728ce88125",
      "value": "OSRS Backdoor: SLUB"
    },
	{
      "description": "Hannotog is a custom backdoor which provides the attackers with a persistent presence on the victim’s network. It has been used in conjunction with several other Thrip tools, including Sagerunex, another custom backdoor providing remote access to the attackers, and Catchamas (Infostealer.Catchamas), a custom Trojan deployed on selected computers of interest and designed to steal information.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Backdoor"
        ],
        "refs": [
          "https://www.symantec.com/blogs/threat-intelligence/thrip-apt-south-east-asia"
        ]
      },
      "uuid": "591c06b2-41e0-11ea-b77f-2e728ce88125",
      "value": "OSRS Backdoor: Sagerunex"
    },
	{
      "description": "Sakabota is the predecessor to Hisoka, which was first observed in May 2019. The number of functions and variable names are exactly the same in both Sakabota and Hisoka suggest, which infers that the same developer created both and spent little effort trying to hide this lineage.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Backdoor"
        ],
        "refs": [
          "https://unit42.paloaltonetworks.com/xhunt-campaign-attacks-on-kuwait-shipping-and-transportation-organizations/"
        ]
      },
      "uuid": "591c07e8-41e0-11ea-b77f-2e728ce88125",
      "value": "OSRS Backdoor: Sakabota"
    },
	{
      "description": "Used in POS malware attacks, ShellTea has several capabilities. Among them are (1) ability to execute PowerShell commands, (2) evasion through hashing algorithms, (3) code injection, (4) virtual as well as sandbox detection, (5) system process discovery, and (6) HTTPS support for C2. It has been used by the threat actors FIN6, FIN7, and FIN8.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Backdoor"
        ],
        "refs": [
          "http://blog.morphisec.com/security-alert-fin8-is-back"
        ]
      },
      "uuid": "591c0932-41e0-11ea-b77f-2e728ce88125",
      "value": "OSRS Backdoor: ShellTea"
    },
	{
      "description": "The SpeakUp backdoor leverages known vulnerabilities in six different Linux distros, it is also able to infect Mac systems. The Trojan spread by exploiting remote code execution flaw and for the initial infection hackers leverage recently disclosed flaw in ThinkPHP (CVE-2018-20062).",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Backdoor"
        ],
        "refs": [
          "https://securityaffairs.co/wordpress/80706/malware/speakup-backdoor.html"
        ]
      },
      "uuid": "591c0d06-41e0-11ea-b77f-2e728ce88125",
      "value": "OSRS Backdoor: SpeakUp"
    },
	{
      "description": "A new malware is targeting Discord users by modifying the Windows Discord client so that it is transformed into a backdoor and an information-stealing Trojan. The Windows Discord client is an Electron application, which means that almost all of its functionality is derived from HTML, CSS, and JavaScript. This allows malware to modify its core files so that the client executes malicious behavior on startup. Discovered by researcher MalwareHunterTeam, this malware is called Spidey Bot based on the name of the Discord command and control channel that the malware communicated with.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Backdoor"
        ],
        "refs": [
          "https://www.bleepingcomputer.com/news/security/discord-turned-into-an-info-stealing-backdoor-by-new-malware/"
        ],
        "synonyms": [
        "Blue Face"
        ]
      },
      "uuid": "591c0e78-41e0-11ea-b77f-2e728ce88125",
      "value": "OSRS Backdoor: Spidey Bot"
    },
	{
      "description": "The StealthFalcon backdoor, which appears to have been created in 2015, allows the attacker to control the compromised computer remotely. A small number of targets have been observed in UAE, Saudi Arabia, Thailand, and the Netherlands; in the latter case, the target was a diplomatic mission of a Middle Eastern country.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Backdoor"
        ],
        "refs": [
          "https://www.welivesecurity.com/2019/09/09/backdoor-stealth-falcon-group/"
        ]
      },
      "uuid": "591c0fb8-41e0-11ea-b77f-2e728ce88125",
      "value": "OSRS Backdoor: StealthFalcon Backdoor"
    },
	{
      "description": "This is a basic backdoor that can download and execute additional tools and commands. The actors behind it have developed it in both Delphi and .NET.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Backdoor"
        ],
        "refs": [
          "https://www.symantec.com/blogs/threat-intelligence/tortoiseshell-apt-supply-chain"
        ]
      },
      "uuid": "591c10ee-41e0-11ea-b77f-2e728ce88125",
      "value": "OSRS Backdoor: Syskit Backdoor"
    },
	{
      "description": "TONEDEAF is a backdoor that communicates with Command and Control servers using HTTP or DNS. Supported commands include system information collection, file upload, file download, and arbitrary shell command execution. Although this backdoor was coded to be able to communicate with DNS requests to the hard-coded Command and Control server, c[.]cdn-edge-akamai[.]com, it was not configured to use this functionality. Figure 5 provides a snippet of the assembly CALL instruction of dns_exfil. The creator likely made this as a means for future DNS exfiltration as a plan B.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Backdoor"
        ],
        "refs": [
          "https://www.fireeye.com/blog/threat-research/2019/07/hard-pass-declining-apt34-invite-to-join-their-professional-network.html"
        ]
      },
      "uuid": "591c121a-41e0-11ea-b77f-2e728ce88125",
      "value": "OSRS Backdoor: TONEDEAF"
    },
	{
      "description": "The VBShower backdoor has the same philosophy of the validator version of PowerShower. Its aim is to complicate forensic analysis by trying to delete all the files contained in APPDATA..Local Temporary Internet Files Content.Word and APPDATA .. Local Settings Temporary Internet Files Content.Word. Once these files have been deleted and its persistence is achieved in the registry, VBShower sends the context file computed by the HTA to the remote server and tries to get via HTTP a VBS script to execute from the remote server every hour.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Backdoor"
        ],
        "refs": [
          "https://securelist.com/recent-cloud-atlas-activity/92016/"
        ]
      },
      "uuid": "591c1346-41e0-11ea-b77f-2e728ce88125",
      "value": "OSRS Backdoor: VBShower"
    },
	{
      "description": "The backdoor will modify the registry for the Windows Media Player to store its C&C configuration. It also reconfigures the Microsoft Sysinternals registry to prevent pop-ups when running the PsExec tool. The backdoor has the capability to download and upload files, execute shell commands, and update its configuration.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Backdoor"
        ],
        "refs": [
          "https://www.symantec.com/blogs/threat-intelligence/waterbug-espionage-governments"
        ]
      },
      "uuid": "591c1652-41e0-11ea-b77f-2e728ce88125",
      "value": "OSRS Backdoor: photobased.dll"
    },
	{
      "description": "This backdoor can receive commands through the RPC protocol. Its capabilities include: Executing commands through cmd.exe with the output redirected into a temporary file. Reading the command output contained in the temporary file. Reading or writing arbitrary files.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Backdoor"
        ],
        "refs": [
          "https://www.symantec.com/blogs/threat-intelligence/waterbug-espionage-governments"
        ]
      },
      "uuid": "591c179c-41e0-11ea-b77f-2e728ce88125",
      "value": "OSRS Backdoor: securlsa.chk"
    },
	{
      "description": "This backdoor targets MSSQL Server 11 and 12, allowing the attacker to connect stealthily to any MSSQL account by using a magic password – while automatically hiding these connections from the logs. Such a backdoor could allow an attacker to stealthily copy, modify or delete database content. This could be used, for example, to manipulate in-game currencies for financial gain.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Backdoor"
        ],
        "refs": [
          "https://www.welivesecurity.com/2019/10/21/winnti-group-skip2-0-microsoft-sql-server-backdoor/"
        ]
      },
      "uuid": "591c18d2-41e0-11ea-b77f-2e728ce88125",
      "value": "OSRS Backdoor: skip-2.0"
    },
	{
      "description": "Buerak is a Windows-based Trojan that implements backdoor capabilities and anti-analysis techniques.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Backdoor"
        ],
        "refs": [
          "https://securelist.com/mokes-and-buerak-distributed-under-the-guise-of-security-certificates/96324/"
        ]
      },
      "uuid": "811409f2-6522-11ea-bc55-0242ac130003",
      "value": "OSRS Backdoor: Buerak Backdoor"
    },
	{
      "description": "Backdoor tool associated with Vault 7 and APT-C-39.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Backdoor"
        ],
        "refs": [
          "http://blogs.360.cn/post/APT-C-39_CIA_EN.html"
        ]
      },
      "uuid": "e4b31b00-67d5-11ea-bc55-0242ac130003",
      "value": "OSRS Backdoor: Fluxwire Backdoor"
    },
	{
      "description": "Backdoor tool associated with the Android trojan Cookiethief, and was identified by they cybersecurity vendor Kaspersky.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Backdoor"
        ],
        "refs": [
          "https://securelist.com/cookiethief/96332/"
        ]
      },
      "uuid": "c1b1cf48-686b-11ea-bc55-0242ac130003",
      "value": "OSRS Backdoor: Bood Backdoor"
    },
	{
      "description": "Attributed to the threat actor Turla. Prior to the end of August 2019, the victim would receive a RAR-SFX archive containing a legitimate Adobe Flash v14 installer and a second RAR-SFX archive. The latter contains the various components of a backdoor known as Skipper that has been previously attributed to Turla. It was documented in 2017 by researchers from Bitdefender, and a more recent version was documented by Telsy in May 2019. One interesting change is that the Skipper communication module uses the server that hosts this campaign’s remote JavaScripts and malicious binaries for its C&C server.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Backdoor"
        ],
        "refs": [
          "https://www.welivesecurity.com/2020/03/12/tracking-turla-new-backdoor-armenian-watering-holes/"
        ]
      },
      "uuid": "ac948e4a-691d-11ea-bc55-0242ac130003",
      "value": "OSRS Backdoor: Skipper Backdoor"
    },
	{
      "description": "Associated with the threat actor Turla.  This second stage backdoor is a py2exe executable. py2exe is a Python extension to convert a Python script into a standalone Windows executable. To our knowledge, this is the first time the Turla developers have used the Python language in a backdoor. The backdoor communicates with its hardcoded C&C server via HTTP. The C&C URL and other parameters such as the AES key and IV used to encrypt all network communications are specified at the beginning of the script. The main function of the script, sends information about the machine to the C&C server. This is the output of the functions from the commands list. It includes OS-related commands (systeminfo, tasklist) and network-related commands (ipconfig, getmac, arp). The C&C server can also send backdoor commands in JSON format. Additional features include - download additional files from a given HTTP(S) link, execute a Windows command using the Python function subprocess32.Popen, change the execution delay - modifies the Windows task that regularly (every X minutes - 5 by default) launches the malware, and kill (uninstall) the malware.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Backdoor"
        ],
        "refs": [
          "https://www.welivesecurity.com/2020/03/12/tracking-turla-new-backdoor-armenian-watering-holes/"
        ]
      },
      "uuid": "ac94907a-691d-11ea-bc55-0242ac130003",
      "value": "OSRS Backdoor: PyFlash Backdoor"
    },
	{
      "description": "Backdoor that is associated with the abuse of Cloudflare Workers.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Backdoor"
        ],
        "refs": [
          "https://www.bleepingcomputer.com/news/security/blackwater-malware-abuses-cloudflare-workers-for-c2-communication/"
        ]
      },
      "uuid": "ac949192-691d-11ea-bc55-0242ac130003",
      "value": "OSRS Backdoor: BlackWater Backdoor"
    },
	{
      "description": "The WP-VCD family of WordPress infections are distributed as nulled, or pirated, WordPress plugins that contain modified code that injects a backdoor into any themes that are installed on the blog as well as various PHP files. Once a WordPress site is compromised by WP-VCD, the malware will attempt to compromise other sites on the same shared host and will routinely connect back to its command & control server to receive new instructions to execute.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Backdoor"
        ],
        "refs": [
          "https://www.bleepingcomputer.com/news/security/wordpress-malware-distributed-via-pirated-coronavirus-plugins/"
        ]
      },
      "uuid": "8405287e-72a3-11ea-bc55-0242ac130003",
      "value": "OSRS Backdoor: WordPress WP-VCD Backdoor"
    },
	{
      "description": "Beacon is Cobalt Strike's payload to model advanced attackers. Use Beacon to egress a network over HTTP, HTTPS, or DNS. You may also limit which hosts egress a network by controlling peer-to-peer Beacons over Windows named pipes. Beacon is flexible and supports asynchronous and interactive communication. Asynchronous communication is low and slow. Beacon will phone home, download its tasks, and go to sleep. Interactive communication happens in real-time. Beacon's network indicators are malleable. Redefine Beacon's communication with Cobalt Strike's malleable C2 language. This allows you to cloak Beacon activity to look like other malware or blend-in as legitimate traffic.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Backdoor"
        ],
        "refs": [
          "https://www.cobaltstrike.com/help-beacon",
		  "https://attack.mitre.org/software/S0154/"
        ]
      },
      "uuid": "84052a9a-72a3-11ea-bc55-0242ac130003",
      "value": "OSRS Backdoor: Cobalt Strike BEACON Backdoor"
    },
	{
      "description": "This implant is written in Go language, and its C2 channel relies on file exchanges with a Google Drive space, through Google Drive’s HTTPS API v3. The implant probably leverages the gdrive Go source from GitHub, as it shares several identical code source paths with it. Godlike12 is the name the threat actor gave to the Google Drive space connections from this implant. Source file paths in the code suggest this backdoor may have been developed on a GNU/Linux system. Some of this backdoor’s modules have been compiled from seems popular in Chinese-speaking communities, and may originate from a Chinese-authored tutorial on Go language. Godlike12 first proceeds with host fingerprinting upon startup (hostname, IP address, MAC address, Windows version, current time). The result is encrypted, base64-encoded, stored in a text file and uploaded to the remote Google Drive. The implant then regularly checks for a remote .txt, that contains encrypted commands to execute, and stores encrypted command results to later upload them to the same Google Drive space. ID is the MD5 hash of the base64-encoded MAC address of the first connected network adapter, while TripleDES in ECB mode is used as an encryption algorithm. It is worth mentioning that once again, the encryption function seems to have been inspired from existing open-source code, which mainly appears popular in Chinese-language forums. Godlike12 does not implement a persistence mechanism, as it is provided by the previous installer package.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Backdoor"
        ],
        "refs": [
          "https://securelist.com/holy-water-ongoing-targeted-water-holing-attack-in-asia/96311/"
        ]
      },
      "uuid": "24519664-7754-11ea-bc55-0242ac130003",
      "value": "OSRS Backdoor: Godlike12 Backdoor"
    },
	{
      "description": "A Cross Platform Python Remote Administration Tool. This is a cross platform python framework which allows you to build custom payloads for Windows, Mac OSX and Linux as well. You are able to select whether the payload binds to a specific IP and port, listens for a connection on a port, option to send an email of system info when the system boots, and option to start keylogger on boot. Payloads created can only run on the OS that they were created on. Allows for file auto-completeion, antivirus detection, keylogging, screen capture, dump system password hashes, and various other remote command options.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Backdoor"
        ],
        "refs": [
          "https://securelist.com/holy-water-ongoing-targeted-water-holing-attack-in-asia/96311/",
		  "https://github.com/nathanlopez/Stitch"
        ]
      },
      "uuid": "24519876-7754-11ea-bc55-0242ac130003",
      "value": "OSRS Backdoor: Stitch (Open Source Python Backdoor)"
    },
	{
      "description": "Attributed to APT41. The Speculoos backdoor is an ELF executable compiled with GCC 4.2.1 to run on a FreeBSD system. This payload does not appear to natively be able to maintain persistence, so it is likely it requires the adversary to use a separate component or additional step to maintain their foothold. Upon execution, the payload enters a loop that calls a function to communicate with the command and control (C2) domain over TCP 443.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Backdoor"
        ],
        "refs": [
          "https://unit42.paloaltonetworks.com/apt41-using-new-speculoos-backdoor-to-target-organizations-globally/"
        ]
      },
      "uuid": "160006a2-7fda-11ea-bc55-0242ac130003",
      "value": "OSRS Backdoor: Speculoos Backdoor"
    },
	{
      "description": "Believed to be developed by those who develop and maintain the TrickBot code base. Initial access through phishing. Backdoor itself is fileless. Downloads and executes Cobalt Strike.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Backdoor"
        ],
        "refs": [
          "https://www.bleepingcomputer.com/news/security/bazarbackdoor-trickbot-gang-s-new-stealthy-network-hacking-malware/"
        ]
      },
      "uuid": "7f6e147a-8ae9-11ea-bc55-0242ac130003",
      "value": "OSRS Backdoor: Bazar Backdoor (aka BazarBackdoor)"
    },
	{
      "description": "A constantly developed RAT that has been used in various targeted campaigns against both public and private subjects since late 2017. We observed multiple instances of attacks involving this RAT, and all of them happened in Central Asia. Among the targeted subjects were several important companies in the telecommunications and gas industries, and governmental entities. The Central Asian region joined Russia, Belarus and Mongolia as areas with victims of Mikroceen intrusions. These victims were not desktop users, but endpoints in corporate networks where a higher level of security is expected. Associated with the use of Mimikatz, Gh0st RAT, and lateral movement via Windows WMI.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Backdoor"
        ],
        "refs": [
          "https://www.welivesecurity.com/2020/05/14/mikroceen-spying-backdoor-high-profile-networks-central-asia/"
        ]
      },
      "uuid": "55458b5a-9ac6-11ea-bb37-0242ac130002",
      "value": "OSRS Backdoor: Mikroceen Backdoor RAT"
    },
	{
      "description": "Backdoor associated with CVE-2018-8174 VBScript 0day. Retro series backdoor known to be used by the APT-C-06 organization. Is an evolution of the Lucker backdoor.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Backdoor"
        ],
        "refs": [
          "https://blog.360totalsecurity.com/en/analysis-cve-2018-8174-vbscript-0day-apt-actor-related-office-targeted-attack/"
        ]
      },
      "uuid": "55458f06-9ac6-11ea-bb37-0242ac130002",
      "value": "OSRS Backdoor: Retro Backdoor"
    },
	{
      "description": "Sarwent appears to have been actively used since at least 2018 but not a lot has been publicly reported about it during that time period. Sarwent functionality has historically revolved around being a loader. Some other functionality that has remained consistent is its AV(AntiVirus) checking.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Backdoor"
        ],
        "refs": [
          "https://labs.sentinelone.com/sarwent-malware-updates-command-detonation/"
        ]
      },
      "uuid": "17e164ec-a03d-11ea-bb37-0242ac130002",
      "value": "OSRS Backdoor: Sarwent Backdoor"
    },
	{
      "description": "A modular backdoor. Persisting as a Print Processor, it was used by the Winnti Group against several video gaming companies that are based in South Korea and Taiwan and develop MMO (Massively Multiplayer Online) games. Video games developed by these companies are available on popular gaming platforms and have thousands of simultaneous players. In at least one case, the malware operators compromised a victim’s build system, which could have led to a supply-chain attack, allowing the attackers to trojanize game executables. In another case, the game servers were compromised, which could have allowed the attackers to, for example, manipulate in-game currencies for financial gain.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Backdoor"
        ],
        "refs": [
          "https://www.welivesecurity.com/2020/05/21/no-game-over-winnti-group/"
        ]
      },
      "uuid": "17e16744-a03d-11ea-bb37-0242ac130002",
      "value": "OSRS Backdoor: PipeMon Backdoor"
    },
	{
      "description": "The Ke3chang group, also known as APT15, is an alleged Chinese government-backed cluster of teams known to target various high-profile entities spanning multiple continents. Examples include attacks on European ministries, Indian embassies, and British military contractors. The group’s activities have been traced back to 2010 and it is known to boast a large number of custom tools, most often tailored to their specific target. In mid May, researchers identified three recently uploaded samples from VirusTotal that share code with older APT15 implants. Researchers named this new family of samples, Ketrum, due to the merger of features in the documented backdoor families Ketrican and Okrum. We believe the operation was conducted very recently. Below we present a technical analysis of these samples and explain the evolution of APT15’s codebase over the last year.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Backdoor"
        ],
        "refs": [
          "https://www.bleepingcomputer.com/news/security/hacking-group-builds-new-ketrum-malware-from-recycled-backdoors/",
		  "https://www.intezer.com/blog/research/the-evolution-of-apt15s-codebase-2020/"
        ]
      },
      "uuid": "073d2360-a736-11ea-bb37-0242ac130002",
      "value": "OSRS Backdoor: Ketrum Backdoor"
    },
	{
      "description": "Backdoor leveraged by InvisiMole threat actor. The Control Panel misuse chain uses a rare technique known from Vault 7 leaks, used to achieve covert execution in the context of the Control Panel. The SMInit exploit chain exploits a vulnerability in the legitimate Total Video Player software. It is used in cases where the attackers haven’t managed to obtain administrative privileges on the system. The Speedfan exploit chain exploits a local privilege escalation vulnerability in the speedfan.sys driver to inject its code to a trusted process from kernel mode. The Wdigest exploit chain is InvisiMole’s flagship chain, the most elaborate, used on the newest versions of Windows, where the attackers have administrative privileges. It exploits a vulnerability in the Windows wdigest.dll library and then uses an improved ListPlanting technique to inject its code into a trusted process.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Backdoor"
        ],
        "refs": [
          "https://www.welivesecurity.com/2020/06/18/digging-up-invisimole-hidden-arsenal/"
        ]
      },
      "uuid": "7275374e-b6e0-11ea-b3de-0242ac130004",
      "value": "OSRS Backdoor: RC2CL Backdoor"
    },
	{
      "description": "Backdoor leveraged by InvisiMole threat actor. The Control Panel misuse chain uses a rare technique known from Vault 7 leaks, used to achieve covert execution in the context of the Control Panel. The SMInit exploit chain exploits a vulnerability in the legitimate Total Video Player software. It is used in cases where the attackers haven’t managed to obtain administrative privileges on the system. The Speedfan exploit chain exploits a local privilege escalation vulnerability in the speedfan.sys driver to inject its code to a trusted process from kernel mode. The Wdigest exploit chain is InvisiMole’s flagship chain, the most elaborate, used on the newest versions of Windows, where the attackers have administrative privileges. It exploits a vulnerability in the Windows wdigest.dll library and then uses an improved ListPlanting technique to inject its code into a trusted process.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Backdoor"
        ],
        "refs": [
          "https://www.welivesecurity.com/2020/06/18/digging-up-invisimole-hidden-arsenal/"
        ]
      },
      "uuid": "72753a28-b6e0-11ea-b3de-0242ac130004",
      "value": "OSRS Backdoor: RC2FM Backdoor"
    },
	{
      "description": "While analyzing an attack against a Middle Eastern telecommunications organization, researchers discovered a variant of an OilRig-associated tool researchers call RDAT using a novel email-based command and control (C2) channel that relied on a technique known as steganography to hide commands and data within bitmap images attached to emails.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Backdoor"
        ],
        "refs": [
          "https://unit42.paloaltonetworks.com/oilrig-novel-c2-channel-steganography/"
        ]
      },
      "uuid": "9553447a-d32f-11ea-87d0-0242ac130003",
      "value": "OSRS Backdoor: RDAT Backdoor"
    },
	{
      "description": "The APT-C-43 organization is good at launching attacks using phishing emails, and deploys the backdoor program Pyark (Machete) written in python after invading the victim’s machine. The network communication mainly relies on FTP and HTTP protocols. After successfully infiltrating the target machine, APT-C-43 organization monitors the target users, steal sensitive data, etc.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Backdoor"
        ],
        "refs": [
          "https://blog.360totalsecurity.com/en/apt-c-43-steals-venezuelan-military-secrets-to-provide-intelligence-support-for-the-reactionaries-hpreact-campaign/"
        ],
        "synonyms": [
        "Machete (Backdoor)"
        ]
      },
      "uuid": "2dd62cd4-031f-11eb-adc1-0242ac120002",
      "value": "OSRS Backdoor: Pyark Backdoor"
    },
	{
      "description": "The malware runs when a loader loads a DLL file. JPCERT/CC has confirmed that the DLL file is encoded in some samples (which requires decoding by the loader before execution). BLINDINGCAN shares some features with the aforementioned malware including its function and communication encoding algorithm. The following sections will explain its configuration and communication protocol. The configuration of BLINDINGCAN is stored in one of the following locations hardcoded in the malware itself, stored in a registry entry, or saved as a file.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Backdoor"
        ],
        "refs": [
          "https://blogs.jpcert.or.jp/en/2020/09/BLINDINGCAN.html"
        ]
      },
      "uuid": "3345b100-089a-11eb-adc1-0242ac120002",
      "value": "OSRS Backdoor: BLINDINGCAN Backdoor"
    },
	{
      "description": "HyperStack, first observed in 2018, is one of several RPC backdoors Turla uses. HyperStack uses named pipes to execute remote procedure calls (RPC) from the controller to the device hosting the HyperStack client. To move laterally, the implant tries to connect to another remote device’s IPC share, either using a null session or default credentials. IPC is a share that facilitates inter-process communication (IPC) by exposing named pipes to write to or read from. If the implant’s connection to the IPC is successful, the implant can forward RPC commands from the controller to the remote device, and likely has the capability to copy itself onto the remote device.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Backdoor"
        ],
        "refs": [
          "https://www.accenture.com/us-en/blogs/cyber-defense/turla-belugasturgeon-compromises-government-entity"
        ]
      },
      "uuid": "b69c50a4-1e9d-11eb-adc1-0242ac120002",
      "value": "OSRS Backdoor: HyperStack Backdoor"
    },
	{
      "description": "The agfSpy backdoor retrieves configuration and commands from its C&C server. These commands allow the backdoor to execute shell commands and send the execution results back to the server. It also enumerates directories and can list, upload, download, and execute files, among other functions. The capabilities of agfSpy are very similar to dneSpy, except each backdoor uses a different C&C server and various formats in message exchanges.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Backdoor"
        ],
        "refs": [
          "https://www.trendmicro.com/en_us/research/20/j/operation-earth-kitsune-a-dance-of-two-new-backdoors.html"
        ]
      },
      "uuid": "b69c5324-1e9d-11eb-adc1-0242ac120002",
      "value": "OSRS Backdoor: afgSpy Backdoor"
    },
	{
      "description": "DneSpy collects information, takes screenshots, and downloads and executes the latest version of other malicious components in the infected system. The malware is designed to receive a policy file in JSON format with all the commands to execute. The policy file sent by the C&C server can be changed and updated over time, making dneSpy flexible and well-designed. The output of each executed command is zipped, encrypted, and exfiltrated to the C&C server. These characteristics make dneSpy a fully functional espionage backdoor.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Backdoor"
        ],
        "refs": [
          "https://www.trendmicro.com/en_us/research/20/j/operation-earth-kitsune-a-dance-of-two-new-backdoors.html"
        ]
      },
      "uuid": "b69c5630-1e9d-11eb-adc1-0242ac120002",
      "value": "OSRS Backdoor: dneSpy Backdoor"
    },
	{
      "description": "SLAPSTICK is a Solaris PAM backdoor that grants a user access to the system with a secret, hard-coded password.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Backdoor"
        ],
        "refs": [
          "https://www.fireeye.com/blog/threat-research/2020/11/live-off-the-land-an-overview-of-unc1945.html"
        ]
      },
      "uuid": "a0f2528c-2422-11eb-adc1-0242ac120002",
      "value": "OSRS Backdoor: SLAPSTICK Backdoor"
    },
	{
      "description": "LEMONSTICK is a Linux executable command line utility with backdoor capabilities. The backdoor can execute files, transfer files, and tunnel connections.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Backdoor"
        ],
        "refs": [
          "https://www.fireeye.com/blog/threat-research/2020/11/live-off-the-land-an-overview-of-unc1945.html"
        ]
      },
      "uuid": "a0f2557a-2422-11eb-adc1-0242ac120002",
      "value": "OSRS Backdoor: LEMONSTICK Backdoor"
    },
	{
      "description": "Backdoor used by threat group Kimsuky. Able to take screen shots, upload files to C2, list files on system, and execute shell and powershell commands.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Backdoor"
        ],
        "refs": [
          "https://www.cybereason.com/blog/back-to-the-future-inside-the-kimsuky-kgh-spyware-suite"
        ]
      },
      "uuid": "a0f2567e-2422-11eb-adc1-0242ac120002",
      "value": "OSRS Backdoor: KGH Backdoor"
    },
	{
      "description": "Backdoor used by threat group Kimsuky. Able to take screen shots, upload files to C2, list files on system, and execute shell and powershell commands.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Backdoor"
        ],
        "refs": [
          "https://www.cybereason.com/blog/back-to-the-future-inside-the-kimsuky-kgh-spyware-suite",
		  "https://www.virusbulletin.com/uploads/pdf/conference_slides/2019/VB2019-Kim.pdf"
        ]
      },
      "uuid": "a0f25764-2422-11eb-adc1-0242ac120002",
      "value": "OSRS Backdoor: AppleSeed Backdoor"
    },
	{
      "description": "TriFive is a previously unseen PowerShell-based backdoor that the xHunt actors installed on the compromised Exchange server, executing every five minutes via a scheduled task. TriFive provided backdoor access to the Exchange server by logging into a legitimate user’s inbox and obtaining a PowerShell script from an email draft within the deleted emails folder. The TriFive sample used a legitimate account name and credentials from the targeted organization. This suggests that the threat actor had stolen the account’s credentials prior to the installation of the TriFive backdoor.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Backdoor"
        ],
        "refs": [
          "https://unit42.paloaltonetworks.com/xhunt-campaign-backdoors/"
        ]
      },
      "uuid": "736a8fb0-29a3-11eb-adc1-0242ac120002",
      "value": "OSRS Backdoor: TriFive Backdoor"
    },
	{
      "description": "The OfficeIntegrator.ps1 file seen in the ResolutionHosts task is a PowerShell-based backdoor we call Snugy, which allows an actor to obtain the system’s hostname and to run commands. Snugy is a variant of the CASHY200 backdoor used by actors in previous attacks in the xHunt campaign. In July 2019, Trend Micro created a detection signature for this backdoor called Backdoor.PS1.NETERO.A, which suggests that this particular variant of CASHY200 has been around for over a year. We are calling this variant of the backdoor Snugy, as Netero is already a name of a variant of the Hisoka tool used by the xHunt actors.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Backdoor"
        ],
        "refs": [
          "https://unit42.paloaltonetworks.com/xhunt-campaign-backdoors/"
        ]
      },
      "uuid": "736a91e0-29a3-11eb-adc1-0242ac120002",
      "value": "OSRS Backdoor: Snugy Backdoor"
    },
	{
      "description": "Analysis shows that ModPipe uses modular architecture consisting of basic components and downloadable modules. 1. initial dropper – contains both 32-bit and 64-bit binaries of the next stage – the persistent loader – and installs the appropriate version to the compromised machine. 2. persistent loader – unpacks and loads the next stage of the malware, namely the main module. 3. main module – performs the main functionality of the malware. It creates a pipe used for communication with other malicious modules, un/installs these modules and serves as a dispatcher that handles communication between the modules and attacker’s C&C server. 4. networking module – module used for communication with C&C. downloadable modules – components adding specific functionality to the backdoor, such as the ability to steal database passwords and configuration information, scan specific IP addresses or acquire a list of the running processes and their loaded modules.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Backdoor"
        ],
        "refs": [
          "https://www.welivesecurity.com/2020/11/12/hungry-data-modpipe-backdoor-hits-pos-software-hospitality-sector/"
        ]
      },
      "uuid": "736a92d0-29a3-11eb-adc1-0242ac120002",
      "value": "OSRS Backdoor: ModPipe Backdoor"
    },
	{
      "description": "ESET researchers found a previously undocumented backdoor and document stealer. Dubbed Crutch by its developers, we were able to attribute it to the infamous Turla APT group. According to our research, it was used from 2015 to, at least, early 2020. We have seen Crutch on the network of a Ministry of Foreign Affairs in a country of the European Union, suggesting that this malware family is only used against very specific targets as is common for many Turla tools.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Backdoor"
        ],
        "refs": [
          "https://www.welivesecurity.com/2020/12/02/turla-crutch-keeping-back-door-open/"
        ]
      },
      "uuid": "d6562e68-3961-11eb-adc1-0242ac120002",
      "value": "OSRS Backdoor: Crutch Backdoor"
    },
	{
      "description": "PowerPepper is a Windows in-memory PowerShell backdoor that can execute remotely sent shell commands.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Backdoor"
        ],
        "refs": [
          "https://securelist.com/what-did-deathstalker-hide-between-two-ferns/99616/"
        ]
      },
      "uuid": "d6563106-3961-11eb-adc1-0242ac120002",
      "value": "OSRS Backdoor: PowerPepper Backdoor"
    },
	{
      "description": "LuckyBack collects the computer’s fingerprint, at first, and then tries to establish a communication with the C&C server. Once the communication is established, the backdoor starts listening for commands. It is capable of starting a remote shell, file manipulation (move, read, write, execute, get file size), keylogging, and screen capturing.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Backdoor"
        ],
        "refs": [
          "https://decoded.avast.io/luigicamastra/apt-group-targeting-governmental-agencies-in-east-asia/"
        ]
      },
      "uuid": "08439dea-3e10-11eb-b378-0242ac130002",
      "value": "OSRS Backdoor: LuckyBack Backdoor"
    },
	{
      "description": "This backdoor is simpler in terms of commands than the previous one. It accepts just four commands: exit, upload, download, and execute on the command line. Nevertheless, it uses two layers of C&C servers, meaning that the first request is on the first layer, and it yields an IP address of a C&C server from the second layer. Afterwards, the request-response C&C loop uses the second layer. If the backdoor receives a command for the command line, the output from the console is encrypted with AES-256 and sent back to the second-layer C&C server.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Backdoor"
        ],
        "refs": [
          "https://decoded.avast.io/luigicamastra/apt-group-targeting-governmental-agencies-in-east-asia/"
        ]
      },
      "uuid": "0843a29a-3e10-11eb-b378-0242ac130002",
      "value": "OSRS Backdoor: BlueTraveller Backdoor"
    },
	{
      "description": "Polpo is a backdoor that supports around 15 different commands including information collection and exfiltration, file transfer, and proxy connections.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Backdoor"
        ],
        "refs": [
          "https://decoded.avast.io/luigicamastra/apt-group-targeting-governmental-agencies-in-east-asia/"
        ]
      },
      "uuid": "0843a3a8-3e10-11eb-b378-0242ac130002",
      "value": "OSRS Backdoor: Polpo Backdoor"
    },
	{
      "description": "While looking at the Sunburst backdoor, researchers discovered several features that overlap with a previously identified backdoor known as Kazuar. Kazuar is a .NET backdoor first reported by Palo Alto in 2017. Throughout the years, Kazuar has been under constant development. Its developers have been regularly improving it, switching from one obfuscator to another, changing algorithms and updating features. researchers looked at all versions of Kazuar since 2015, in order to better understand its development timeline. Both Kazuar and Sunburst have implemented a delay between connections to a C2 server, likely designed to make the network activity less obvious. Sunburst uses exactly the same formula to calculate sleeping time, relying on NextDouble to generate a random number. It then calls the sleeping function in a loop. The only difference is that the code is somewhat less complex. Below we compare an extract of the sleeping algorithm found in Kazuar and the code discovered in Sunburst.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Backdoor"
        ],
        "refs": [
          "https://securelist.com/sunburst-backdoor-kazuar/99981/"
        ]
      },
      "uuid": "0c005fdc-567e-11eb-ae93-0242ac130002",
      "value": "OSRS Backdoor: Sunburst Backdoor"
    },
	{
      "description": "Raindrop is similar to Teardrop in that both pieces of malware act as a loader for Cobalt Strike Beacon. Raindrop uses a custom packer to pack Cobalt Strike. This packer is different to the one used by Teardrop. Raindrop is compiled as a DLL, which is built from a modified version of 7-Zip source code. The 7-Zip code is not utilized and is designed to hide malicious functionality added by the attackers.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Backdoor"
        ],
        "refs": [
          "https://symantec-enterprise-blogs.security.com/blogs/threat-intelligence/solarwinds-raindrop-malware"
        ]
      },
      "uuid": "71e39580-5b33-11eb-ae93-0242ac130002",
      "value": "OSRS Backdoor: Raindrop Backdoor"
    },
	{
      "description": "ESET researchers have analyzed malware that has been targeting high performance computing (HPC) clusters, among other high-profile targets. We reverse engineered this small, yet complex, malware that is portable to many operating systems including Linux, BSD, Solaris, and possibly AIX and Windows. We have named this malware Kobalos for its tiny code size and many tricks. In Greek mythology, a Kobalos is a small, mischievous creature. Kobalos is a generic backdoor in the sense that it contains broad commands that don’t reveal the intent of the attackers. In short, Kobalos grants remote access to the file system, provides the ability to spawn terminal sessions, and allows proxying connections to other Kobalos-infected servers.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Backdoor"
        ],
        "refs": [
          "https://www.welivesecurity.com/2021/02/02/kobalos-complex-linux-threat-high-performance-computing-infrastructure/"
        ]
      },
      "uuid": "9d9845b0-6626-11eb-ae93-0242ac130002",
      "value": "OSRS Backdoor: Kobalos Backdoor"
    },
	{
      "description": "SolarMarker backdoor features a multistage, heavily obfuscated PowerShell loader, which leads to a .NET compiled backdoor being executed.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Backdoor"
        ],
        "refs": [
          "https://www.crowdstrike.com/blog/solarmarker-backdoor-technical-analysis/"
        ]
      },
      "uuid": "c8074cb4-6bae-11eb-9439-0242ac130002",
      "value": "OSRS Backdoor: SolarMarker Backdoor"
    },
	{
      "description": "Tonnerre is a new step in the evolution of Infy, and contained various functionality absent from Foudre alone. Tonnerre is used to expand the functionality of Foudre possibly its functionality was put into a separate component to make sure it is deployed only when needed, and meets fewer prying eyes. Like Foudre, it is written in Delphi.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Backdoor"
        ],
        "refs": [
          "https://research.checkpoint.com/2021/after-lightning-comes-thunder/"
        ]
      },
      "uuid": "c8075132-6bae-11eb-9439-0242ac130002",
      "value": "OSRS Backdoor: Tonnerre Backdoor"
    },
	{
      "description": "A backdoor persistent module of Nishang Framework. Nishang is an open-source PowerShell-based framework for offensive security, penetration testing, and red teaming.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Backdoor"
        ],
        "refs": [
          "https://resources.malwarebytes.com/files/2021/02/LazyScripter.pdf"
        ]
      },
      "uuid": "a0165c4e-7cf3-11eb-9439-0242ac130002",
      "value": "OSRS Backdoor: ADS-Backdoor"
    },
	{
      "description": "WINDARC is a backdoor that hijacks the execution of TeamViewer to perform C2 communication. It supports plugins and accepts several backdoor commands. The commands include interacting with the TeamViewer tool, starting a reverse shell, loading new plugins, downloading and executing files, and modifying configuration settings.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Backdoor"
        ],
        "refs": [
          "https://www.fireeye.com/blog/threat-research/2021/02/melting-unc2198-icedid-to-ransomware-operations.html"
        ]
      },
      "uuid": "a0165f00-7cf3-11eb-9439-0242ac130002",
      "value": "OSRS Backdoor: WINDARC Backdoor"
    },
	{
      "description": "Written in Go, GoldMax acts as command-and-control backdoor for the actor. It uses several different techniques to obfuscate its actions and evade detection. The malware writes an encrypted configuration file to disk, where the file name and AES-256 cipher keys are unique per implant and based on environmental variables and information about the network where it is running.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Backdoor"
        ],
        "refs": [
          "https://www.microsoft.com/security/blog/2021/03/04/goldmax-goldfinder-sibot-analyzing-nobelium-malware/"
        ]
      },
      "uuid": "f3152f3c-826c-11eb-8dcd-0242ac130003",
      "value": "OSRS Backdoor: GoldMax Backdoor"
    },
	{
      "description": "SUNSHUTTLE is written in GO, and reads an embedded or local configuration file, communicates with a hard-coded command and control (C2) server over HTTPS, and supports commands including remotely uploading its configuration, file upload and download, and arbitrary command execution. Notably, SUNSHUTTLE uses cookie headers to pass values to the C2, and if configured, can select referrers from a list of popular website URLs to help such network traffic blend in.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Backdoor"
        ],
        "refs": [
          "https://www.fireeye.com/blog/threat-research/2021/03/sunshuttle-second-stage-backdoor-targeting-us-based-entity.html"
        ]
      },
      "uuid": "f3153162-826c-11eb-8dcd-0242ac130003",
      "value": "OSRS Backdoor: SUNSHUTTLE Backdoor"
    },
	{
      "description": "We have discovered an undocumented backdoor targeting Linux systems, masqueraded as polkit daemon. We named it RedXOR for its network data encoding scheme based on XOR. Based on victimology, as well as similar components and Tactics, Techniques, and Procedures (TTPs), we believe RedXOR was developed by high profile Chinese threat actors. The samples, which have low detection rates in VirusTotal, were uploaded from Indonesia and Taiwan, countries known to be targeted by Chinese threat actors. The samples are compiled with a legacy GCC compiler on an old release of Red Hat Enterprise Linux, hinting that RedXOR is used in targeted attacks against legacy Linux systems.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Backdoor"
        ],
        "refs": [
          "https://www.intezer.com/blog/malware-analysis/new-linux-backdoor-redxor-likely-operated-by-chinese-nation-state-actor/"
        ]
      },
      "uuid": "f70c24ec-8582-11eb-8dcd-0242ac130003",
      "value": "OSRS Backdoor: RedXOR Backdoor"
    },
	{
      "description": "Used in conjunction with RedXOR backdoor. RedXOR uses Python pty shell by importing the python pty library. PWNLNX implements the pty shell function in c.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Backdoor"
        ],
        "refs": [
          "https://www.intezer.com/blog/malware-analysis/new-linux-backdoor-redxor-likely-operated-by-chinese-nation-state-actor/"
        ]
      },
      "uuid": "f70c27d0-8582-11eb-8dcd-0242ac130003",
      "value": "OSRS Backdoor: PWNLNX Backdoor"
    },
	{
      "description": "On execution, the customized EggShell binaries drop a LaunchAgent. This plist checks to see if the original executable is running, if not, it creates a copy of the executable from a master version then executes it. The EggShell also drops a zero byte file and a data file. A number of other filepaths are also encrypted in the binaries. Almost all of these paths have been customized by the attacker. However, one encrypted string decrypts, a default path found in the public EggShell repo for storing AV captures.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Backdoor"
        ],
        "refs": [
          "https://labs.sentinelone.com/new-macos-malware-xcodespy-targets-xcode-developers-with-eggshell-backdoor/"
        ]
      },
      "uuid": "bf1cc6de-8b0b-11eb-8dcd-0242ac130003",
      "value": "OSRS Backdoor: EggShell Backdoor"
    },
	{
      "description": "Up until now, we have managed to find three of the multiple components comprising Vyveva – its installer, loader and backdoor. The installer is the earliest chronological stage found and since it expects other components to be already present on the machine, it suggests the existence of an earlier, unknown stage – a dropper. The loader serves to decrypt the backdoor using a simple XOR decryption algorithm.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Backdoor"
        ],
        "refs": [
          "https://www.welivesecurity.com/2021/04/08/are-you-afreight-dark-watch-out-vyveva-new-lazarus-backdoor/"
        ]
      },
      "uuid": "2f858952-9c68-11eb-a8b3-0242ac130003",
      "value": "OSRS Backdoor: Vyveva Backdoor"
    },
	{
      "description": "Backdoor similar to the CommsCacher backdoor, a legitimate SQLite DLL with a malicious sqlite3_create_functionex exported.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Backdoor"
        ],
        "refs": [
          "https://www.ptsecurity.com/ww-en/analytics/pt-esc-threat-intelligence/lazarus-recruitment/"
        ]
      },
      "uuid": "86c396cc-a9ca-11eb-bcbc-0242ac130002",
      "value": "OSRS Backdoor: ApplicationCacher Backdoor"
    },
	{
      "description": "RotaJakiro pays quite some attention to hide its trails, using multiple of encryption algorithms, including the use of AES algorithm to encrypt the resource information within the sample, C2 communication using a combination of AES, XOR, ROTATE encryption and ZLIB compression. RotaJakiro supports a total of 12 functions, three of which are related to the execution of specific Plugins. Unfortunately, we have no visibilityto the plugins, and therefore do not know its true purpose. From a broad backdoor perspective, the functions can be grouped into the following four categories.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Backdoor"
        ],
        "refs": [
          "https://blog.netlab.360.com/stealth_rotajakiro_backdoor_en/"
        ]
      },
      "uuid": "86c398de-a9ca-11eb-bcbc-0242ac130002",
      "value": "OSRS Backdoor: RotaJakiro Backdoor"
    },
	{
      "description": "Nebulae is used as a measure of precaution to not lose the persistence in case any signs of infections gets detected.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Backdoor"
        ],
        "refs": [
          "https://labs.bitdefender.com/2021/04/new-nebulae-backdoor-linked-with-the-naikon-group/",
		  "https://www.bitdefender.com/files/News/CaseStudies/study/396/Bitdefender-PR-Whitepaper-NAIKON-creat5397-en-EN.pdf"
        ]
      },
      "uuid": "86c399c4-a9ca-11eb-bcbc-0242ac130002",
      "value": "OSRS Backdoor: Nebulae Backdoor"
    },
	{
      "description": "The Cybereason Nocturnus Team has been tracking recent developments in the RoyalRoad weaponizer, also known as the 8.t Dropper RTF exploit builder. Over the years, this tool has become a part of the arsenal of several Chinese-related threat actors such as Tick, Tonto Team and TA428, all of which  employ RoyalRoad regularly for spear-phishing in targeted attacks against high-value targets. While analyzing newly discovered RoyalRoad samples observed in-the-wild, the Nocturnus Team detected one that not only exhibits anomalous characteristics, but also delivers PortDoor malware, a previously undocumented backdoor assessed to have been developed by a threat actor likely operating on behalf of Chinese state-sponsored interests. According to the phishing lure content examined, the target of the attack was a general director working at the Rubin Design Bureau, a Russian-based defense contractor that designs nuclear submarines for the Russian Federation’s Navy.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Backdoor"
        ],
        "refs": [
          "https://www.cybereason.com/blog/portdoor-new-chinese-apt-backdoor-attack-targets-russian-defense-sector"
        ]
      },
      "uuid": "320d1fc4-ad9c-11eb-8529-0242ac130003",
      "value": "OSRS Backdoor: PortDoor Backdoor"
    },
	{
      "description": "The Cybersecurity and Infrastructure Security Agency (CISA) recently responded to an advanced persistent threat (APT) actor’s long-term compromise of an entity’s enterprise network, which began in at least March 2020. The threat actor connected to the entity’s network via a Pulse Secure virtual private network (VPN) appliance, moved laterally to its SolarWinds Orion server, installed malware referred to by security researchers as SUPERNOVA (a .NET webshell), and collected credentials. (Updated April 29, 2021) Note at this time CISA cannot link this activity to exploitation of CVE-2021-22893 as addressed in AA21-110A. The entity has run the Ivanti Pulse Secure Connect Integrity Tool and found activity consistent with mismatched files. CISA is still investigating the root cause for the mismatched files. SUPERNOVA is a malicious webshell backdoor that allows a remote operator to dynamically inject C# source code into a web portal to subsequently inject code. APT actors use SUPERNOVA to perform reconnaissance, conduct domain mapping, and steal sensitive information and credentials. (Note for more information on SUPERNOVA, refer to Malware Analysis Report MAR-10319053-1.v1 - SUPERNOVA.) According to a SolarWinds advisory, SUPERNOVA is not embedded within the Orion platform as a supply chain attack rather, an attacker places it directly on a system that hosts SolarWinds Orion, and it is designed to appear as part of the SolarWinds product. CISA assesses this is a separate actor than the APT actor responsible for the SolarWinds supply chain compromise described in Alert AA20-352A Advanced Persistent Threat Compromise of Government Agencies, Critical Infrastructure, and Private Sector Organizations. Organizations that find SUPERNOVA on their SolarWinds installations should treat this incident as a separate attack.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Backdoor"
        ],
        "refs": [
          "https://blog.netlab.360.com/stealth_rotajakiro_backdoor_en/"
        ]
      },
      "uuid": "320d2212-ad9c-11eb-8529-0242ac130003",
      "value": "OSRS Backdoor: SUPERNOVA Backdoor"
    },
	{
      "description": "In this post, we analyze a piece of malware that we encountered during a recent breach investigation. What caught our attention was how the malware achieved persistence, how it used ICMP tunneling for its backdoor communications, and how it operated with different modes to increase its chances of a successful attack. Malware using ICMP is not new but is relatively uncommon. Because of this, and the presence of certain strings, we decided to name this malware Pingback. Below we demonstrate how Pingback’s protocols work and also provide sample code on how we interacted with the malware.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Backdoor"
        ],
        "refs": [
          "https://www.trustwave.com/en-us/resources/blogs/spiderlabs-blog/backdoor-at-the-end-of-the-icmp-tunnel/"
        ]
      },
      "uuid": "66aa9574-b3f8-11eb-8529-0242ac130003",
      "value": "OSRS Backdoor: Pingback Backdoor"
    },
	{
      "description": "The observed DOUBLEDROP instances contain a well-designed backdoor implemented as a 32 or 64-bit PE dynamic library which we track as DOUBLEBACK. The backdoor is initially mapped into the same PowerShell process started by the bootstrap script, but it will then inject itself into a msiexec.exe process if certain conditions are met. By design, the core of the backdoor functionality is intended to be executed after injected into a newly spawned msiexec.exe process. In contrast with other backdoors DOUBLEBACK does not have its services hardcoded and the functionality is expected to be implemented as plugins that are expected to be serialized in the registry database under a host-specific registry path. That way, the backdoor can be configured to implement a flexible set of services depending on the target. With all the common functionality implemented as plugins, the backdoor’s main goal is to establish a communication framework ensuring data integrity between the C2 server and the appropriate plugins.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Backdoor"
        ],
        "refs": [
          "https://www.fireeye.com/blog/threat-research/2021/05/unc2529-triple-double-trifecta-phishing-campaign.html"
        ]
      },
      "uuid": "66aa97b8-b3f8-11eb-8529-0242ac130003",
      "value": "OSRS Backdoor: DOUBLEBACK Backdoor"
    },
	{
      "description": "The main implant used by Agrius is IPsec Helper, which is a custom .NET backdoor. The backdoor provides basic functionality like uploading of files from the infected system, running commands, and  deploying  additional  executables.  It  connects  back  to  C2  servers  over  HTTP  based  on  a  configuration file. The tool is run as a service, suggesting it is executed once the threat actor has achieved elevated privileges. What appears to be authentic victim uploads of IPsec Helper samples were submitted to VirusTotal from Israel and the United Arab Emirates.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Backdoor"
        ],
        "refs": [
          "https://assets.sentinelone.com/sentinellabs/evol-agrius"
        ]
      },
      "uuid": "9a17d8fe-bef2-11eb-8529-0242ac130003",
      "value": "OSRS Backdoor: IPsec Helper Backdoor"
    },
	{
      "description": "Facefish consists of 2 parts, Dropper and Rootkit, and its main function is determined by the Rootkit module, which works at the Ring3 layer and is loaded using the LD_PRELOAD feature to steal user login credentials by hooking ssh sshd program related functions, and it also supports some backdoor functions. Therefore, Facefish can be characterized as a backdoor for Linux platform. The main functions of Facefish are Upload device information, Stealing user credentials, Bounce Shell, and Execute arbitrary commands.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Backdoor"
        ],
        "refs": [
          "https://blog.netlab.360.com/ssh_stealer_facefish_en/"
        ]
      },
      "uuid": "35113118-c9e6-11eb-b8bc-0242ac130003",
      "value": "OSRS Backdoor: Facefish Rootkit (Backdoor)"
    },
	{
      "description": "In March 2021, I uncovered the first known malware targeting Windows containers, a development that is not surprising given the massive surge in cloud adoption over the past few years. I named the malware Siloscape (sounds like silo escape) because its primary goal is to escape the container, and in Windows this is implemented mainly by a server silo. Siloscape is heavily obfuscated malware targeting Kubernetes clusters through Windows containers. Its main purpose is to open a backdoor into poorly configured Kubernetes clusters in order to run malicious containers. Compromising an entire cluster is much more severe than compromising an individual container, as a cluster could run multiple cloud applications whereas an individual container usually runs a single cloud application. For example, the attacker might be able to steal critical information such as usernames and passwords, an organization’s confidential and internal files or even entire databases hosted in the cluster. Such an attack could even be leveraged as a ransomware attack by taking the organization's files hostage. Even worse, with organizations moving to the cloud, many use Kubernetes clusters as their development and testing environments, and a breach of such an environment can lead to devastating software supply chain attacks. Siloscape uses the Tor proxy and an .onion domain to anonymously connect to its command and control (C2) server. I managed to gain access to this server. We identified 23 active Siloscape victims and discovered that the server was being used to host 313 users in total, implying that Siloscape was a small part of a broader campaign. I also discovered that this campaign has been taking place for more than a year.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Backdoor"
        ],
        "refs": [
          "https://unit42.paloaltonetworks.com/siloscape/"
        ]
      },
      "uuid": "351134e2-c9e6-11eb-b8bc-0242ac130003",
      "value": "OSRS Backdoor: Siloscape Backdoor"
    },
	{
      "description": "DevilsTongue is a complex modular multi-threaded piece of malware written in C and C++ with several novel capabilities. Analysis is still on-going for some components and capabilities, but we’re sharing our present understanding of the malware so defenders can use this intelligence to protect networks and so other researchers can build on our analysis. For files on disk, PDB paths and PE timestamps are scrubbed, strings and configs are encrypted, and each file has a unique hash. The main functionality resides in DLLs that are encrypted on disk and only decrypted in memory, making detection more difficult. Configuration and tasking data is separate from the malware, which makes analysis harder.  DevilsTongue has both user mode and kernel mode capabilities. There are several novel detection evasion mechanisms built in. All these features are evidence that SOURGUM developers are very professional, have extensive experience writing Windows malware, and have a good understanding of operational security.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Backdoor"
        ],
        "refs": [
          "https://www.microsoft.com/security/blog/2021/07/15/protecting-customers-from-a-private-sector-offensive-actor-using-0-day-exploits-and-devilstongue-malware/"
        ]
      },
      "uuid": "48d2bfa2-ee1a-11eb-9a03-0242ac130003",
      "value": "OSRS Backdoor: DevilsTongue Backdoor"
    },
	{
      "description": "During our analysis of a Mespinoza ransomware incident, we observed the threat actors installing a backdoor written in the Go language on the system prior to the distribution of the ransomware. According to a report published by France’s National Agency for the Security of Information Systems (ANSSI), ANSSI also observed threat actors delivering the Mespinoza ransomware using a payload written in Go. We analyzed the Go sample mentioned in the ANSSI report and found that it was an earlier and an unobfuscated version of the same tool we observed in our case. The developers of Gasket wrote this backdoor in Golang and used the open-source Gobfuscate tool to obfuscate the payload. We call this tool Gasket, as the variant of this tool mentioned in the ANSSI report designated as version 001, which had the following two functions that it called to carry out its command and control (c2) communications. We believe that the actors use this backdoor as a backup to RDP to maintain access to the network.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Backdoor"
        ],
        "refs": [
          "https://unit42.paloaltonetworks.com/gasket-and-magicsocks-tools-install-mespinoza-ransomware/"
        ]
      },
      "uuid": "48d2c1dc-ee1a-11eb-9a03-0242ac130003",
      "value": "OSRS Backdoor: Gasket Backdoor"
    },
	{
      "description": "The backdoor is controlled through the admin panel. After the user visits the infected site, Prometheus.Backdoor collects basic information about them - IP address, User-Agent, Referrer header, time zone, and language data, and then forwards this information to the Prometheus admin panel.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Backdoor"
        ],
        "refs": [
          "https://blog.group-ib.com/prometheus-tds"
        ]
      },
      "uuid": "d99e658c-fb6b-11eb-9a03-0242ac130003",
      "value": "OSRS Backdoor: Prometheus.Backdoor"
    },
	{
      "description": "The SideWalk backdoor is ChaCha20-encrypted shellcode that is loaded from disk by SparklingGoblin’s InstallUtil-based .NET loaders.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Backdoor"
        ],
        "refs": [
          "https://www.welivesecurity.com/2021/08/24/sidewalk-may-be-as-dangerous-as-crosswalk/"
        ]
      },
      "uuid": "442213a8-0b2b-11ec-9a03-0242ac130003",
      "value": "OSRS Backdoor: SideWalk Backdoor"
    },
	{
      "description": "Sardonic is a new backdoor in the FIN8 ecosystem. Sardonic is a project still under development and includes several components. The new components were identified in a real-life attack and seems to be compiled just before the attack. Sardonic backdoor is extremely potent and has a wide range of capabilities that help the threat actor leverage. new malware on the fly without updating components.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Backdoor"
        ],
        "refs": [
          "https://www.bitdefender.com/files/News/CaseStudies/study/401/Bitdefender-PR-Whitepaper-FIN8-creat5619-en-EN.pdf"
        ]
      },
      "uuid": "442214a2-0b2b-11ec-9a03-0242ac130003",
      "value": "OSRS Backdoor: Sardonic Backdoor"
    },
	{
      "description": "The DirtyMoe malware uses a driver signed with a revoked certificate that can be seamlessly loaded into the Windows kernel. Therefore, one of the goals is to analyze how Windows works with a code signature of Windows drivers. Similarly, we will be also interested in the code signature verification of user-mode applications since the user account control (UAC) does not block the application execution even if this one is also signed with a revoked certificate. The second goal is a statistical analysis of certificates that sign the DirtyMoe driver because the certificates are also used to sign other malicious software. We focus on the determination of the certificate’s origin, prevalence, and a quick analysis of the top 10 software signed with these certificates.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Backdoor"
        ],
        "refs": [
          "https://decoded.avast.io/martinchlumecky/dirtymoe-3/"
        ]
      },
      "uuid": "4e42c9f8-1c70-11ec-9621-0242ac130002",
      "value": "OSRS Backdoor: DirtyMoe Backdoor"
    },
	{
      "description": "Cisco Talos recently discovered a new backdoor used by the Russian Turla APT group. We have seen infections in the U.S., Germany and, more recently, in Afghanistan. It is likely used as a stealth second-chance backdoor to keep access to infected devices It can be used to download, upload and (or) execute files. The backdoor code is quite simple but is efficient enough that it will usually fly under the radar.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Backdoor"
        ],
        "refs": [
          "https://blog.talosintelligence.com/2021/09/tinyturla.html"
        ]
      },
      "uuid": "bcf12e1a-2609-11ec-9621-0242ac130002",
      "value": "OSRS Backdoor: Tiny Turla Backdoor"
    },
	{
      "description": "FoggyWeb is a passive and highly targeted backdoor capable of remotely exfiltrating sensitive information from a compromised AD FS server. It can also receive additional malicious components from a command-and-control (C2) server and execute them on the compromised server.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Backdoor"
        ],
        "refs": [
          "https://www.microsoft.com/security/blog/2021/09/27/foggyweb-targeted-nobelium-malware-leads-to-persistent-backdoor/"
        ]
      },
      "uuid": "bcf13054-2609-11ec-9621-0242ac130002",
      "value": "OSRS Backdoor: FoggyWeb Backdoor"
    },
	{
      "description": "Backdoor sometimes used in conjunction with njRAT.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Backdoor"
        ],
        "refs": [
          "https://asec.ahnlab.com/ko/27360/"
        ]
      },
      "uuid": "bcf1313a-2609-11ec-9621-0242ac130002",
      "value": "OSRS Backdoor: Korat Backdoor"
    },
	{
      "description": "A native IIS module that is registered as a filter through which HTTP requests and responses are processed. The file has two entry points - the main one, which does not have any set of functions, and the second one—RegisterModule, which is required for registering the native module—it initializes an instance of the DoorMe class. The name alludes to backdoor functionality.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Backdoor"
        ],
        "refs": [
          "https://www.ptsecurity.com/ww-en/analytics/pt-esc-threat-intelligence/new-apt-group-chamelgang/#id3-3"
        ]
      },
      "uuid": "bcf131f8-2609-11ec-9621-0242ac130002",
      "value": "OSRS Backdoor: DoorMe Backdoor"
    },
	{
      "description": "Tomiris is a backdoor written in Go whose role is to continuously query its C2 server for executables to download and execute on the victim system. Before performing any operations, it sleeps for at least nine minutes in a possible attempt to defeat sandbox-based analysis systems. It establishes persistence with scheduled tasks by creating and running a batch file.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Backdoor"
        ],
        "refs": [
          "https://securelist.com/darkhalo-after-solarwinds-the-tomiris-connection/104311/"
        ]
      },
      "uuid": "bcf132b6-2609-11ec-9621-0242ac130002",
      "value": "OSRS Backdoor: Tomiris Backdoor"
    },
	{
      "description": "A custom backdoor that uses Microsoft infrastructure for its C&C activity.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Backdoor"
        ],
        "refs": [
          "https://symantec-enterprise-blogs.security.com/blogs/threat-intelligence/harvester-new-apt-attacks-asia"
        ]
      },
      "uuid": "5844392e-31af-11ec-8d3d-0242ac130003",
      "value": "OSRS Backdoor: Graphon Backdoor"
    },
	{
      "description": "Following initial exploitation, a payload was uploaded to the victim network which installed a Godzilla webshell. This activity was consistent across all victims; however, we also observed a smaller subset of compromised organizations who subsequently received a modified version of a new backdoor called NGLite. The threat actors then used either the webshell or the NGLite payload to run commands and move laterally to other systems on the network, while they exfiltrated files of interest simply by downloading them from the web server. Once the actors pivoted to a domain controller, they installed a new credential-stealing tool that we track as KdcSponge. Both Godzilla and NGLite were developed with Chinese instructions and are publicly available for download on GitHub. We believe threat actors deployed these tools in combination as a form of redundancy to maintain access to high-interest networks. Godzilla is a functionality-rich webshell that parses inbound HTTP POST requests, decrypts the data with a secret key, executes decrypted content to carry out additional functionality and returns the result via a HTTP response. This allows attackers to keep code likely to be flagged as malicious off the target system until they are ready to dynamically execute it.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Backdoor"
        ],
        "refs": [
          "https://unit42.paloaltonetworks.com/manageengine-godzilla-nglite-kdcsponge/"
        ]
      },
      "uuid": "6f32076c-46ed-11ec-81d3-0242ac130003",
      "value": "OSRS Backdoor: NGLite Backdoor"
    },
	{
      "description": "Last week, Google’s Threat Analysis Group published details around what appears to be APT activity targeting, among others, Mac users visiting Hong Kong websites supporting pro-democracy activism. Google’s report focused on the use of two vulnerabilities a zero day and a N-day (a known vulnerability with an available patch). By the time of Google’s publication both had, in fact, been patched for some months. What received less attention was the malware that the vulnerabilities were leveraged to drop a backdoor that works just fine even on the latest patched systems of macOS Monterey. Google labelled the backdoor Macma, and we will follow suit. Shortly after Google’s publication, a rapid triage of the backdoor was published by Objective-See (under the name OSX.CDDS). In this post, we take a deeper dive into macOS.Macma, reveal further IoCs to aid defenders and threat hunters, and speculate on some of macOS.Macma’s (hitherto-unmentioned) interesting artifacts.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Backdoor"
        ],
        "refs": [
          "https://www.sentinelone.com/labs/infect-if-needed-a-deeper-dive-into-targeted-backdoor-macos-macma/"
        ]
      },
      "uuid": "89a18276-521e-11ec-bf63-0242ac130002",
      "value": "OSRS Backdoor: macOS.Macma Backdoor"
    },
	{
      "description": "MagnatBackdoor is an AutoIt-based installer that prepares a system for remote Microsoft Remote Desktop access and forwards the RDP service port on an outbound SSH tunnel. As a result of this installer's actions there is a way for the attacker to access the system remotely via RDP, which is why we call it a backdoor. This malware applies this technique by setting up a scheduled task that periodically contacts a C2 server and sets up the tunnel if instructed by the C2 response.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Backdoor"
        ],
        "refs": [
          "https://blog.talosintelligence.com/2021/12/magnat-campaigns-use-malvertising-to.html"
        ]
      },
      "uuid": "21d689fe-5910-11ec-bf63-0242ac130002",
      "value": "OSRS Backdoor: MagnatBackdoor"
    },
	{
      "description": "Compared to the original Cerberus, ERMAC uses different encryption scheme in communication with the C2, the data is encrypted with AES-128-CBC, and prepended with double word containing the length of the encoded data.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Backdoor"
        ],
        "refs": [
          "https://www.threatfabric.com/blogs/deceive-the-heavens-to-cross-the-sea.html",
		  "https://www.threatfabric.com/blogs/ermac-another-cerberus-reborn.html"
        ]
      },
      "uuid": "21d68c4c-5910-11ec-bf63-0242ac130002",
      "value": "OSRS Backdoor: Ermac Backdoor"
    },
	{
      "description": "This malware family was active mainly in Mexico until the beginning of 2020. We were able to identify additional builds, each dedicated to target a different country – Brazil, Chile and Colombia. The most identifying feature of Lokorrito is its usage of a custom User-Agent string in network communication. We have observed two values – LA CONCHA DE TU MADRE and 4RR0B4R 4 X0T4 D4 TU4 M4E, both quite vulgar expressions in Spanish and Portuguese, respectively.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Backdoor"
        ],
        "refs": [
          "https://www.welivesecurity.com/2021/12/15/dirty-dozen-latin-america-amavaldo-zumanek/"
        ]
      },
      "uuid": "57229a46-7add-11ec-90d6-0242ac120003",
      "value": "OSRS Backdoor: Lokorrito Backdoor"
    },
	{
      "description": "Malware targeting multiple operating systems has become no exception in the malware threat landscape. Vermilion Strike, which was documented just last September, is among the latest examples until now. In December 2021, we discovered a new multi-platform backdoor that targets Windows, Mac, and Linux. The Linux and Mac versions are fully undetected in VirusTotal. We named this backdoor SysJoker. SysJoker was first discovered during an active attack on a Linux-based web server of a leading educational institution. After further investigation, we found that SysJoker also has Mach-O and Windows PE versions. Based on Command and Control (C2) domain registration and samples found in VirusTotal, we estimate that the SysJoker attack was initiated during the second half of 2021. SysJoker masquerades as a system update and generates its C2 by decoding a string retrieved from a text file hosted on Google Drive. During our analysis the C2 changed three times, indicating the attacker is active and monitoring for infected machines. Based on victimology and malware’s behavior, we assess that SysJoker is after specific targets.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Backdoor"
        ],
        "refs": [
          "https://www.intezer.com/blog/malware-analysis/new-backdoor-sysjoker/"
        ]
      },
      "uuid": "57229e1a-7add-11ec-90d6-0242ac120003",
      "value": "OSRS Backdoor: SysJoker Backdoor"
    },
	{
      "description": "With the emergence of the Log4j security vulnerability, we’ve already seen multiple threat actors, mostly financially motivated, immediately add it to their exploitation arsenal. It comes as no surprise that some nation-sponsored actors also saw this new vulnerability as an opportunity to strike before potential targets have identified and patched the affected systems. APT35 (aka Charming Kitten, TA453, or Phosphorus), which is suspected to be an Iranian nation-state actor, started widespread scanning and attempts to leverage Log4j flaw in publicly facing systems only four days after the vulnerability was disclosed. The actor’s attack setup was obviously rushed, as they used the basic open-source tool for the exploitation and based their operations on previous infrastructure, which made the attack easier to detect and attribute. In this article, we share the details of the latest attacks by APT35 exploiting the Log4j vulnerability and analyze their post-exploitation activities including the new modular PowerShell-based framework dubbed CharmPower, used to establish persistence, gather information, and execute commands.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Backdoor"
        ],
        "refs": [
          "https://research.checkpoint.com/2022/apt35-exploits-log4j-vulnerability-to-distribute-new-modular-powershell-toolkit/"
        ]
      },
      "uuid": "5722a1f8-7add-11ec-90d6-0242ac120003",
      "value": "OSRS Backdoor: CharmPower Backdoor"
    },
	{
      "description": "Backdoor attributed to the Molerats APT.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Backdoor"
        ],
        "refs": [
          "https://www.zscaler.com/blogs/security-research/new-espionage-attack-molerats-apt-targeting-users-middle-east"
        ]
      },
      "uuid": "80b6adfc-7f6f-11ec-a8a3-0242ac120002",
      "value": "OSRS Backdoor: Spark Backdoor"
    },
	{
      "description": "DazzleSpy is a full-featured backdoor that provides attackers a large set of functionalities to control, and exfiltrate files from, a compromised computer. Our sample is a Mach-O binary file compiled for x86_64 CPU architecture.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Backdoor"
        ],
        "refs": [
          "https://www.welivesecurity.com/2022/01/25/watering-hole-deploys-new-macos-malware-dazzlespy-asia/"
        ]
      },
      "uuid": "46fa2aa6-82aa-11ec-a8a3-0242ac120002",
      "value": "OSRS Backdoor: DazzleSpy Backdoor"
    },
	{
      "description": "The main custom backdoor used by Antlion in this campaign was the xPack backdoor, which is a custom .NET loader that decrypts (AES), loads, and executes accompanying .bin files. Its decryption password is provided as a command-line argument (Base64 encoded string), and xPack is intended to be run as a standalone application or as a service (xPackSvc variant). The xPack malware and its associated payload seems to be used for initial access it appears that xPack was predominantly used to execute system commands, drop subsequent malware and tools, and stage data for exfiltration. The attackers also used a custom keylogger and three custom loaders.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Backdoor"
        ],
        "refs": [
          "https://symantec-enterprise-blogs.security.com/blogs/threat-intelligence/china-apt-antlion-taiwan-financial-attacks"
        ]
      },
      "uuid": "4984e0ae-9006-11ec-b909-0242ac120002",
      "value": "OSRS Backdoor: xPack Backdoor"
    },
	{
      "description": "A custom backdoor, SockDetour is designed to serve as a backup backdoor in case the primary one is removed. It is difficult to detect, since it operates filelessly and socketlessly on compromised Windows servers. One of the command and control (C2) infrastructures that the threat actor used for malware distribution for the TiltedTemple campaign hosted SockDetour along with other miscellaneous tools such as a memory dumping tool and several webshells. We are tracking SockDetour as one campaign within TiltedTemple, but cannot yet say definitively whether the activities stem from a single or multiple threat actors.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Backdoor"
        ],
        "refs": [
          "https://unit42.paloaltonetworks.com/sockdetour/"
        ]
      },
      "uuid": "7b33adbc-9a4f-11ec-b909-0242ac120002",
      "value": "OSRS Backdoor: SockDetour Backdoor"
    },
	{
      "description": "Small Sieve provides basic functionality required to maintain and expand a foothold in victim infrastructure and avoid detection  by using custom string and traffic obfuscation schemes together with the Telegram Bot application programming interface (API). Specifically, Small Sieve’s beacons and taskings are performed using Telegram API over Hypertext Transfer Protocol Secure (HTTPS) , and the tasking and beaconing data is obfuscated through a hex byte swapping encoding scheme combined with an obfuscated Base64 function.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Backdoor"
        ],
        "refs": [
          "https://www.cisa.gov/uscert/ncas/alerts/aa22-055a"
        ]
      },
      "uuid": "7b33b186-9a4f-11ec-b909-0242ac120002",
      "value": "OSRS Backdoor: Small Sieve Backdoor"
    },
	{
      "description": "GRAMDOOR is a backdoor written in Python that uses the Telegram Bot API to communicate over HTTP with the Telegram server. Supported commands include command execution via cmd.exe.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Backdoor"
        ],
        "refs": [
          "https://www.mandiant.com/resources/telegram-malware-iranian-espionage"
        ]
      },
      "uuid": "7b33b3b6-9a4f-11ec-b909-0242ac120002",
      "value": "OSRS Backdoor: GRAMDOOR Backdoor"
    },
	{
      "description": "Daxin comes in the form of a Windows kernel driver, a relatively rare format for malware nowadays. It implements advanced communications functionality, which both provides a high degree of stealth and permits the attackers to communicate with infected computers on highly secured networks, where direct internet connectivity is not available. These features are reminiscent of Regin, an advanced espionage tool discovered by Symantec in 2014 that others have linked to Western intelligence services.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Backdoor"
        ],
        "refs": [
          "https://symantec-enterprise-blogs.security.com/blogs/threat-intelligence/daxin-backdoor-espionage"
        ]
      },
      "uuid": "c71bb3c8-9f18-11ec-b909-0242ac120002",
      "value": "OSRS Backdoor: Daxin Backdoor"
    },
	{
      "description": "The most recent APT41 campaign began shortly after the release of CVE-2021-44228 and its related proof-of-concept exploits in December 2021. Exploiting this vulnerability, also known as Log4Shell, causes Java to fetch and deserialize a remote Java object, resulting in potential code execution. Similar to their previous web application targeting, APT41 continued to use YSoSerial generated deserialization payloads to perform reconnaissance and deploy backdoors. Notably, APT41 deployed a new variant of the KEYPLUG backdoor on Linux servers at multiple victims, a malware sub-family we now track as KEYPLUG.LINUX. KEYPLUG is a modular backdoor written in C++ that supports multiple network protocols for command and control (C2) traffic including HTTP, TCP, KCP over UDP, and WSS. APT41 heavily used the Windows version of the KEYPLUG backdoor at state government victims between June 2021 and December 2021, thus the deployment of a ported version of the backdoor closely following the state government campaign was significant.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Backdoor"
        ],
        "refs": [
          "https://www.mandiant.com/resources/apt41-us-state-governments"
        ]
      },
      "uuid": "47506f98-a5fe-11ec-b909-0242ac120002",
      "value": "OSRS Backdoor: KEYPLUG Backdoor"
    },
	{
      "description": "The dropper.exe file will load, base64-decode, save to disk, and execute the java-sdk.exe file. The latter, in addition to ensuring consistency through the Windows registry, will also download, base64-decode, save to disk and run two other files -  microsoft-cortana.exe, classified as GraphSteel backdoor, and oracle-java.exe, which classified as GrimPlant backdoor.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Backdoor"
        ],
        "refs": [
          "https://cert.gov.ua/article/37704"
        ]
      },
      "uuid": "4750720e-a5fe-11ec-b909-0242ac120002",
      "value": "OSRS Backdoor: GrimPlant Backdoor"
    },
	{
      "description": "The dropper.exe file will load, base64-decode, save to disk, and execute the java-sdk.exe file. The latter, in addition to ensuring consistency through the Windows registry, will also download, base64-decode, save to disk and run two other files -  microsoft-cortana.exe, classified as GraphSteel backdoor, and oracle-java.exe, which classified as GrimPlant backdoor.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Backdoor"
        ],
        "refs": [
          "https://cert.gov.ua/article/37704"
        ]
      },
      "uuid": "47507344-a5fe-11ec-b909-0242ac120002",
      "value": "OSRS Backdoor: GraphSteel Backdoor"
    },
	{
      "description": "Since it first emerged in 2015, Asruex has been known for its backdoor capabilities and connection to the spyware DarkHotel. However, when we encountered Asruex in a PDF file, we found that a variant of the malware can also act as an infector particularly through the use of old vulnerabilities CVE-2012-0158 and CVE-2010-2883, which inject code in Word and PDF files respectively. The use of old, patched vulnerabilities could hint that the most recent variant was devised knowing that it can affect targets who have been using older versions of Adobe Reader (versions 9.x up to before 9.4) and Acrobat (versions 8.x up to before 8.2.5) on Windows and Mac OS X.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Backdoor"
        ],
        "refs": [
          "https://blog.trendmicro.com/trendlabs-security-intelligence/asruex-backdoor-variant-infects-word-documents-and-pdfs-through-old-ms-office-and-adobe-vulnerabilities/"
        ]
      },
      "uuid": "a7c34aa4-41d7-11ea-b77f-2e728ce88125",
      "value": "OSRS Backdoor: Asruex"
    }
	  ],
	"version": 17
}
