{
  "category": "OSRS-BACKDOORS",
  "description": "Cluster designed for tagging OSINT artifacts that relate to OSRS artifacts that describe malicious backdoors.",
  "name": "OSRS Backdoor",
  "source": "OSRS DEV",
  "type": "CMCF-BLOCK-OSRS",
  "uuid": "deb05256-49bf-11ea-b77f-2e728ce88125",
  "values": [
	{
      "description": "A backdoor that can be used on linux and windows systems. Both instances of this malware are practically identical in terms of overall functionality, with minor implementation differences. Both malware instances share the same protocol to communicate with the same CNC server. However, these instances have different delivery vectors. The windows instance has been observed being delivered by the Fallout Exploit Kit. The main function is not obfuscated and appears to be straightforward in logic. In the Windows variant we can see how some strings are decoded in the beginning of the function. After initial string decoding the malware serializes the victim by collecting architecture, system, and MAC address information. The way the Windows variant collects this information is by calling the correspondent Windows API functions in order to retrieve the subject information such as IsWow64Process. The Linux variant, on the other hand, uses a different technique that mainly relies on uname system call to retrieve architecture and system information, in addition to a combination of socket as well as ioctl system calls to retrieve the MAC address. After victim information has been serialized, the malware will apply some persistence mechanisms. The Windows instance will initialize a registry entry so that the malware will be executed on system start-up. The Linux instance will set up various symbolic links and add an initrd script for the malware to also run on system start-up.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Backdoor"
        ],
        "refs": [
          "https://www.intezer.com/blog-acbackdoor-analysis-of-a-new-multiplatform-backdoor/"
        ]
      },
      "uuid": "2186503c-29bb-11ea-978f-2e728ce88125",
      "value": "OSRS Backdoor: ACBackdoor"
    },
	{
      "description": "BalkanDoor is a simple backdoor with a small number of commands (download and execute a file, create a remote shell, take a screenshot). It can be used to automate tasks on the compromised computer or to automatically control several affected computers at once. We have seen six versions of the backdoor, ranging in supported commands, evolving since 2016.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Backdoor"
        ],
        "refs": [
          "https://www.welivesecurity.com/2019/08/14/balkans-businesses-double-barreled-weapon/"
        ]
      },
      "uuid": "e12b4fc6-41d7-11ea-b77f-2e728ce88125",
      "value": "OSRS Backdoor: BalkanDoor"
    },
	{
      "description": "During analysis of the xHunt campaign, researchers from UNIT42 observed several domains with ties to the pasta58.com domain associated with known Sakabota command and control (C2) activity. In June 2019, they also observed one of these overlapping domains, specifically, windows64x.com, being used as the C2 server for a new PowerShell based backdoor that has been named by UNIT42 researchers as CASHY200. This PowerShell backdoor used DNS tunneling to communicate with its C2 server, specifically by issuing DNS A queries to the actor controlled name server at the aforementioned domain. CASHY200 parses data provided by the C2 server within DNS answers to run commands on the system and send the results back to the C2 via DNS queries. In several samples, CASHY200 used randomly generated identifiers that are stored in the registry and used the command value 200 to communicate with the C2 server. By analyzing the lineage of this tool, UNIT42 researchers found that actors may have used CASHY200 when targeting Kuwaiti government organizations starting in the spring of 2018 and continuing throughout 2019.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Backdoor"
        ],
        "refs": [
          "https://unit42.paloaltonetworks.com/more-xhunt-new-powershell-backdoor-blocked-through-dns-tunnel-detection/"
        ]
      },
      "uuid": "e12b52b4-41d7-11ea-b77f-2e728ce88125",
      "value": "OSRS Backdoor: CASHY200"
    },
	{
      "description": "DELPHSTATS, a backdoor written in the Delphi programming language, emerged. DELPHSTATS queries the C&C server for a .dat file before executing it via the Powershell.exe process. Like SHARPSTATS, DELPHSTATS employs custom PowerShell script with code similarities to the one embedded into the former.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Backdoor"
        ],
        "refs": [
          "https://blog.trendmicro.com/trendlabs-security-intelligence/muddywater-resurfaces-uses-multi-stage-backdoor-powerstats-v3-and-new-post-exploitation-tools/"
        ]
      },
      "uuid": "e12b566a-41d7-11ea-b77f-2e728ce88125",
      "value": "OSRS Backdoor: DELPHSTATS"
    },
	{
      "description": "A multiprotocol backdoor called DNSbot, which is used to exchange commands and push data to and from compromised machines. Primarily, it operates over DNS traffic, but can also switch to encrypted channels such as HTTPS or SSL.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Backdoor"
        ],
        "refs": [
          "https://www.flashpoint-intel.com/blog/fin7-revisited-inside-astra-panel-and-sqlrat-malware/"
        ]
      },
      "uuid": "e12b57c8-41d7-11ea-b77f-2e728ce88125",
      "value": "OSRS Backdoor: DNSbot"
    },
	{
      "description": "Empire is a post-exploitation framework that includes a pure-PowerShell2.0 Windows agent, and a pure Python 2.6/2.7 Linux/OS X agent. It is the merge of the previous PowerShell Empire and Python EmPyre projects. The framework offers cryptologically-secure communications and a flexible architecture. On the PowerShell side, Empire implements the ability to run PowerShell agents without needing powershell.exe, rapidly deployable post-exploitation modules ranging from key loggers to Mimikatz, and adaptable communications to evade network detection, all wrapped up in a usability-focused framework. PowerShell Empire premiered at BSidesLV in 2015 and Python EmPyre premeiered at HackMiami 2016.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Backdoor"
        ],
        "refs": [
          "https://github.com/EmpireProject/Empire"
        ]
      },
      "uuid": "e12b58fe-41d7-11ea-b77f-2e728ce88125",
      "value": "OSRS Backdoor: Empire Backdoor"
    },
	{
      "description": "Attributed to The Dukes (aka APT29 and Cozy Bear), this sophisticated backdoor implements a lot of functionalities and has a very flexible configuration. Its code is also well obfuscated using many opaque predicates. They re-compile it and modify the obfuscation frequently to bypass security product detections.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Backdoor"
        ],
        "refs": [
          "https://www.welivesecurity.com/2019/10/17/operation-ghost-dukes-never-left/"
        ]
      },
      "uuid": "e12b5b06-41d7-11ea-b77f-2e728ce88125",
      "value": "OSRS Backdoor: FatDuke"
    },
	{
      "description": "FlowerPippi collects some of the user’s information, which it sends to the C&C server. When collecting information, FlowerPippi generates the victim ID from the system’s MAC address using the FNV-1a hash algorithm.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Backdoor"
        ],
        "refs": [
          "https://blog.trendmicro.com/trendlabs-security-intelligence/latest-spam-campaigns-from-ta505-now-using-new-malware-tools-gelup-and-flowerpippi/"
        ]
      },
      "uuid": "e12b5c5a-41d7-11ea-b77f-2e728ce88125",
      "value": "OSRS Backdoor: FlowerPippi"
    },
	{
      "description": "The malware installs two instances of itself on the system. The second instance (watchdog) monitors whether the first instance is still active and reinstalls it if it has been removed from the system. The malware employs antivirus bypass techniques (it allocates large chunks of memory and delays execution of the malicious payload to prevent antivirus engines from emulating the code due to resource constraints). The malware can detect selected security and analytical tools, such as debuggers. If detected, it terminates itself. The malware terminates itself if IP information of the victim suggests one of several blacklisted organizations (e.g. Amazon, BitDefender, Cisco, ESET). It uses external legitimate websites for querying IP information and searches for hardcoded strings in this information (e.g. cloud, Cisco, Microsoft), rather than using API functions. The malware terminates itself if its file name consists of 32 hexadecimal characters, which prevents the payload from being executed in some automated sandboxes.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Backdoor"
        ],
        "refs": [
          "https://www.welivesecurity.com/2019/07/08/south-korean-users-backdoor-torrents/"
        ]
      },
      "uuid": "e12b5d7c-41d7-11ea-b77f-2e728ce88125",
      "value": "OSRS Backdoor: GoBot2"
    },
	{
      "description": "Variant of the GoBot2 backdoor specifically modified for Asian targets.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Backdoor"
        ],
        "refs": [
          "https://en.wikipedia.org/wiki/Backdoor_(computing)"
        ]
      },
      "uuid": "e12b622c-41d7-11ea-b77f-2e728ce88125",
      "value": "OSRS Backdoor: GoBotKR"
    },
	{
      "description": "Godlua Backdoor has a redundant communication mechanism for C2 connection, a combination of hardcoded dns name, Pastebin.com, GitHub.com as well as DNS TXT are used to store the C2 address, which is not something we see often. At the same time, it uses HTTPS to download Lua byte-code files, and uses DNS over HTTPS to get the C2 name to ensure secure communication between the bots, the Web Server and the C2.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Backdoor"
        ],
        "refs": [
          "https://blog.netlab.360.com/an-analysis-of-godlua-backdoor-en/"
        ]
      },
      "uuid": "e12b63a8-41d7-11ea-b77f-2e728ce88125",
      "value": "OSRS Backdoor: GodLua"
    },
	{
      "description": "HIGHNOON is a backdoor that consists of multiple components, including a loader, dynamic-link library (DLL), and a rootkit. When loaded, the DLL may deploy one of two embedded drivers to conceal network traffic and communicate with its command and control server to download and launch memory-resident DLL plugins.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Backdoor"
        ],
        "refs": [
          "https://www.fireeye.com/blog/threat-research/2019/08/game-over-detecting-and-stopping-an-apt41-operation.html"
        ]
      },
      "uuid": "ec151ff6-41d8-11ea-b77f-2e728ce88125",
      "value": "OSRS Backdoor: HIGHNOON"
    },
	{
      "description": "Hannotog is a custom backdoor which provides the attackers with a persistent presence on the victim’s network. It has been used in conjunction with several other Thrip tools, including Sagerunex, another custom backdoor providing remote access to the attackers, and Catchamas (Infostealer.Catchamas), a custom Trojan deployed on selected computers of interest and designed to steal information.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Backdoor"
        ],
        "refs": [
          "https://www.symantec.com/blogs/threat-intelligence/thrip-apt-south-east-asia"
        ]
      },
      "uuid": "ec152618-41d8-11ea-b77f-2e728ce88125",
      "value": "OSRS Backdoor: Hannotog"
    },
	{
      "description": "Hisoka is a backdoor malware that uses both HTTP and DNS tunneling for C2 communication. In several instances, historical infrastructure analysis shows potential overlaps between both Hisoka and Sakabota activities, as well as with OilRig ISMAgent campaigns and DNS Hijacking activity infrastructure.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Backdoor"
        ],
        "refs": [
          "https://unit42.paloaltonetworks.com/xhunt-campaign-attacks-on-kuwait-shipping-and-transportation-organizations/"
        ]
      },
      "uuid": "ec152794-41d8-11ea-b77f-2e728ce88125",
      "value": "OSRS Backdoor: Hisoka"
    },
	{
      "description": "The Ivoke backdoor is a completely fileless Trojan. Its main task is to collect information about the infected system and load the next stage upon command from the CnC server.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Backdoor"
        ],
        "refs": [
          "https://www.group-ib.com/resources/threat-research/silence_2.0.going_global.pdf"
        ]
      },
      "uuid": "ec1528c0-41d8-11ea-b77f-2e728ce88125",
      "value": "OSRS Backdoor: Ivoke"
    },
	{
      "description": "A backdoor used by the threat actor Ke3chang - and, sometimes used in conjunction with the Okrum backdoor.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Backdoor"
        ],
        "refs": [
          "https://www.welivesecurity.com/wp-content/uploads/2019/07/ESET_Okrum_and_Ketrican.pdf"
        ]
      },
      "uuid": "ec1529f6-41d8-11ea-b77f-2e728ce88125",
      "value": "OSRS Backdoor: Ketrican"
    },
	{
      "description": "Killua functions as a backdoor similar to Hisoka, but unlike its Hisoka cousin, Killua was not developed in C# — rather it was coded in Visual C++. Killua also appears to be newer than known Hisoka samples as Killua samples were not compiled until June 25 and 30, 2019. Similar to Hisoka, Killua writes its configuration to the registry.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Backdoor"
        ],
        "refs": [
          "https://unit42.paloaltonetworks.com/xhunt-campaign-attacks-on-kuwait-shipping-and-transportation-organizations/"
        ]
      },
      "uuid": "ec152b22-41d8-11ea-b77f-2e728ce88125",
      "value": "OSRS Backdoor: Killua"
    },
	{
      "description": "LOWKEY is a passive backdoor that supports commands for a reverse shell, uploading and downloading files, listing and killing processes and file management. There are two variants of the LOWKEY backdoor. The first is a TCP variant that listens on port 53, and the second is an HTTP variant that listens on TCP port 80.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Backdoor"
        ],
        "refs": [
          "https://www.fireeye.com/blog/threat-research/2019/10/lowkey-hunting-for-the-missing-volume-serial-id.html"
        ]
      },
      "uuid": "ec152cf8-41d8-11ea-b77f-2e728ce88125",
      "value": "OSRS Backdoor: LOWKEY"
    },
	{
      "description": "This backdoor, dubbed LightNeuron, has been specifically targeting Microsoft Exchange mail servers since at least 2014. Although no samples were available for analysis, code artefacts in the Windows version lead us to believe that a Linux variant exists.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Backdoor"
        ],
        "refs": [
          "https://www.welivesecurity.com/2019/05/07/turla-lightneuron-email-too-far/"
        ]
      },
      "uuid": "ec152e6a-41d8-11ea-b77f-2e728ce88125",
      "value": "OSRS Backdoor: LightNeuron"
    },
	{
      "description": "Meterpreter is an advanced, dynamically extensible payload that uses in-memory DLL injection stagers and is extended over the network at runtime. It communicates over the stager socket and provides a comprehensive client-side Ruby API.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Backdoor"
        ],
        "refs": [
          "https://www.symantec.com/blogs/threat-intelligence/waterbug-espionage-governments"
        ]
      },
      "uuid": "ec153266-41d8-11ea-b77f-2e728ce88125",
      "value": "OSRS Backdoor: Meterpreter"
    },
	{
      "description": "Neptun is installed on Microsoft Exchange servers and is designed to passively listen for commands from the attackers. This passive listening capability makes the malware more difficult to detect. Neptun is also able to download additional tools, upload stolen files, and execute shell commands.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Backdoor"
        ],
        "refs": [
          "https://www.symantec.com/blogs/threat-intelligence/waterbug-espionage-governments"
        ]
      },
      "uuid": "ec1533b0-41d8-11ea-b77f-2e728ce88125",
      "value": "OSRS Backdoor: Neptun"
    },
	{
      "description": "Netero is embedded in the Hisoka tool within a resource named msdtd and is saved to the system in the event that Hisoka needs to use that functionality. The process of moving the functionality out of Hisoka into another tool suggests the author was seeking a more modular architecture in an attempt to evade detection. The payload is base64 encoded and exists as a certificate, which Hisoka v0.9 uses certutil.exe.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Backdoor"
        ],
        "refs": [
          "https://unit42.paloaltonetworks.com/xhunt-campaign-attacks-on-kuwait-shipping-and-transportation-organizations/"
        ]
      },
      "uuid": "45e54844-41d9-11ea-b77f-2e728ce88125",
      "value": "OSRS Backdoor: Netero"
    },
	{
      "description": "Backdoor that allows for system information discovery, network communication over HTTP, and file access. Used by the threat actor known as Ke3chang.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Backdoor"
        ],
        "refs": [
          "https://www.welivesecurity.com/wp-content/uploads/2019/07/ESET_Okrum_and_Ketrican.pdf"
        ]
      },
      "uuid": "45e54b0a-41d9-11ea-b77f-2e728ce88125",
      "value": "OSRS Backdoor: Okrum"
    },
	{
      "description": "POISONPLUG is a highly obfuscated modular backdoor with plug-in capabilities. The malware is capable of registry or service persistence, self-removal, plug-in execution, and network connection forwarding. POISONPLUG has been observed using social platforms to host encoded command and control commands.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Backdoor"
        ],
        "refs": [
          "https://www.fireeye.com/blog/threat-research/2019/10/lowkey-hunting-for-the-missing-volume-serial-id.html"
        ]
      },
      "uuid": "45e54c5e-41d9-11ea-b77f-2e728ce88125",
      "value": "OSRS Backdoor: POISONPLUG"
    },
	{
      "description": "A multi-stage PowerShell-based backdoor called POWERSTATS v3. The spear-phishing email that contains a document embedded with a malicious macro drops a VBE file encoded with Microsoft Script Encoder. The VBE file, which holds a base64-encoded block of data containing obfuscated PowerShell script, will then execute. This block of data will be decoded and saved to the %PUBLIC% directory under various names ending with image file extensions such as .jpeg and .png. The PowerShell code will then use custom string obfuscation and useless code blocks to make it difficult to analyze.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Backdoor"
        ],
        "refs": [
          "https://blog.trendmicro.com/trendlabs-security-intelligence/muddywater-resurfaces-uses-multi-stage-backdoor-powerstats-v3-and-new-post-exploitation-tools/"
        ]
      },
      "uuid": "45e54d94-41d9-11ea-b77f-2e728ce88125",
      "value": "OSRS Backdoor: POWERSTATS v3"
    },
	{
      "description": "Pluox can spread itself over a local network via an exploit, provide access to the attacked network, and install miners and other malicious software on victim computers. What’s more, the backdoor is modular, which means that its functionality can be expanded with the aid of plugins, as required.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Backdoor"
        ],
        "refs": [
          "https://securelist.com/plurox-modular-backdoor/91213/"
        ]
      },
      "uuid": "45e55064-41d9-11ea-b77f-2e728ce88125",
      "value": "OSRS Backdoor: Plurox"
    },
	{
      "description": "The PortReuse backdoor does not use a C2 server; it waits for an incoming connection that sends a magic packet. To do so, it doesn’t open an additional TCP port; it injects into an existing process to reuse a port that is already open. To be able to parse incoming data to search for the magic packet, two techniques are used - hooking of the receiving function (WSARecv or even the lower level NtDeviceIoControlFile) or registering a handler for a specific URL resource on an IIS server using HttpAddUrl with a URLPrefix. There are variants that different services and ports. They include DNS (53), HTTP (80), HTTPS (443), RDP (3389) and WinRM (5985).",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Backdoor"
        ],
        "refs": [
          "https://www.welivesecurity.com/2019/10/14/connecting-dots-exposing-arsenal-methods-winnti/",
		  "https://www.fireeye.com/blog/threat-research/2019/10/lowkey-hunting-for-the-missing-volume-serial-id.html"
        ]
      },
      "uuid": "45e551ae-41d9-11ea-b77f-2e728ce88125",
      "value": "OSRS Backdoor: PortReuse"
    },
	{
      "description": "Allows a user to run PowerShell scripts without executing powershell.exe, therefore the user may bypass detection aimed at identifying malicious PowerShell usage.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Backdoor"
        ],
        "refs": [
          "https://www.symantec.com/blogs/threat-intelligence/waterbug-espionage-governments"
        ]
      },
      "uuid": "45e552da-41d9-11ea-b77f-2e728ce88125",
      "value": "OSRS Backdoor: PowerShellRunner"
    },
	{
      "description": "PowerShower, named and previously disclosed by Palo Alto Networks in their blogspot (see above), is a malicious piece of PowerShell designed to receive PowerShell and VBS modules to execute on the local computer. This malware has been used since October 2018 by Cloud Atlas as a validator and now as a second stage. The differences in the two versions reside mostly in anti-forensics features for the validator version of PowerShower.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Backdoor"
        ],
        "refs": [
          "https://securelist.com/recent-cloud-atlas-activity/92016/"
        ]
      },
      "uuid": "45e553fc-41d9-11ea-b77f-2e728ce88125",
      "value": "OSRS Backdoor: PowerShower"
    },
	{
      "description": "In the ProCC campaigns, the downloaded files are Delphi binaries. The backdoor is developed from scratch and is able to collect data from the clipboard and printer spooler, and capture screenshots. Because the personnel in charge of confirming reservations usually need to pull credit card data from OTA websites, it’s possible to collect card numbers by monitoring the clipboard and the documents sent to the printer.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Backdoor"
        ],
        "refs": [
          "https://securelist.com/revengehotels/95229/"
        ]
      },
      "uuid": "45e5574e-41d9-11ea-b77f-2e728ce88125",
      "value": "OSRS Backdoor: ProCC Backdoor"
    },
	{
      "description": "SHARPSTATS, a .NET-written backdoor that supports DOWNLOAD, UPLOAD, and RUN functions.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Backdoor"
        ],
        "refs": [
          "https://blog.trendmicro.com/trendlabs-security-intelligence/muddywater-resurfaces-uses-multi-stage-backdoor-powerstats-v3-and-new-post-exploitation-tools/"
        ]
      },
      "uuid": "45e558a2-41d9-11ea-b77f-2e728ce88125",
      "value": "OSRS Backdoor: SHARPSTATS"
    },
	{
      "description": "It supports writing and reading files, modification of file properties, an interactive command shell, TCP relay functionality and listing running processes. Data received by the backdoor is encrypted with RC4 using the key CreateThread and then XORed with 0x77. All data sent by the backdoor uses the same encryption in reverse order (first XOR with 0x77, then RC4 encrypted with the key CreateThread). Encrypted data is preceded by a 16-byte header which is unencrypted containing an identifier and the size of the following encrypted packet.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Backdoor"
        ],
        "refs": [
          "https://www.fireeye.com/blog/threat-research/2019/10/lowkey-hunting-for-the-missing-volume-serial-id.html"
        ],
        "synonyms": [
        "SK3.x.exe"
        ]
      },
      "uuid": "591c02de-41e0-11ea-b77f-2e728ce88125",
      "value": "OSRS Backdoor: SK3 Backdoor"
    },
	{
      "description": "The backdoor dubbed SLUB by the Trend Micro Cyber Safety Solutions Team who detected it in the wild is part of a multi-stage infection process designed by capable threat actors who programmed it in C++. SLUB uses statically-linked curl, boost, and JsonCpp libraries for performing HTTP request, extracting commands from gist snippets, and parsing Slack channel communication.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Backdoor"
        ],
        "refs": [
          "https://www.bleepingcomputer.com/news/security/new-slub-backdoor-uses-slack-github-as-communication-channels/"
        ]
      },
      "uuid": "591c055e-41e0-11ea-b77f-2e728ce88125",
      "value": "OSRS Backdoor: SLUB"
    },
	{
      "description": "Hannotog is a custom backdoor which provides the attackers with a persistent presence on the victim’s network. It has been used in conjunction with several other Thrip tools, including Sagerunex, another custom backdoor providing remote access to the attackers, and Catchamas (Infostealer.Catchamas), a custom Trojan deployed on selected computers of interest and designed to steal information.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Backdoor"
        ],
        "refs": [
          "https://www.symantec.com/blogs/threat-intelligence/thrip-apt-south-east-asia"
        ]
      },
      "uuid": "591c06b2-41e0-11ea-b77f-2e728ce88125",
      "value": "OSRS Backdoor: Sagerunex"
    },
	{
      "description": "Sakabota is the predecessor to Hisoka, which was first observed in May 2019. The number of functions and variable names are exactly the same in both Sakabota and Hisoka suggest, which infers that the same developer created both and spent little effort trying to hide this lineage.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Backdoor"
        ],
        "refs": [
          "https://unit42.paloaltonetworks.com/xhunt-campaign-attacks-on-kuwait-shipping-and-transportation-organizations/"
        ]
      },
      "uuid": "591c07e8-41e0-11ea-b77f-2e728ce88125",
      "value": "OSRS Backdoor: Sakabota"
    },
	{
      "description": "Used in POS malware attacks, ShellTea has several capabilities. Among them are (1) ability to execute PowerShell commands, (2) evasion through hashing algorithms, (3) code injection, (4) virtual as well as sandbox detection, (5) system process discovery, and (6) HTTPS support for C2. It has been used by the threat actors FIN6, FIN7, and FIN8.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Backdoor"
        ],
        "refs": [
          "http://blog.morphisec.com/security-alert-fin8-is-back"
        ]
      },
      "uuid": "591c0932-41e0-11ea-b77f-2e728ce88125",
      "value": "OSRS Backdoor: ShellTea"
    },
	{
      "description": "The SpeakUp backdoor leverages known vulnerabilities in six different Linux distros, it is also able to infect Mac systems. The Trojan spread by exploiting remote code execution flaw and for the initial infection hackers leverage recently disclosed flaw in ThinkPHP (CVE-2018-20062).",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Backdoor"
        ],
        "refs": [
          "https://securityaffairs.co/wordpress/80706/malware/speakup-backdoor.html"
        ]
      },
      "uuid": "591c0d06-41e0-11ea-b77f-2e728ce88125",
      "value": "OSRS Backdoor: SpeakUp"
    },
	{
      "description": "A new malware is targeting Discord users by modifying the Windows Discord client so that it is transformed into a backdoor and an information-stealing Trojan. The Windows Discord client is an Electron application, which means that almost all of its functionality is derived from HTML, CSS, and JavaScript. This allows malware to modify its core files so that the client executes malicious behavior on startup. Discovered by researcher MalwareHunterTeam, this malware is called Spidey Bot based on the name of the Discord command and control channel that the malware communicated with.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Backdoor"
        ],
        "refs": [
          "https://www.bleepingcomputer.com/news/security/discord-turned-into-an-info-stealing-backdoor-by-new-malware/"
        ],
        "synonyms": [
        "Blue Face"
        ]
      },
      "uuid": "591c0e78-41e0-11ea-b77f-2e728ce88125",
      "value": "OSRS Backdoor: Spidey Bot"
    },
	{
      "description": "The StealthFalcon backdoor, which appears to have been created in 2015, allows the attacker to control the compromised computer remotely. A small number of targets have been observed in UAE, Saudi Arabia, Thailand, and the Netherlands; in the latter case, the target was a diplomatic mission of a Middle Eastern country.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Backdoor"
        ],
        "refs": [
          "https://www.welivesecurity.com/2019/09/09/backdoor-stealth-falcon-group/"
        ]
      },
      "uuid": "591c0fb8-41e0-11ea-b77f-2e728ce88125",
      "value": "OSRS Backdoor: StealthFalcon Backdoor"
    },
	{
      "description": "This is a basic backdoor that can download and execute additional tools and commands. The actors behind it have developed it in both Delphi and .NET.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Backdoor"
        ],
        "refs": [
          "https://www.symantec.com/blogs/threat-intelligence/tortoiseshell-apt-supply-chain"
        ]
      },
      "uuid": "591c10ee-41e0-11ea-b77f-2e728ce88125",
      "value": "OSRS Backdoor: Syskit Backdoor"
    },
	{
      "description": "TONEDEAF is a backdoor that communicates with Command and Control servers using HTTP or DNS. Supported commands include system information collection, file upload, file download, and arbitrary shell command execution. Although this backdoor was coded to be able to communicate with DNS requests to the hard-coded Command and Control server, c[.]cdn-edge-akamai[.]com, it was not configured to use this functionality. Figure 5 provides a snippet of the assembly CALL instruction of dns_exfil. The creator likely made this as a means for future DNS exfiltration as a plan B.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Backdoor"
        ],
        "refs": [
          "https://www.fireeye.com/blog/threat-research/2019/07/hard-pass-declining-apt34-invite-to-join-their-professional-network.html"
        ]
      },
      "uuid": "591c121a-41e0-11ea-b77f-2e728ce88125",
      "value": "OSRS Backdoor: TONEDEAF"
    },
	{
      "description": "The VBShower backdoor has the same philosophy of the validator version of PowerShower. Its aim is to complicate forensic analysis by trying to delete all the files contained in APPDATA..Local Temporary Internet Files Content.Word and APPDATA .. Local Settings Temporary Internet Files Content.Word. Once these files have been deleted and its persistence is achieved in the registry, VBShower sends the context file computed by the HTA to the remote server and tries to get via HTTP a VBS script to execute from the remote server every hour.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Backdoor"
        ],
        "refs": [
          "https://securelist.com/recent-cloud-atlas-activity/92016/"
        ]
      },
      "uuid": "591c1346-41e0-11ea-b77f-2e728ce88125",
      "value": "OSRS Backdoor: VBShower"
    },
	{
      "description": "The backdoor will modify the registry for the Windows Media Player to store its C&C configuration. It also reconfigures the Microsoft Sysinternals registry to prevent pop-ups when running the PsExec tool. The backdoor has the capability to download and upload files, execute shell commands, and update its configuration.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Backdoor"
        ],
        "refs": [
          "https://www.symantec.com/blogs/threat-intelligence/waterbug-espionage-governments"
        ]
      },
      "uuid": "591c1652-41e0-11ea-b77f-2e728ce88125",
      "value": "OSRS Backdoor: photobased.dll"
    },
	{
      "description": "This backdoor can receive commands through the RPC protocol. Its capabilities include: Executing commands through cmd.exe with the output redirected into a temporary file. Reading the command output contained in the temporary file. Reading or writing arbitrary files.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Backdoor"
        ],
        "refs": [
          "https://www.symantec.com/blogs/threat-intelligence/waterbug-espionage-governments"
        ]
      },
      "uuid": "591c179c-41e0-11ea-b77f-2e728ce88125",
      "value": "OSRS Backdoor: securlsa.chk"
    },
	{
      "description": "This backdoor targets MSSQL Server 11 and 12, allowing the attacker to connect stealthily to any MSSQL account by using a magic password – while automatically hiding these connections from the logs. Such a backdoor could allow an attacker to stealthily copy, modify or delete database content. This could be used, for example, to manipulate in-game currencies for financial gain.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Backdoor"
        ],
        "refs": [
          "https://www.welivesecurity.com/2019/10/21/winnti-group-skip2-0-microsoft-sql-server-backdoor/"
        ]
      },
      "uuid": "591c18d2-41e0-11ea-b77f-2e728ce88125",
      "value": "OSRS Backdoor: skip-2.0"
    },
	{
      "description": "Buerak is a Windows-based Trojan that implements backdoor capabilities and anti-analysis techniques.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Backdoor"
        ],
        "refs": [
          "https://securelist.com/mokes-and-buerak-distributed-under-the-guise-of-security-certificates/96324/"
        ]
      },
      "uuid": "811409f2-6522-11ea-bc55-0242ac130003",
      "value": "OSRS Backdoor: Buerak Backdoor"
    },
	{
      "description": "Backdoor tool associated with Vault 7 and APT-C-39.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Backdoor"
        ],
        "refs": [
          "http://blogs.360.cn/post/APT-C-39_CIA_EN.html"
        ]
      },
      "uuid": "e4b31b00-67d5-11ea-bc55-0242ac130003",
      "value": "OSRS Backdoor: Fluxwire Backdoor"
    },
	{
      "description": "Backdoor tool associated with the Android trojan Cookiethief, and was identified by they cybersecurity vendor Kaspersky.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Backdoor"
        ],
        "refs": [
          "https://securelist.com/cookiethief/96332/"
        ]
      },
      "uuid": "c1b1cf48-686b-11ea-bc55-0242ac130003",
      "value": "OSRS Backdoor: Bood Backdoor"
    },
	{
      "description": "Attributed to the threat actor Turla. Prior to the end of August 2019, the victim would receive a RAR-SFX archive containing a legitimate Adobe Flash v14 installer and a second RAR-SFX archive. The latter contains the various components of a backdoor known as Skipper that has been previously attributed to Turla. It was documented in 2017 by researchers from Bitdefender, and a more recent version was documented by Telsy in May 2019. One interesting change is that the Skipper communication module uses the server that hosts this campaign’s remote JavaScripts and malicious binaries for its C&C server.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Backdoor"
        ],
        "refs": [
          "https://www.welivesecurity.com/2020/03/12/tracking-turla-new-backdoor-armenian-watering-holes/"
        ]
      },
      "uuid": "ac948e4a-691d-11ea-bc55-0242ac130003",
      "value": "OSRS Backdoor: Skipper Backdoor"
    },
	{
      "description": "Associated with the threat actor Turla.  This second stage backdoor is a py2exe executable. py2exe is a Python extension to convert a Python script into a standalone Windows executable. To our knowledge, this is the first time the Turla developers have used the Python language in a backdoor. The backdoor communicates with its hardcoded C&C server via HTTP. The C&C URL and other parameters such as the AES key and IV used to encrypt all network communications are specified at the beginning of the script. The main function of the script, sends information about the machine to the C&C server. This is the output of the functions from the commands list. It includes OS-related commands (systeminfo, tasklist) and network-related commands (ipconfig, getmac, arp). The C&C server can also send backdoor commands in JSON format. Additional features include - download additional files from a given HTTP(S) link, execute a Windows command using the Python function subprocess32.Popen, change the execution delay - modifies the Windows task that regularly (every X minutes - 5 by default) launches the malware, and kill (uninstall) the malware.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Backdoor"
        ],
        "refs": [
          "https://www.welivesecurity.com/2020/03/12/tracking-turla-new-backdoor-armenian-watering-holes/"
        ]
      },
      "uuid": "ac94907a-691d-11ea-bc55-0242ac130003",
      "value": "OSRS Backdoor: PyFlash Backdoor"
    },
	{
      "description": "Backdoor that is associated with the abuse of Cloudflare Workers.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Backdoor"
        ],
        "refs": [
          "https://www.bleepingcomputer.com/news/security/blackwater-malware-abuses-cloudflare-workers-for-c2-communication/"
        ]
      },
      "uuid": "ac949192-691d-11ea-bc55-0242ac130003",
      "value": "OSRS Backdoor: BlackWater Backdoor"
    },
	{
      "description": "The WP-VCD family of WordPress infections are distributed as nulled, or pirated, WordPress plugins that contain modified code that injects a backdoor into any themes that are installed on the blog as well as various PHP files. Once a WordPress site is compromised by WP-VCD, the malware will attempt to compromise other sites on the same shared host and will routinely connect back to its command & control server to receive new instructions to execute.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Backdoor"
        ],
        "refs": [
          "https://www.bleepingcomputer.com/news/security/wordpress-malware-distributed-via-pirated-coronavirus-plugins/"
        ]
      },
      "uuid": "8405287e-72a3-11ea-bc55-0242ac130003",
      "value": "OSRS Backdoor: WordPress WP-VCD Backdoor"
    },
	{
      "description": "Beacon is Cobalt Strike's payload to model advanced attackers. Use Beacon to egress a network over HTTP, HTTPS, or DNS. You may also limit which hosts egress a network by controlling peer-to-peer Beacons over Windows named pipes. Beacon is flexible and supports asynchronous and interactive communication. Asynchronous communication is low and slow. Beacon will phone home, download its tasks, and go to sleep. Interactive communication happens in real-time. Beacon's network indicators are malleable. Redefine Beacon's communication with Cobalt Strike's malleable C2 language. This allows you to cloak Beacon activity to look like other malware or blend-in as legitimate traffic.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Backdoor"
        ],
        "refs": [
          "https://www.cobaltstrike.com/help-beacon",
		  "https://attack.mitre.org/software/S0154/"
        ]
      },
      "uuid": "84052a9a-72a3-11ea-bc55-0242ac130003",
      "value": "OSRS Backdoor: Cobalt Strike BEACON Backdoor"
    },
	{
      "description": "This implant is written in Go language, and its C2 channel relies on file exchanges with a Google Drive space, through Google Drive’s HTTPS API v3. The implant probably leverages the gdrive Go source from GitHub, as it shares several identical code source paths with it. Godlike12 is the name the threat actor gave to the Google Drive space connections from this implant. Source file paths in the code suggest this backdoor may have been developed on a GNU/Linux system. Some of this backdoor’s modules have been compiled from seems popular in Chinese-speaking communities, and may originate from a Chinese-authored tutorial on Go language. Godlike12 first proceeds with host fingerprinting upon startup (hostname, IP address, MAC address, Windows version, current time). The result is encrypted, base64-encoded, stored in a text file and uploaded to the remote Google Drive. The implant then regularly checks for a remote .txt, that contains encrypted commands to execute, and stores encrypted command results to later upload them to the same Google Drive space. ID is the MD5 hash of the base64-encoded MAC address of the first connected network adapter, while TripleDES in ECB mode is used as an encryption algorithm. It is worth mentioning that once again, the encryption function seems to have been inspired from existing open-source code, which mainly appears popular in Chinese-language forums. Godlike12 does not implement a persistence mechanism, as it is provided by the previous installer package.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Backdoor"
        ],
        "refs": [
          "https://securelist.com/holy-water-ongoing-targeted-water-holing-attack-in-asia/96311/"
        ]
      },
      "uuid": "24519664-7754-11ea-bc55-0242ac130003",
      "value": "OSRS Backdoor: Godlike12 Backdoor"
    },
	{
      "description": "A Cross Platform Python Remote Administration Tool. This is a cross platform python framework which allows you to build custom payloads for Windows, Mac OSX and Linux as well. You are able to select whether the payload binds to a specific IP and port, listens for a connection on a port, option to send an email of system info when the system boots, and option to start keylogger on boot. Payloads created can only run on the OS that they were created on. Allows for file auto-completeion, antivirus detection, keylogging, screen capture, dump system password hashes, and various other remote command options.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Backdoor"
        ],
        "refs": [
          "https://securelist.com/holy-water-ongoing-targeted-water-holing-attack-in-asia/96311/",
		  "https://github.com/nathanlopez/Stitch"
        ]
      },
      "uuid": "24519876-7754-11ea-bc55-0242ac130003",
      "value": "OSRS Backdoor: Stitch (Open Source Python Backdoor)"
    },
	{
      "description": "Attributed to APT41. The Speculoos backdoor is an ELF executable compiled with GCC 4.2.1 to run on a FreeBSD system. This payload does not appear to natively be able to maintain persistence, so it is likely it requires the adversary to use a separate component or additional step to maintain their foothold. Upon execution, the payload enters a loop that calls a function to communicate with the command and control (C2) domain over TCP 443.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Backdoor"
        ],
        "refs": [
          "https://unit42.paloaltonetworks.com/apt41-using-new-speculoos-backdoor-to-target-organizations-globally/"
        ]
      },
      "uuid": "160006a2-7fda-11ea-bc55-0242ac130003",
      "value": "OSRS Backdoor: Speculoos Backdoor"
    },
	{
      "description": "Believed to be developed by those who develop and maintain the TrickBot code base. Initial access through phishing. Backdoor itself is fileless. Downloads and executes Cobalt Strike.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Backdoor"
        ],
        "refs": [
          "https://www.bleepingcomputer.com/news/security/bazarbackdoor-trickbot-gang-s-new-stealthy-network-hacking-malware/"
        ]
      },
      "uuid": "7f6e147a-8ae9-11ea-bc55-0242ac130003",
      "value": "OSRS Backdoor: Bazar Backdoor (aka BazarBackdoor)"
    },
	{
      "description": "A constantly developed RAT that has been used in various targeted campaigns against both public and private subjects since late 2017. We observed multiple instances of attacks involving this RAT, and all of them happened in Central Asia. Among the targeted subjects were several important companies in the telecommunications and gas industries, and governmental entities. The Central Asian region joined Russia, Belarus and Mongolia as areas with victims of Mikroceen intrusions. These victims were not desktop users, but endpoints in corporate networks where a higher level of security is expected. Associated with the use of Mimikatz, Gh0st RAT, and lateral movement via Windows WMI.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Backdoor"
        ],
        "refs": [
          "https://www.welivesecurity.com/2020/05/14/mikroceen-spying-backdoor-high-profile-networks-central-asia/"
        ]
      },
      "uuid": "55458b5a-9ac6-11ea-bb37-0242ac130002",
      "value": "OSRS Backdoor: Mikroceen Backdoor RAT"
    },
	{
      "description": "Backdoor associated with CVE-2018-8174 VBScript 0day. Retro series backdoor known to be used by the APT-C-06 organization. Is an evolution of the Lucker backdoor.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Backdoor"
        ],
        "refs": [
          "https://blog.360totalsecurity.com/en/analysis-cve-2018-8174-vbscript-0day-apt-actor-related-office-targeted-attack/"
        ]
      },
      "uuid": "55458f06-9ac6-11ea-bb37-0242ac130002",
      "value": "OSRS Backdoor: Retro Backdoor"
    },
	{
      "description": "Sarwent appears to have been actively used since at least 2018 but not a lot has been publicly reported about it during that time period. Sarwent functionality has historically revolved around being a loader. Some other functionality that has remained consistent is its AV(AntiVirus) checking.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Backdoor"
        ],
        "refs": [
          "https://labs.sentinelone.com/sarwent-malware-updates-command-detonation/"
        ]
      },
      "uuid": "17e164ec-a03d-11ea-bb37-0242ac130002",
      "value": "OSRS Backdoor: Sarwent Backdoor"
    },
	{
      "description": "A modular backdoor. Persisting as a Print Processor, it was used by the Winnti Group against several video gaming companies that are based in South Korea and Taiwan and develop MMO (Massively Multiplayer Online) games. Video games developed by these companies are available on popular gaming platforms and have thousands of simultaneous players. In at least one case, the malware operators compromised a victim’s build system, which could have led to a supply-chain attack, allowing the attackers to trojanize game executables. In another case, the game servers were compromised, which could have allowed the attackers to, for example, manipulate in-game currencies for financial gain.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Backdoor"
        ],
        "refs": [
          "https://www.welivesecurity.com/2020/05/21/no-game-over-winnti-group/"
        ]
      },
      "uuid": "17e16744-a03d-11ea-bb37-0242ac130002",
      "value": "OSRS Backdoor: PipeMon Backdoor"
    },
	{
      "description": "The Ke3chang group, also known as APT15, is an alleged Chinese government-backed cluster of teams known to target various high-profile entities spanning multiple continents. Examples include attacks on European ministries, Indian embassies, and British military contractors. The group’s activities have been traced back to 2010 and it is known to boast a large number of custom tools, most often tailored to their specific target. In mid May, researchers identified three recently uploaded samples from VirusTotal that share code with older APT15 implants. Researchers named this new family of samples, Ketrum, due to the merger of features in the documented backdoor families Ketrican and Okrum. We believe the operation was conducted very recently. Below we present a technical analysis of these samples and explain the evolution of APT15’s codebase over the last year.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Backdoor"
        ],
        "refs": [
          "https://www.bleepingcomputer.com/news/security/hacking-group-builds-new-ketrum-malware-from-recycled-backdoors/",
		  "https://www.intezer.com/blog/research/the-evolution-of-apt15s-codebase-2020/"
        ]
      },
      "uuid": "073d2360-a736-11ea-bb37-0242ac130002",
      "value": "OSRS Backdoor: Ketrum Backdoor"
    },
	{
      "description": "Backdoor leveraged by InvisiMole threat actor. The Control Panel misuse chain uses a rare technique known from Vault 7 leaks, used to achieve covert execution in the context of the Control Panel. The SMInit exploit chain exploits a vulnerability in the legitimate Total Video Player software. It is used in cases where the attackers haven’t managed to obtain administrative privileges on the system. The Speedfan exploit chain exploits a local privilege escalation vulnerability in the speedfan.sys driver to inject its code to a trusted process from kernel mode. The Wdigest exploit chain is InvisiMole’s flagship chain, the most elaborate, used on the newest versions of Windows, where the attackers have administrative privileges. It exploits a vulnerability in the Windows wdigest.dll library and then uses an improved ListPlanting technique to inject its code into a trusted process.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Backdoor"
        ],
        "refs": [
          "https://www.welivesecurity.com/2020/06/18/digging-up-invisimole-hidden-arsenal/"
        ]
      },
      "uuid": "7275374e-b6e0-11ea-b3de-0242ac130004",
      "value": "OSRS Backdoor: RC2CL Backdoor"
    },
	{
      "description": "Backdoor leveraged by InvisiMole threat actor. The Control Panel misuse chain uses a rare technique known from Vault 7 leaks, used to achieve covert execution in the context of the Control Panel. The SMInit exploit chain exploits a vulnerability in the legitimate Total Video Player software. It is used in cases where the attackers haven’t managed to obtain administrative privileges on the system. The Speedfan exploit chain exploits a local privilege escalation vulnerability in the speedfan.sys driver to inject its code to a trusted process from kernel mode. The Wdigest exploit chain is InvisiMole’s flagship chain, the most elaborate, used on the newest versions of Windows, where the attackers have administrative privileges. It exploits a vulnerability in the Windows wdigest.dll library and then uses an improved ListPlanting technique to inject its code into a trusted process.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Backdoor"
        ],
        "refs": [
          "https://www.welivesecurity.com/2020/06/18/digging-up-invisimole-hidden-arsenal/"
        ]
      },
      "uuid": "72753a28-b6e0-11ea-b3de-0242ac130004",
      "value": "OSRS Backdoor: RC2FM Backdoor"
    },
	{
      "description": "While analyzing an attack against a Middle Eastern telecommunications organization, researchers discovered a variant of an OilRig-associated tool researchers call RDAT using a novel email-based command and control (C2) channel that relied on a technique known as steganography to hide commands and data within bitmap images attached to emails.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Backdoor"
        ],
        "refs": [
          "https://unit42.paloaltonetworks.com/oilrig-novel-c2-channel-steganography/"
        ]
      },
      "uuid": "9553447a-d32f-11ea-87d0-0242ac130003",
      "value": "OSRS Backdoor: RDAT Backdoor"
    },
	{
      "description": "The APT-C-43 organization is good at launching attacks using phishing emails, and deploys the backdoor program Pyark (Machete) written in python after invading the victim’s machine. The network communication mainly relies on FTP and HTTP protocols. After successfully infiltrating the target machine, APT-C-43 organization monitors the target users, steal sensitive data, etc.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Backdoor"
        ],
        "refs": [
          "https://blog.360totalsecurity.com/en/apt-c-43-steals-venezuelan-military-secrets-to-provide-intelligence-support-for-the-reactionaries-hpreact-campaign/"
        ],
        "synonyms": [
        "Machete (Backdoor)"
        ]
      },
      "uuid": "2dd62cd4-031f-11eb-adc1-0242ac120002",
      "value": "OSRS Backdoor: Pyark Backdoor"
    },
	{
      "description": "The malware runs when a loader loads a DLL file. JPCERT/CC has confirmed that the DLL file is encoded in some samples (which requires decoding by the loader before execution). BLINDINGCAN shares some features with the aforementioned malware including its function and communication encoding algorithm. The following sections will explain its configuration and communication protocol. The configuration of BLINDINGCAN is stored in one of the following locations hardcoded in the malware itself, stored in a registry entry, or saved as a file.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Backdoor"
        ],
        "refs": [
          "https://blogs.jpcert.or.jp/en/2020/09/BLINDINGCAN.html"
        ]
      },
      "uuid": "3345b100-089a-11eb-adc1-0242ac120002",
      "value": "OSRS Backdoor: BLINDINGCAN Backdoor"
    },
	{
      "description": "HyperStack, first observed in 2018, is one of several RPC backdoors Turla uses. HyperStack uses named pipes to execute remote procedure calls (RPC) from the controller to the device hosting the HyperStack client. To move laterally, the implant tries to connect to another remote device’s IPC share, either using a null session or default credentials. IPC is a share that facilitates inter-process communication (IPC) by exposing named pipes to write to or read from. If the implant’s connection to the IPC is successful, the implant can forward RPC commands from the controller to the remote device, and likely has the capability to copy itself onto the remote device.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Backdoor"
        ],
        "refs": [
          "https://www.accenture.com/us-en/blogs/cyber-defense/turla-belugasturgeon-compromises-government-entity"
        ]
      },
      "uuid": "b69c50a4-1e9d-11eb-adc1-0242ac120002",
      "value": "OSRS Backdoor: HyperStack Backdoor"
    },
	{
      "description": "The agfSpy backdoor retrieves configuration and commands from its C&C server. These commands allow the backdoor to execute shell commands and send the execution results back to the server. It also enumerates directories and can list, upload, download, and execute files, among other functions. The capabilities of agfSpy are very similar to dneSpy, except each backdoor uses a different C&C server and various formats in message exchanges.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Backdoor"
        ],
        "refs": [
          "https://www.trendmicro.com/en_us/research/20/j/operation-earth-kitsune-a-dance-of-two-new-backdoors.html"
        ]
      },
      "uuid": "b69c5324-1e9d-11eb-adc1-0242ac120002",
      "value": "OSRS Backdoor: afgSpy Backdoor"
    },
	{
      "description": "DneSpy collects information, takes screenshots, and downloads and executes the latest version of other malicious components in the infected system. The malware is designed to receive a policy file in JSON format with all the commands to execute. The policy file sent by the C&C server can be changed and updated over time, making dneSpy flexible and well-designed. The output of each executed command is zipped, encrypted, and exfiltrated to the C&C server. These characteristics make dneSpy a fully functional espionage backdoor.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Backdoor"
        ],
        "refs": [
          "https://www.trendmicro.com/en_us/research/20/j/operation-earth-kitsune-a-dance-of-two-new-backdoors.html"
        ]
      },
      "uuid": "b69c5630-1e9d-11eb-adc1-0242ac120002",
      "value": "OSRS Backdoor: dneSpy Backdoor"
    },
	{
      "description": "SLAPSTICK is a Solaris PAM backdoor that grants a user access to the system with a secret, hard-coded password.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Backdoor"
        ],
        "refs": [
          "https://www.fireeye.com/blog/threat-research/2020/11/live-off-the-land-an-overview-of-unc1945.html"
        ]
      },
      "uuid": "a0f2528c-2422-11eb-adc1-0242ac120002",
      "value": "OSRS Backdoor: SLAPSTICK Backdoor"
    },
	{
      "description": "LEMONSTICK is a Linux executable command line utility with backdoor capabilities. The backdoor can execute files, transfer files, and tunnel connections.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Backdoor"
        ],
        "refs": [
          "https://www.fireeye.com/blog/threat-research/2020/11/live-off-the-land-an-overview-of-unc1945.html"
        ]
      },
      "uuid": "a0f2557a-2422-11eb-adc1-0242ac120002",
      "value": "OSRS Backdoor: LEMONSTICK Backdoor"
    },
	{
      "description": "Backdoor used by threat group Kimsuky. Able to take screen shots, upload files to C2, list files on system, and execute shell and powershell commands.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Backdoor"
        ],
        "refs": [
          "https://www.cybereason.com/blog/back-to-the-future-inside-the-kimsuky-kgh-spyware-suite"
        ]
      },
      "uuid": "a0f2567e-2422-11eb-adc1-0242ac120002",
      "value": "OSRS Backdoor: KGH Backdoor"
    },
	{
      "description": "Backdoor used by threat group Kimsuky. Able to take screen shots, upload files to C2, list files on system, and execute shell and powershell commands.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Backdoor"
        ],
        "refs": [
          "https://www.cybereason.com/blog/back-to-the-future-inside-the-kimsuky-kgh-spyware-suite",
		  "https://www.virusbulletin.com/uploads/pdf/conference_slides/2019/VB2019-Kim.pdf"
        ]
      },
      "uuid": "a0f25764-2422-11eb-adc1-0242ac120002",
      "value": "OSRS Backdoor: AppleSeed Backdoor"
    },
	{
      "description": "TriFive is a previously unseen PowerShell-based backdoor that the xHunt actors installed on the compromised Exchange server, executing every five minutes via a scheduled task. TriFive provided backdoor access to the Exchange server by logging into a legitimate user’s inbox and obtaining a PowerShell script from an email draft within the deleted emails folder. The TriFive sample used a legitimate account name and credentials from the targeted organization. This suggests that the threat actor had stolen the account’s credentials prior to the installation of the TriFive backdoor.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Backdoor"
        ],
        "refs": [
          "https://unit42.paloaltonetworks.com/xhunt-campaign-backdoors/"
        ]
      },
      "uuid": "736a8fb0-29a3-11eb-adc1-0242ac120002",
      "value": "OSRS Backdoor: TriFive Backdoor"
    },
	{
      "description": "The OfficeIntegrator.ps1 file seen in the ResolutionHosts task is a PowerShell-based backdoor we call Snugy, which allows an actor to obtain the system’s hostname and to run commands. Snugy is a variant of the CASHY200 backdoor used by actors in previous attacks in the xHunt campaign. In July 2019, Trend Micro created a detection signature for this backdoor called Backdoor.PS1.NETERO.A, which suggests that this particular variant of CASHY200 has been around for over a year. We are calling this variant of the backdoor Snugy, as Netero is already a name of a variant of the Hisoka tool used by the xHunt actors.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Backdoor"
        ],
        "refs": [
          "https://unit42.paloaltonetworks.com/xhunt-campaign-backdoors/"
        ]
      },
      "uuid": "736a91e0-29a3-11eb-adc1-0242ac120002",
      "value": "OSRS Backdoor: Snugy Backdoor"
    },
	{
      "description": "Analysis shows that ModPipe uses modular architecture consisting of basic components and downloadable modules. 1. initial dropper – contains both 32-bit and 64-bit binaries of the next stage – the persistent loader – and installs the appropriate version to the compromised machine. 2. persistent loader – unpacks and loads the next stage of the malware, namely the main module. 3. main module – performs the main functionality of the malware. It creates a pipe used for communication with other malicious modules, un/installs these modules and serves as a dispatcher that handles communication between the modules and attacker’s C&C server. 4. networking module – module used for communication with C&C. downloadable modules – components adding specific functionality to the backdoor, such as the ability to steal database passwords and configuration information, scan specific IP addresses or acquire a list of the running processes and their loaded modules.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Backdoor"
        ],
        "refs": [
          "https://www.welivesecurity.com/2020/11/12/hungry-data-modpipe-backdoor-hits-pos-software-hospitality-sector/"
        ]
      },
      "uuid": "736a92d0-29a3-11eb-adc1-0242ac120002",
      "value": "OSRS Backdoor: ModPipe Backdoor"
    },
	{
      "description": "ESET researchers found a previously undocumented backdoor and document stealer. Dubbed Crutch by its developers, we were able to attribute it to the infamous Turla APT group. According to our research, it was used from 2015 to, at least, early 2020. We have seen Crutch on the network of a Ministry of Foreign Affairs in a country of the European Union, suggesting that this malware family is only used against very specific targets as is common for many Turla tools.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Backdoor"
        ],
        "refs": [
          "https://www.welivesecurity.com/2020/12/02/turla-crutch-keeping-back-door-open/"
        ]
      },
      "uuid": "d6562e68-3961-11eb-adc1-0242ac120002",
      "value": "OSRS Backdoor: Crutch Backdoor"
    },
	{
      "description": "PowerPepper is a Windows in-memory PowerShell backdoor that can execute remotely sent shell commands.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Backdoor"
        ],
        "refs": [
          "https://securelist.com/what-did-deathstalker-hide-between-two-ferns/99616/"
        ]
      },
      "uuid": "d6563106-3961-11eb-adc1-0242ac120002",
      "value": "OSRS Backdoor: PowerPepper Backdoor"
    },
	{
      "description": "LuckyBack collects the computer’s fingerprint, at first, and then tries to establish a communication with the C&C server. Once the communication is established, the backdoor starts listening for commands. It is capable of starting a remote shell, file manipulation (move, read, write, execute, get file size), keylogging, and screen capturing.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Backdoor"
        ],
        "refs": [
          "https://decoded.avast.io/luigicamastra/apt-group-targeting-governmental-agencies-in-east-asia/"
        ]
      },
      "uuid": "08439dea-3e10-11eb-b378-0242ac130002",
      "value": "OSRS Backdoor: LuckyBack Backdoor"
    },
	{
      "description": "This backdoor is simpler in terms of commands than the previous one. It accepts just four commands: exit, upload, download, and execute on the command line. Nevertheless, it uses two layers of C&C servers, meaning that the first request is on the first layer, and it yields an IP address of a C&C server from the second layer. Afterwards, the request-response C&C loop uses the second layer. If the backdoor receives a command for the command line, the output from the console is encrypted with AES-256 and sent back to the second-layer C&C server.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Backdoor"
        ],
        "refs": [
          "https://decoded.avast.io/luigicamastra/apt-group-targeting-governmental-agencies-in-east-asia/"
        ]
      },
      "uuid": "0843a29a-3e10-11eb-b378-0242ac130002",
      "value": "OSRS Backdoor: BlueTraveller Backdoor"
    },
	{
      "description": "Polpo is a backdoor that supports around 15 different commands including information collection and exfiltration, file transfer, and proxy connections.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Backdoor"
        ],
        "refs": [
          "https://decoded.avast.io/luigicamastra/apt-group-targeting-governmental-agencies-in-east-asia/"
        ]
      },
      "uuid": "0843a3a8-3e10-11eb-b378-0242ac130002",
      "value": "OSRS Backdoor: Polpo Backdoor"
    },
	{
      "description": "While looking at the Sunburst backdoor, researchers discovered several features that overlap with a previously identified backdoor known as Kazuar. Kazuar is a .NET backdoor first reported by Palo Alto in 2017. Throughout the years, Kazuar has been under constant development. Its developers have been regularly improving it, switching from one obfuscator to another, changing algorithms and updating features. researchers looked at all versions of Kazuar since 2015, in order to better understand its development timeline. Both Kazuar and Sunburst have implemented a delay between connections to a C2 server, likely designed to make the network activity less obvious. Sunburst uses exactly the same formula to calculate sleeping time, relying on NextDouble to generate a random number. It then calls the sleeping function in a loop. The only difference is that the code is somewhat less complex. Below we compare an extract of the sleeping algorithm found in Kazuar and the code discovered in Sunburst.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Backdoor"
        ],
        "refs": [
          "https://securelist.com/sunburst-backdoor-kazuar/99981/"
        ]
      },
      "uuid": "0c005fdc-567e-11eb-ae93-0242ac130002",
      "value": "OSRS Backdoor: Sunburst Backdoor"
    },
	{
      "description": "Since it first emerged in 2015, Asruex has been known for its backdoor capabilities and connection to the spyware DarkHotel. However, when we encountered Asruex in a PDF file, we found that a variant of the malware can also act as an infector particularly through the use of old vulnerabilities CVE-2012-0158 and CVE-2010-2883, which inject code in Word and PDF files respectively. The use of old, patched vulnerabilities could hint that the most recent variant was devised knowing that it can affect targets who have been using older versions of Adobe Reader (versions 9.x up to before 9.4) and Acrobat (versions 8.x up to before 8.2.5) on Windows and Mac OS X.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Backdoor"
        ],
        "refs": [
          "https://blog.trendmicro.com/trendlabs-security-intelligence/asruex-backdoor-variant-infects-word-documents-and-pdfs-through-old-ms-office-and-adobe-vulnerabilities/"
        ]
      },
      "uuid": "a7c34aa4-41d7-11ea-b77f-2e728ce88125",
      "value": "OSRS Backdoor: Asruex"
    }
	  ],
	"version": 17
}
