 {
  "category": "OSRS-RANSOMWARE",
  "description": "Cluster designed for tagging OSINT artifacts that relate to OSRS artifacts that describe malicious ransomware.",
  "name": "OSRS Ransomware",
  "source": "OSRS DEV",
  "type": "CMCF-BLOCK-OSRS",
  "uuid": "deb05256-49bf-11ea-b77f-2e728ce88125",
  "values": [
	{
      "description": "The Anatova ransomware is a 64bits application with the compile date of January 1st, 2019. The file size of this particular hash is 307kb, but it can change due to the amount of resources used in the sample. If we remove all these resources, the size is 32kb; a very small program with a powerful mechanism inside.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Ransomware"
        ],
        "refs": [
          "https://securingtomorrow.mcafee.com/other-blogs/mcafee-labs/happy-new-year-2019-anatova-is-here/"
        ]
      },
      "uuid": "07eb9b56-29bf-11ea-978f-2e728ce88125",
      "value": "OSRS Ransomware: Anatova"
    },
	{
      "description": "B0r0nt0K ransomware infects both Linux and Windows servers. The ransom encrypts all files and renames them by appending .rontok extension to the file names. When the B0r0nt0K ransomware encrypts a file it will base64 the encrypted data.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Ransomware"
        ],
        "refs": [
          "https://securityaffairs.co/wordpress/81627/malware/b0r0nt0k-ransomware.html"
        ]
      },
      "uuid": "ad6335d8-41ea-11ea-b77f-2e728ce88125",
      "value": "OSRS Ransomware: B0r0nt0K"
    },
	{
      "description": "Sometimes delievered by the RIG exploit kit, the Buran ransomware will skip all files that have certain extensions, reside under certain folders, or have certain file names. When encrypting files, the ransomware will append the victim's unique ID as an extension to the encrypted file. For example, if a victim has an ID of 173C0FE5-3871-B991-E67D-24FEBA3FC981, then a file named 4.jpg would be encrypted and renamed to 4.jpg.173C0FE5-3871-B991-E67D-24FEBA3FC981.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Ransomware"
        ],
        "refs": [
          "https://www.bleepingcomputer.com/news/security/the-rig-exploit-kit-is-now-pushing-the-buran-ransomware/"
        ]
      },
      "uuid": "ad63384e-41ea-11ea-b77f-2e728ce88125",
      "value": "OSRS Ransomware: Buran Ransomware"
    },
	{
      "description": "This new ransomware was discovered by Michael Gillespie on 8 February 2019 and it is still improving over time. The Clop ransomware is usually packed to hide its inner workings. Signing a malicious binary, in this case ransomware, may trick security solutions to trust the binary and let it pass. Clop ransomware shows some characteristics that enterprises are its intended targets instead of end consumers. The authors displayed some creative technical solutions, to detect the victim’s language settings and installed programs.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Ransomware"
        ],
        "refs": [
          "https://securingtomorrow.mcafee.com/other-blogs/mcafee-labs/clop-ransomware/"
        ]
      },
      "uuid": "ad633998-41ea-11ea-b77f-2e728ce88125",
      "value": "OSRS Ransomware: Clop Ransomware"
    },
	{
      "description": "Cr1ptT0r ransomware is built for embedded systems targets network attached storage (NAS) equipment exposed to the internet to encrypt data available on it. The malware drops two plain text files on the infected devices. One is the ransom note called _FILES_ENCRYPTED_README.txt, which gives information to the victim on how to get more details about what happened and how to reach the ransomware operators to pay the ransom in exchange for the file decryption key. The other text file has the name _cr1ptt0r_support.txt and stores the address of a website in the Tor network. This is a support URL that victims can provide if they are at a loss about what to do; it enables a remote shell on an infected device if it is online. The Cr1ptT0r group member added that the URLs and IP addresses are not logged, so there is no correlation between data and the victim.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Ransomware"
        ],
        "refs": [
          "https://www.bleepingcomputer.com/news/security/cr1ptt0r-ransomware-infects-d-link-nas-devices-targets-embedded-systems/"
        ]
      },
      "uuid": "ad633cb8-41ea-11ea-b77f-2e728ce88125",
      "value": "OSRS Ransomware: Cr1ptT0r"
    },
	{
      "description": "Cyborg ransomware uses the open source service GitHub to download new code to infected systems. The Github account Cyborg-Ransomware contains two repositories - Cyborg-Builder-Ransomware, and Cyborg-russian-version. The first repository has the ransomware builder binaries while the second one contains a link to the Russian version of the said builder hosted at another website. The Cyborg Ransomware can be created and spread by anyone who gets hold of the builder. It can be spammed using other themes and be attached in different forms to evade email gateways. Attackers can craft this ransomware to use a known ransomware file extension to mislead the infected user from the identity of this ransomware.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Ransomware"
        ],
        "refs": [
          "https://www.trustwave.com/en-us/resources/blogs/spiderlabs-blog/fake-windows-update-spam-leads-to-cyborg-ransomware-and-its-builder/"
        ]
      },
      "uuid": "ad634046-41ea-11ea-b77f-2e728ce88125",
      "value": "OSRS Ransomware: Cyborg Ransomware"
    },
	{
      "description": "When DeathRansom was first being distributed, it pretended to encrypt files, but researchers and users found that they could just remove the appended .wctc extension and the files would become usable again. Starting around November 20th, though, something changed. Not only were victim's files actually becoming encrypted, but there was a surge of submissions related to DeathRansom on the ransomware identification site, ID Ransomware. when DeathRansom is launched it will attempt to clear shadow volume copies. It will then encrypt all files on the victim's computer other than those found whose full pathnames contain the following strings - programdata, recycle.bin, program files, windows, all users, appdata, read_me.txt, autoexec.bat, desktop.ini, autorun.inf, ntuser.dat, iconcache.db, bootsect.bak, boot.ini, ntuser.dat.log, and thumbs.db. Unlike the previous non-encryption version, the working DeathRansom variants do not append an extension to encrypted files and they just retain their original name. The data in these files is encrypted. In every folder that a file is encrypted, the ransomware will create a ransom note named read_me.txt that contains a unique LOCK-ID for the victim and an email address to contact the ransomware developer or affiliate. One strange thing that was noticed is that numerous victims who have been infected by DeathRansom were also infected by the STOP Ransomware.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Ransomware"
        ],
        "refs": [
          "https://www.bleepingcomputer.com/news/security/new-deathransom-ransomware-begins-to-make-a-name-for-itself/"
        ]
      },
      "uuid": "ad6341b8-41ea-11ea-b77f-2e728ce88125",
      "value": "OSRS Ransomware: DeathRansom Ransomware"
    },
	{
      "description": "The first known victims of DoppelPaymer were targeted in June 2019. Earlier builds are missing many of the new features found in later variants, so it is not clear if they were deployed to victims or if they were simply built for testing. So far there have been eight distinct variant builds and three confirmed victims with ransom amounts of 2 BTC, 40 BTC and 100 BTC. Based on the USD to BTC exchange rate these ransom amounts vary from approximately $25,000 to over $1,200,000. The ransom note used by DoppelPaymer is similar to those used by the original BitPaymer in 2018. The note does not include the ransom amount; however, it does contain a URL for a TOR-based payment portal, and instead of using the keyword KEY to identify the encrypted key.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Ransomware"
        ],
        "refs": [
          "https://www.crowdstrike.com/blog/doppelpaymer-ransomware-and-dridex-2/"
        ]
      },
      "uuid": "ad6342ee-41ea-11ea-b77f-2e728ce88125",
      "value": "OSRS Ransomware: DoppelPaymer Ransomware"
    },
	{
      "description": "Ransomware fully written in PowerShell. Delievered via fake documents. Uses JasperLoader for backdoor capabilities. FTCODE checks for all the drives with at least 50 KB of free space. After finding any files that end with particular extensions it encrypts the first 40960 bytes of each of them using the Rijndael symmetric key encryption. The key is created based on the previous generated key and the hardcoded string BXCODE hack your system. The initialization vector is also based on another hardcoded string BXCODE INIT. Finally it appends the extension .FTCODE and creates the file READ_ME_NOW.htm in the folders that contain the encrypted files.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Ransomware"
        ],
        "refs": [
          "https://www.certego.net/en/news/malware-tales-ftcode/"
        ]
      },
      "uuid": "ad63441a-41ea-11ea-b77f-2e728ce88125",
      "value": "OSRS Ransomware: FTCode"
    },
	{
      "description": "It is a Delphi binary that sometimes comes packed. It was mainly distributed during February and March of 2019. It implements the expected behavior of ransomware, discovering local drives and network shares and encrypting files found on these devices. It doesn’t require an internet connection to encrypt its victims’ files, since it doesn’t communicate with a server to send the encryption keys. Instead, it appends a token at the end of the ransom message and demands that the victims communicate with the operators via email or Bitmessage.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Ransomware"
        ],
        "refs": [
          "https://www.welivesecurity.com/2019/04/30/buhtrap-backdoor-ransomware-advertising-platform/"
        ]
      },
      "uuid": "ad63453c-41ea-11ea-b77f-2e728ce88125",
      "value": "OSRS Ransomware: Filecoder.Buhtrap"
    },
	{
      "description": "A new ransomware has been discovered called FuxSocy that borrows much of its behavior from the notorious and now-defunct Cerber Ransomware. Discovered by MalwareHunterTeam, this ransomware calls itself FuxSocy Encryptor, which is named after the FSociety hacking group in the Mr. Robot television series.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Ransomware"
        ],
        "refs": [
          "https://www.bleepingcomputer.com/news/security/new-fuxsocy-ransomware-impersonates-the-notorious-cerber/"
        ]
      },
      "uuid": "ad634668-41ea-11ea-b77f-2e728ce88125",
      "value": "OSRS Ransomware: FuxSocy Ransomware"
    },
	{
      "description": "Win.Ransomware.Generickdz is often a generic detection name for a Windows trojan. This particular signature detects malware in the Ursnif family. Ursnif is used to steal sensitive information from an infected host and can also act as a malware downloader.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Ransomware"
        ],
        "refs": [
          "https://blog.talosintelligence.com/2019/02/threat-roundup-0125-0201.html"
        ]
      },
      "uuid": "e86028da-41ea-11ea-b77f-2e728ce88125",
      "value": "OSRS Ransomware: Generickdz"
    },
	{
      "description": "After compromising a computer and deleting files, GermanWiper leaves a ransom note indicating that the data was encrypted and would not be decrypted unless a BTC ammount is transferred to a listed bitcoin address. Even if a victim pays the ransom, the money is wasted because the malware does not encrypt the data but overwrites it with zeroes and ones; destroying it. GermanWiper is being distributed in Germany through a spam campaign that pretends to be a job applicant who is submitting their resume. When GermanWiper is first executed, it terminates processes associated with database and other software so that the files can be accessed and wiping becomes possible. It then scans the system for files to destroy.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Ransomware"
        ],
        "refs": [
          "https://www.computing.co.uk/ctg/news/3080040/germanwiper-ransomware-erases-data",
		  "https://www.bleepingcomputer.com/news/security/germanwiper-ransomware-erases-data-still-asks-for-ransom/"
        ]
      },
      "uuid": "e8602b46-41ea-11ea-b77f-2e728ce88125",
      "value": "OSRS Ransomware: GermanWiper"
    },
	{
      "description": "An open-source form of ransomware that is widely available and was available on GitHub for a time. Like various forms of ransomware before it, the code encrypts files and demands a ransom payments with the addition of threats that files will be deleted every two hours until such time that the ransom payment is made.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Ransomware"
        ],
        "refs": [
          "https://siliconangle.com/2019/08/21/fortnite-players-targeted-ransomware-fake-aimbot/"
        ]
      },
      "uuid": "e8602c90-41ea-11ea-b77f-2e728ce88125",
      "value": "OSRS Ransomware: Hidden-Cry"
    },
	{
      "description": "Ransomware. This is a trojan horse virus that may steal information from the affected machine and download potentially malicious files that spread via removable drives.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Ransomware"
        ],
        "refs": [
          "https://blog.talosintelligence.com/2018/12/threat-roundup-1130-1207.html"
        ]
      },
      "uuid": "e8602dc6-41ea-11ea-b77f-2e728ce88125",
      "value": "OSRS Ransomware: Imps"
    },
	{
      "description": "The ransomware was involved in the attacks observed by the Qihoo 360 Threat Intelligence Center in the wild, threat actors used an archive named vk_4221345.rar that delivers JNEC.a when its contents are extracted with a vulnerable version of WinRAR. The vulnerability, tracked as CVE-2018-20250, was discovered by experts at Check Point in February, it could allow an attacker to gain control of the target system. The flaw is an “Absolute Path Traversal” issue in the library that could be exploited to execute arbitrary code by using a specially-crafted file archive. The JNEC.a ransomware also drops a ransom note (JNEC.README.TXT) on the infected computer to provide instructions on how to make the payment. JNEC.a is written in .NET, when the archive is decompressed it shows a corrupted image of a girl that triggers an error and shows an incomplete picture, meanwhile the ransomware is already delivered to the computer.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Ransomware"
        ],
        "refs": [
          "https://securityaffairs.co/wordpress/82606/malware/jnec-a-ransomware-winrar.html"
        ]
      },
      "uuid": "e8602efc-41ea-11ea-b77f-2e728ce88125",
      "value": "OSRS Ransomware: JNEC.a"
    },
	{
      "description": "JSWorm encrypts all the user files appending a new extension to their name. Unlike other ransomware, the extension is composed by many fields, reporting the information the user needs to move on the ransom payment phase. These fields are the same shown in the ransom note, that are Filename.originalExtension.Infection_ID-Attacker_email.JSWRM.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Ransomware"
        ],
        "refs": [
          "https://blog.yoroi.company/research/jsworm-the-4th-version-of-the-infamous-ransomware/"
        ]
      },
      "uuid": "e8603262-41ea-11ea-b77f-2e728ce88125",
      "value": "OSRS Ransomware: JSWorm Ransomware"
    },
	{
      "description": "Thousands of web servers have been infected and had their files encrypted by a new strain of ransomware named Lilocked (or Lilu). Infections have been happening since mid-July, and have intensified in the past two weeks, ZDNet has learned. Based on current evidence, the Lilocked ransomware appears to target Linux-based systems only. First reports date to mid-July, after some victims uploaded the Lilocked ransom note/demand on ID Ransomware, a website for identifying the name of the ransomware that infected a victim's system.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Ransomware"
        ],
        "refs": [
          "https://www.zdnet.com/article/thousands-of-servers-infected-with-new-lilocked-lilu-ransomware/"
        ],
        "synonyms": [
        "Lilu"
        ]
      },
      "uuid": "e86033b6-41ea-11ea-b77f-2e728ce88125",
      "value": "OSRS Ransomware: Lilocked"
    },
	{
      "description": "Despite its evocative nickname, the functionalities of this malware are pretty straight forward, not very different from those belonging to many other ransomware families, but digging into its internals we also found elements suggesting its operators could be able to run large scale campaigns.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Ransomware"
        ],
        "refs": [
          "https://blog.yoroi.company/research/loocipher-the-new-infernal-ransomware/"
        ]
      },
      "uuid": "e86034ec-41ea-11ea-b77f-2e728ce88125",
      "value": "OSRS Ransomware: LooCipher"
    },
	{
      "description": "A Windows Security Scanner that states it encrypted your files and is distributed by links in malicious emails. This ransomware targets only certain file extension under the C Users folder. Files that have been encrypted by Lost Files will have the extension .Lost_Files_Encrypt.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Ransomware"
        ],
        "refs": [
          "https://www.bleepingcomputer.com/news/security/lost-files-data-wiper-poses-as-a-windows-security-scanner/"
        ]
      },
      "uuid": "e8603618-41ea-11ea-b77f-2e728ce88125",
      "value": "OSRS Ransomware: Lost Files Ransomware"
    },
	{
      "description": "A variant of the Maze Ransomware, otherwise known as the ChaCha Ransomware, has been spotted being distributed by the Fallout exploit kit. An interesting feature of this ransomware is that it says the ransom amount will be different depending on whether the victim is a home computer, server, or workstation. The Maze Ransomware utilizes RSA and ChaCha20 encryption as part of the encryption process. It generates an RSA pair on run, so the private of that is likely protected by a master RSA key, and the public is used to encrypt the ChaCha keys for individual files. When executed, the ransomware will scan for files to encrypt and append different extensions to the files.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Ransomware"
        ],
        "refs": [
          "https://www.bleepingcomputer.com/news/security/maze-ransomware-says-computer-type-determines-ransom-amount/"
        ],
        "synonyms": [
        "ChaCha Ransomware"
        ]
      },
      "uuid": "e8603744-41ea-11ea-b77f-2e728ce88125",
      "value": "OSRS Ransomware: Maze Ransomware"
    },
	{
      "description": "A new ransomware called MedusaLocker is being actively distributed and victims have been seen from all over the world. It is not known at this time, how the attacker is distributing the ransomware. This new ransomware was found by MalwareHunterTeam at the end of September 2019.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Ransomware"
        ],
        "refs": [
          "https://www.bleepingcomputer.com/news/security/medusalocker-ransomware-wants-its-share-of-your-money/"
        ]
      },
      "uuid": "3aaf1568-41ed-11ea-b77f-2e728ce88125",
      "value": "OSRS Ransomware: MedusaLocker"
    },
	{
      "description": "MegaCortex employs leverages both automated and manual components, and appears to involve a high amount of automation to infect a greater number of victims. In attacks, the attackers used a common red-team attack tool script to invoke a meterpreter reverse shell in the victim’s environment. From the reverse shell, the infection chain uses PowerShell scripts, batch files from remote servers, and commands that only trigger the malware to drop encrypted secondary executable payloads that had been embedded in the initial dropped malware on specified machines.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Ransomware"
        ],
        "refs": [
          "https://news.sophos.com/en-us/2019/05/03/megacortex-ransomware-wants-to-be-the-one/"
        ]
      },
      "uuid": "3aaf17d4-41ed-11ea-b77f-2e728ce88125",
      "value": "OSRS Ransomware: MegaCortex"
    },
	{
      "description": "The name of the ransomware comes after the extension it adds to the encrypted file names, the malicious code also deletes their shadow copies to make in impossible any recovery procedure. Attackers demand the payment of a 0.09981 BTC ransom through a portal hosted on the Tor network. Nemty ransomware is dropped via compromised remote desktop connections.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Ransomware"
        ],
        "refs": [
          "https://securityaffairs.co/wordpress/90396/malware/nemty-ransomware.html"
        ]
      },
      "uuid": "3aaf1914-41ed-11ea-b77f-2e728ce88125",
      "value": "OSRS Ransomware: Nemty Ransomware"
    },
	{
      "description": "Name NextCry given due to the extension appended to encrypted files and the fact that it targets clients of the NextCloud file sync and share service. NextCry is a Python script compiled in a Linux ELF binary using pyInstaller. AES‌-256 is used for encryption and the key is encrypted with an RSA-2048 public key embedded in the malware code.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Ransomware"
        ],
        "refs": [
          "https://www.bleepingcomputer.com/news/security/new-nextcry-ransomware-encrypts-data-on-nextcloud-linux-servers/"
        ]
      },
      "uuid": "3aaf1a40-41ed-11ea-b77f-2e728ce88125",
      "value": "OSRS Ransomware: NextCry Ransomware"
    },
	{
      "description": "It is a battle with no holds barred between T-Series and PewDiePie, their fans are spreading the PewDiePie ransomware to force users to subscribe to PewDiePie Youtube channel. The story I’m going to tell you is another chapter of the battle between the most followed Youtuber T-Series and PewDiePie. T-Series is an Indian music company, while PewDiePie a Youtuber whom fans are accused to use any means to increase the number of subscribers to its channel.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Ransomware"
        ],
        "refs": [
          "https://securityaffairs.co/wordpress/82843/malware/pewdiepie-ransomware.html",
		  "https://blog.trendmicro.com/trendlabs-security-intelligence/upnp-enabled-connected-devices-in-home-unpatched-known-vulnerabilities/"
        ]
      },
      "uuid": "3aaf1d9c-41ed-11ea-b77f-2e728ce88125",
      "value": "OSRS Ransomware: PewDiePie"
    },
	{
      "description": "The malware is carefully designed to evade detection, hiding malicious or dubious behavior in sandbox environments, posing as the Crypto++ cryptographic library, and using functions normally seen in libraries for music playback. For instance, if the malware determines that it's running in a debugger environment, it exits straight away. Furthermore, the payload deletes itself after execution. As far as file encryption is concerned, PureLocker is not different from other ransomware. It uses AES and RSA algorithms and leaves no recovery option by deleting the shadow copies. The malware does not lock all files on a compromised system, avoiding executables. Encrypted items are easy to recognize by the .CR1 extension that is appended after the process.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Ransomware"
        ],
        "refs": [
          "https://www.bleepingcomputer.com/news/security/purelocker-ransomware-can-lock-files-on-windows-linux-and-macos/"
        ]
      },
      "uuid": "3aaf1edc-41ed-11ea-b77f-2e728ce88125",
      "value": "OSRS Ransomware: PureLocker Ransomware"
    },
	{
      "description": "We have named the ransomware QNAPCrypt, as this is the name the authors have appeared to label the malware. QNAP is a well-known vendor for selling NAS servers, which the malware was intended to infect and encrypt the containing files for ransom. NAS servers normally store large amounts of important data and files, which make them a valuable target for attackers and especially a viable target for ransomware campaigns.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Ransomware"
        ],
        "refs": [
          "https://www.intezer.com/blog-seizing-15-active-ransomware-campaigns-targeting-linux-file-storage-servers/"
        ]
      },
      "uuid": "3aaf2008-41ed-11ea-b77f-2e728ce88125",
      "value": "OSRS Ransomware: QNAPCrypt"
    },
	{
      "description": "Originally discovered delivering the Gandcrab ransomware family by Cisco Talos researchers. Not long after its first discovery the Gandcrab site declared it would be ending its service. It is believed that REvil is the newer version of Gandcrab. It was also observed leveraging CVE-2018-8453, a privilege escalation vulnerability on Windows systems.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Ransomware"
        ],
        "refs": [
          "https://krebsonsecurity.com/2019/07/is-revil-the-new-gandcrab-ransomware/",
		  "https://www.zdnet.com/article/sodinokibi-ransomware-is-now-using-a-former-windows-zero-day/"
        ],
        "synonyms": [
        "Sodin",
		"Sodinokibi"
        ]
      },
      "uuid": "3aaf2134-41ed-11ea-b77f-2e728ce88125",
      "value": "OSRS Ransomware: REvil"
    },
	{
      "description": "The ransomware only targets files on a single system and does not spread through network shares. The ransomware itself does not have any network spreading capabilities. Additionally, the ransomware requires previously obtained administrative priviliges per system. RobbinHood also requires that a public RSA key already be present on the targeted computer in order to begin encryption of the files. Before it begins encryption, RobbinHood malware shuts down all connections to shared network directories with a net use command. The ransomware then runs through 181 Windows service shutdown commands—including the disabling of multiple malware-protection tools, backup agents, and email, database, and Internet Information Server (IIS) administrative services.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Ransomware"
        ],
        "refs": [
          "https://arstechnica.com/information-technology/2019/05/baltimore-city-government-hit-by-robbinhood-ransomware/",
		  "https://securityboulevard.com/2019/04/robbinhood-ransomware-demands-grow-10k-per-day-after-fourth-day/"
        ]
      },
      "uuid": "3aaf2256-41ed-11ea-b77f-2e728ce88125",
      "value": "OSRS Ransomware: RobbinHood Ransomware"
    },
	{
      "description": "Ransomware sometimes delievered via the GreenFlash Sundown exploit kit.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Ransomware"
        ],
        "refs": [
          "https://blog.malwarebytes.com/threat-analysis/2019/06/greenflash-sundown-exploit-kit-expands-via-large-malvertising-campaign/"
        ]
      },
      "uuid": "3aaf2378-41ed-11ea-b77f-2e728ce88125",
      "value": "OSRS Ransomware: SEON Ransomware"
    },
	{
      "description": "Attackers are actively exploiting a recently disclosed vulnerability in Oracle WebLogic to install a new variant of ransomware called Sodinokibi. Sodinokibi attempts to encrypt data in a user's directory and delete shadow copy backups to make data recovery more difficult. Oracle first patched the issue on April 26, outside of their normal patch cycle, and assigned it CVE-2019-2725.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Ransomware"
        ],
        "refs": [
          "https://blog.talosintelligence.com/2019/04/sodinokibi-ransomware-exploits-weblogic.html"
        ]
      },
      "uuid": "66f83b54-41ed-11ea-b77f-2e728ce88125",
      "value": "OSRS Ransomware: Sodinokibi"
    },
	{
      "description": "Ransomware that uses the code from the Hidden-Cry ransomware family. Used to target gamers who play the online shooter Fortnite.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Ransomware"
        ],
        "refs": [
          "https://siliconangle.com/2019/08/21/fortnite-players-targeted-ransomware-fake-aimbot/"
        ]
      },
      "uuid": "66f83dc0-41ed-11ea-b77f-2e728ce88125",
      "value": "OSRS Ransomware: Syrk Ransomware"
    },
	{
      "description": "TFlower is being installed in a corporate network through exposed Remote Desktop services that are being hacked by attackers. Once the attackers gain access to the machine, they will infect the local machine or may attempt to traverse the network through tools such as PowerShell Empire, PSExec, etc. When executed, the ransomware will display a console that shows the activity being performed by the ransomware while it is encrypting a computer.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Ransomware"
        ],
        "refs": [
          "https://www.bleepingcomputer.com/news/security/tflower-ransomware-the-latest-attack-targeting-businesses/"
        ]
      },
      "uuid": "66f844dc-41ed-11ea-b77f-2e728ce88125",
      "value": "OSRS Ransomware: TFlower Ransomware"
    },
	{
      "description": "It is not confirmed what infection vectors are employed in propagating the Unlock11@protonmail.com Ransomware. However, it is likely that the creators of the Unlock11@protonmail.com Ransomware may be relying on spam emails containing corrupted attachments, faux application updates, and infected pirated software to spread their threat. Once a system is infiltrated by the Unlock11@protonmail.com Ransomware, the threat would begin a scan. The scan is meant to determine the locations of the files, which the Unlock11@protonmail.com Ransomware is targeting. Then, the Unlock11@protonmail.com Ransomware would start encrypting the targeted data. Once a file is locked by the Unlock11@protonmail.com Ransomware, it will add an extra extension – [Unlock11@protonmail.com].enc. This means that if this threat encrypts a file named white-possum.jpg, it will change the name of the affected file to white-possum.jpg. [Unlock11@protonmail.com].enc. When the encryption process is through, the Unlock11@protonmail.com Ransomware will drop its ransom note. The note is named ReadMeToDecrypte.txt. In the note, the attackers claim to have used the AES-128 and RSA-2048 encryption algorithms. They also offer to unlock three files for free, as long as they do not exceed 5MB in size. However, the attackers do not mention what the ransom fee required is. They do give out an email address where they are meant to be contacted – Unlock11@protonmail.com.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Ransomware"
        ],
        "refs": [
          "https://www.enigmasoftware.com/unlock11protonmailcomransomware-removal/",
		  "https://www.computips.org/how-to-remove-unlock11protonmail-com/"
        ]
      },
      "uuid": "66f84658-41ed-11ea-b77f-2e728ce88125",
      "value": "OSRS Ransomware: Unlock11@protonmail.com Ransomware"
    },
	{
      "description": "A new ransomware called Unnam3d R@nsomware is being distributed via email that will move a victim's files into password protected RAR archives. The ransomware then demands a 50 dollar Amazon gift card code in order to get the archive password.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Ransomware"
        ],
        "refs": [
          "https://www.bleepingcomputer.com/news/security/unnam3d-ransomware-locks-files-in-protected-archives-demands-gift-cards/"
        ]
      },
      "uuid": "66f84798-41ed-11ea-b77f-2e728ce88125",
      "value": "OSRS Ransomware: Unnam3d R@nsomware"
    },
	{
      "description": "Ransomware that tagets network attached storage devices.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Ransomware"
        ],
        "refs": [
          "https://www.anomali.com/blog/the-ech0raix-ransomware"
        ]
      },
      "uuid": "66f848ce-41ed-11ea-b77f-2e728ce88125",
      "value": "OSRS Ransomware: eCh0raix Ransomware"
    },
	{
      "description": "Jcry is written in Go language via #OpJerusalem2019 campaign that attack Windows users to encrypt the file and demand the ransom.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Ransomware"
        ],
        "refs": [
          "https://malpedia.caad.fkie.fraunhofer.de/details/win.jcry",
		  "https://gbhackers.com/jcry-ransomware/"
        ]
      },
      "uuid": "66f849fa-41ed-11ea-b77f-2e728ce88125",
      "value": "OSRS Ransomware: jCry"
    },
	{
      "description": "This new ransomware began operating in late 2019 and has since encrypted a stream of victims ranging from local cities to organizations. The ransom amounts being demanded by PwndLocker range from $175,000 to over $660,000 depending on the size of the network. when executed PwndLocker will attempt to disable a variety of Windows services using the net stop command so that their data can be encrypted. Some of the applications whose services are targeted include Veeam, Microsoft SQL Server, MySQL, Exchange, Acronis, Zoolz, Backup Exec, Oracle, Internet Information Server (IIS), and security software such as Kaspersky, Malwarebytes, Sophos, and McAfee. The ransomware will also target various processes and terminate them if detected. Some of the processes targeted include Firefox, Word, Excel, Access, and other processes related to security software, backup applications, and database servers. PwndLocker will now clear the Shadow Volume Copies so that they cannot be used to recover files. While encrypting files, it will skip any files that contain one of the following extensions - .exe, .dll, .lnk, .ico, .ini, .msi, .chm, .sys, .hlf, .lng, .inf, .ttf, .cmd, .bat, .vhd, .bac, .bak, .wbc, .bkf, .set, .win, and .dsk. Encrypted files use the .key and .pwnd extensions depending on the victim. When done encrypting, ransom notes named H0w_T0_Rec0very_Files.txt will be located throughout the computer and on the Windows desktop. These ransom notes will contain an email address and Tor payment site that can be used to get payment instructions and the ransom amount.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Ransomware"
        ],
        "refs": [
          "https://www.bleepingcomputer.com/news/security/new-pwndlocker-ransomware-targeting-us-cities-enterprises/"
        ]
      },
      "uuid": "7a165c3c-652b-11ea-bc55-0242ac130003",
      "value": "OSRS Ransomware: PwndLocker Ransomware"
    },
	{
      "description": "The name PXJ is derived from the file extension that is appended to encrypted files, whereas the alternative name, XVFXGW, is based off both the mutex the malware creates. This code has emerged in the wild in early 2020, and while it performs functions common to most ransomware, it does not appear to share underlying code with known ransomware families. Of the two samples we have analyzed so far, one was packed using UPX, an open-source executable packer, while the other did not leverage any packing. PXJ begins by disabling the user’s ability to recover any files from deleted stores and shadow copies. To prevent potential recovery by breaking the encryption, PXJ uses both AES and RSA algorithms to lock data down. With encryption complete, the ransom note is dropped as a file named LOOK.txt and requests that the user contact the operator via email to pay the ransom in exchange for the decryption key.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Ransomware"
        ],
        "refs": [
          "https://securityintelligence.com/posts/pxj-ransomware-campaign-identified-by-x-force-iris/"
        ],
        "synonyms": [
        "XVFXGW Ransomware"
        ]
      },
      "uuid": "573156ee-6874-11ea-bc55-0242ac130003",
      "value": "OSRS Ransomware: PXJ Ransomware"
    },
	{
      "description": "Ransomware called CoronaVirus has been distributed through a fake web site pretending to promote the system optimization software and utilities from WiseCleaner. With the increasing fears and anxiety of the Coronavirus (COVID-19) outbreak, an attacker has started to build a campaign to distribute a malware cocktail consisting of the CoronaVirus Ransomware and the Kpot information-stealing Trojan. To distribute the malware, the attackers have created a web site that impersonates the legitimate Windows system utility site WiseCleaner.com. Files that are encrypted will be renamed so that it continues to use the same extension, but the file name will be changed to the attacker's email address.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Ransomware"
        ],
        "refs": [
          "https://www.bleepingcomputer.com/news/security/new-coronavirus-ransomware-acts-as-cover-for-kpot-infostealer/"
        ]
      },
      "uuid": "57315928-6874-11ea-bc55-0242ac130003",
      "value": "OSRS Ransomware: CoronaVirus Ransomware"
    },
	{
      "description": "In August 2019 a new ransomware was spotted in ID Ransomware that was named Mailto based on the extension that was appended to encrypted files. The executable attempts to impersonate the Sticky Password software. When executed, the ransomware uses an embedded config that includes the ransom note template, ransom note file names, length of id/extension, whitelisted files, folders, and extensions, and various other configuration options. When encrypting files, the Mailto ransomware will append an extension using the format .mailto.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Ransomware"
        ],
        "refs": [
          "https://www.bleepingcomputer.com/news/security/mailto-netwalker-ransomware-targets-enterprise-networks/"
        ],
        "synonyms": [
        "Mailto Ransomware"
        ]
      },
      "uuid": "57315a4a-6874-11ea-bc55-0242ac130003",
      "value": "OSRS Ransomware: NetWalker Ransomware"
    },
	{
      "description": "CovidLock is a new Android ransomware that conducts a lock-screen attack against its victims. As a bit of background, Android applications are generally written in Java. The Java class bytecode is converted to dex bytecode using a Dex compiler. From there, the dex bytecode is ingested and executed in the Android Runtime (ART). Android applications can listen for the BOOT_COMPLETED broadcast to ensure the application will be activated upon device start up, and this is how CovidLock achieves its persistence mechanism.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Ransomware"
        ],
        "refs": [
          "https://www.domaintools.com/resources/blog/covidlock-update-coronavirus-ransomware"
        ]
      },
      "uuid": "57315be4-6874-11ea-bc55-0242ac130003",
      "value": "OSRS Ransomware: CovidLock Ransomware"
    },
	{
      "description": "Nefilim became active at the end of February 2020 and while it not known for sure how the ransomware is being distributed, it is most likely through exposed Remote Desktop Services. The main difference is that Nefilim has removed the Ransomware-as-a-Service (RaaS) component and now relies on email communications for payments rather than a Tor payment site. In the Nefilim ransom note, the attackers state that if a user does not pay the ransom in seven days they will release data that was stolen from the network. When encrypting files, Nefilim will encrypt a file using AES-128 encryption. This AES encryption key will then be encrypted by an RSA-2048 public key that is embedded in the ransomware executable. This encrypted AES key will then be added to the contents of each encrypted file and can only be decrypted by the RSA private key known to the ransomware developers. For each encrypted file, Nefilim will append the .NEFILIM extension to the file name. For example, a file called 1.doc would be encrypted and named 1.doc.NEFILIM. When done, a ransom note named NEFILIM-DECRYPT.txt will be created throughout the system that contains instructions on how to contact the ransomware developers.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Ransomware"
        ],
        "refs": [
          "https://www.bleepingcomputer.com/news/security/new-nefilim-ransomware-threatens-to-release-victims-data/"
        ]
      },
      "uuid": "6f164b94-691d-11ea-bc55-0242ac130003",
      "value": "OSRS Ransomware: Nefilim Ransomware"
    },
	{
      "description": "According to the experts, the first infections were observed in late 2019, victims reported their files were encrypted by a strain of malware. The malicious code appended the extension .locked to the filename of the encrypted files. The Mespinoza ransomware evolved over time, and in December a new version appeared in the threat landscape. This new version used the .pysa file extension that gives the name to this piece ransomware. According to the report issued by the CERT-FR, operators behind the Pysa ransomware launched brute-force attacks against management consoles and Active Directory accounts. Once compromised the target network, attackers attempt to exfiltrate the company’s accounts and passwords database. Operators behind the Pysa ransomware, also employed a version of the PowerShell Empire penetration-testing tool, they were able to stop antivirus products.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Ransomware"
        ],
        "refs": [
          "https://securityaffairs.co/wordpress/99996/malware/cert-france-pysa-ransomware.html"
        ],
        "synonyms": [
        "Mespinoza"
        ]
      },
      "uuid": "3e85102a-6d3f-11ea-bc55-0242ac130003",
      "value": "OSRS Ransomware: Pysa Ransomware"
    },
	{
      "description": "Updated version of the PwndLocker ransomware family that introduces new encryption algorithms that do not allow for decryption tools to work.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Ransomware"
        ],
        "refs": [
          "https://www.bleepingcomputer.com/news/security/pwndlocker-fixes-crypto-bug-rebrands-as-prolock-ransomware/"
        ]
      },
      "uuid": "3e851264-6d3f-11ea-bc55-0242ac130003",
      "value": "OSRS Ransomware: ProLock Ransomware"
    },
	{
      "description": "Observed used by the threat actor group TA505. The main difference between this example and 2019 strain, is the inclusion of the GPG suite files. The batch file would encrypt all the drives on the local machine using the public GPG key brg.brg. Next it will compress the files and send some host based data to the email address zalock@airmail.cc. It would then display the ransomware message to the victim. The visual basic script proceeds to delete the shadow copy of the files as system, using Windows Management Instrumentation. The files that were in the compressed folder are deleted, and following that a web request is sent. During an investigation, researchers identified another folder with the ransomware strain, containing file names that indicate it was from May of 2019. This folder once again contained GPG keys and a public key that is used to encrypt all the local files. There were only a few small differences - the first is that the encrypting functions were written in visual basic instead of as a batch file. In this sample, the batch file simply contained a short script to delete all the downloaded files. Despite the damages this compressed folder could cause, researchers noticed it had a relatively low detection rate.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Ransomware"
        ],
        "refs": [
          "https://blog.prevailion.com/2020/03/the-curious-case-of-criminal-curriculum.html"
        ]
      },
      "uuid": "07414c78-6dee-11ea-bc55-0242ac130003",
      "value": "OSRS Ransomware: GPG Ransomware"
    },
	{
      "description": "Sekmet is a ransomware family with little known information regarding actor and delivery. However, this particular family of ransomware advertises victim data online in order to apply extortion pressure for ransom payment.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Ransomware"
        ],
        "refs": [
          "https://www.bleepingcomputer.com/news/security/three-more-ransomware-families-create-sites-to-leak-stolen-data/"
        ]
      },
      "uuid": "0a09bcb8-6eae-11ea-bc55-0242ac130003",
      "value": "OSRS Ransomware: Sekhmet Ransomware"
    },
	{
      "description": "Ragnar Locker ransomware was first spotted while being used as part of attacks against compromised networks towards the end of December 2019. The Ragnar Locker operators target software regularly used by managed service providers to prevent their attack from being detected and blocked. After reconnaissance and pre-deployment stages, the attackers drop a highly targeted ransomware executable that adds specific extension to encrypted files, features an embedded RSA-2048 key, and drops custom ransom notes. The ransom notes include the victim's company name, a link to the Tor site, and the data leak site with the victim's published data.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Ransomware"
        ],
        "refs": [
          "https://www.bleepingcomputer.com/news/security/ragnarlocker-ransomware-hits-edp-energy-giant-asks-for-10m/"
        ]
      },
      "uuid": "9541f65e-7fe0-11ea-bc55-0242ac130003",
      "value": "OSRS Ransomware: Ragnar Locker Ransomware"
    },
	{
      "description": "Ransomware-as-a-Service. In this most recent evolution of LockBit, the malware now drops a ransom note that threatens to leak data the malware has stolen from victims. The program was written primarily in C++ with some additions made using Assembler. The first thing the ransomware does at execution is to check whether the sample was executed with any parameters added from the command line. The Portable Executable (PE) binary shows signs of being heavily optimized. Those heavy optimizations also increase LockBit’s performance. The binary makes heavy use of Intel’s SSE instruction set and architecture-specific features to boost its performance. That includes the use of multiple XMM registers used to store and decrypt the service names, process names and other strings used to interact with the operating system that are unique to the ransomware. Almost all the functions contain a small routine that loops around and is in charge of decrypting hidden strings. To ensure that it can do the most damage possible, LockBit has a procedure to check whether its process has Administrator privileges. And if it doesn’t, it uses a technique that is growing in popularity among malware developers: a Windows User Account Control (UAC) bypass. LockBit enumerates the currently running processes and started services via the API calls CreateToolhelp32Snapshot, Process32First, Process32Next and finally OpenProcess, and compares the names against an internal service and process list. If one process matches with one on the list, LockBit will attempt to terminate it via TerminateProcess.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Ransomware"
        ],
        "refs": [
          "https://news.sophos.com/en-us/2020/04/24/lockbit-ransomware-borrows-tricks-to-keep-up-with-revil-and-maze/"
        ]
      },
      "uuid": "abd3ca3c-8af8-11ea-bc55-0242ac130003",
      "value": "OSRS Ransomware: LockBit Ransomware"
    },
	{
      "description": "The malware starts by registering a receiver called to run BOOT_COMPLETE and QUICKBOOT_POWERON to check if the country code of the device is from a former Soviet state. Lucy then tries to trick the victim into enabling the Accessibility Service by initiating an Alert Dialog that asks the user to take action. Inside the MainActivity module, the application triggers the malicious service, which then registers a BroadcastReceiver that is called by the command action.SCREEN_ON and then calls itself. This is used to acquire the WakeLock service, which keeps the device’s screen on, and WifiLock service, which keeps the WIFI on. Communication - The malware has 4 encrypted command and control (C&C) servers in its code. Unlike previous versions of the malware, the C&C is a domain and not an IP address. Therefore, although the server can be taken down, it can easily be resolved into a new IP address, which makes it much harder to neutralize the malware. The C&C servers are held as a long string which is a concatenation of all C&Cs hardcoded in the malware’s code, followed by a bulk of unused data.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Ransomware"
        ],
        "refs": [
          "https://research.checkpoint.com/2020/lucys-back-ransomware-goes-mobile/"
        ],
        "synonyms": [
        "Black Rose Lucy Ransomware"
        ]
      },
      "uuid": "07eb9b56-29bf-11ea-978f-2e728ce88125",
      "value": "OSRS Ransomware: Lucy Ransomware"
    },
	{
      "description": "VCrypt is targets French victims by utilizing the legitimate 7zip command-line program to create password-protected archives of data folders. These encrypted files would utilize a naming format of username_foldername.vxcrypt. When the ransomware is started, the malware will also launch Internet Explorer and display a ransom note named help.html. This ransom note is written in French and tells the user to visit a web page to learn how to get their files back.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Ransomware"
        ],
        "refs": [
          "https://www.bleepingcomputer.com/news/security/new-vcrypt-ransomware-locks-files-in-password-protected-7zips/"
        ]
      },
      "uuid": "07eb9b56-29bf-11ea-978f-2e728ce88125",
      "value": "OSRS Ransomware: VCrypt Ransomware"
    },
	{
      "description": "This attack is potentially destructive as the ransomware appears to target databases and email servers for encryption. Analysis of the malware points to similarities between ColdLock and two previously known ransomware families, specifically Lockergoga, Freezing, and the EDA2 educational ransomware kit. There have been no indications that this attack has hit any other organization outside of those targeted. It is not believed that this family is currently in widespread use. It is believed that the attackers somehow gained access to the target organization’s Active Directory servers. From this point, they were able to set Group Policies that led to the ransomware file being downloaded and run onto machines within the affected domain. The payload arrives as a .NET executable (as a .DLL file), which has been packed-protected using the ConfuserEx packer. It uses PowerShell reflective loading of .NET executables to run the .DLL files.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Ransomware"
        ],
        "refs": [
          "https://blog.trendmicro.com/trendlabs-security-intelligence/targeted-ransomware-attack-hits-taiwanese-organizations/"
        ]
      },
      "uuid": "d40265b6-9545-11ea-bb37-0242ac130002",
      "value": "OSRS Ransomware: ColdLock Ransomware"
    },
	{
      "description": "After the ransomware encrypts a victim’s files, a random extension will be added onto the file name. A file named ako-readme.txt will also be placed onto the locked machines desktop with instructions on how to proceed. Some examples instruct the victim to contact the attackers email address, while others demand bitcoin. The ransom demand examples we’ve seen so far range between 3000-3800 dollars in Bitcoin (btc) with the ransom amount doubling after 2 days.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Ransomware"
        ],
        "refs": [
          "https://www.databreaches.net/ako-ransomware-operators-put-some-hurt-on-pain-management-doctors/",
		  "https://appriver.com/blog/ako-ransomware-targets-networks-via-email"
        ]
      },
      "uuid": "5e751eae-9ad8-11ea-bb37-0242ac130002",
      "value": "OSRS Ransomware: Ako Ransomware"
    },
	{
      "description": "A new ransomware dubbed FuckUnicorn has been targeting computers in Italy by tricking victims into downloading a fake contact tracing app, named Immuni, that promises to provide real-time updates for the COVID-19 outbreak.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Ransomware"
        ],
        "refs": [
          "https://securityaffairs.co/wordpress/103817/malware/fuckunicorn-ransomware.html",
		  "https://cert-agid.gov.it/news/campagna-ransomware-fuckunicorn-sfrutta-emergenza-covid-19/"
        ],
        "synonyms": [
        "FkUnicorn Ransomware"
        ]
      },
      "uuid": "048d611e-a666-11ea-bb37-0242ac130002",
      "value": "OSRS Ransomware: FuckUnicorn Ransomware"
    },
	{
      "description": "A Java-based ransomware known as PonyFinal has galloped onto the scene, targeting enterprise systems management servers as an initial infection vector. According to a warning on Twitter from Microsoft Security Intelligence on Wednesday, PonyFinal is not an automated threat, but rather has humans pulling the reins. It exfiltrates information about infected environments, spreads laterally and then waits before striking — the operators go on to encrypt files at a later date and time, when the likelihood of the target paying is deemed to be the most likely.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Ransomware"
        ],
        "refs": [
          "https://threatpost.com/ponyfinal-ransomware-enterprise-servers/156083/"
        ]
      },
      "uuid": "048d6344-a666-11ea-bb37-0242ac130002",
      "value": "OSRS Ransomware: PonyFinal Ransomware"
    },
	{
      "description": "Tycoon is a multi-platform Java ransomware targeting Windows and Linux that has been observed in-the-wild since at least December 2019. It is deployed in the form of a Trojanized Java Runtime Environment (JRE) and leverages an obscure Java image format to fly under the radar. The threat actors behind Tycoon were observed using highly targeted delivery mechanisms to infiltrate small to medium sized companies and institutions in education and software industries, where they would proceed to encrypt file servers and demand a ransom. However, due to the reuse of a common RSA private key it may be possible to recover data without the need for payment in earlier variants.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Ransomware"
        ],
        "refs": [
          "https://blogs.blackberry.com/en/2020/06/threat-spotlight-tycoon-ransomware-targets-education-and-software-sectors"
        ]
      },
      "uuid": "eb6da82a-ab50-11ea-bb37-0242ac130002",
      "value": "OSRS Ransomware: Tycoon Ransomware"
    },
	{
      "description": "This ransomware is targeting both personal users and businesses, most likely through exposed remote desktop servers. Once the threat actors gain access, they manually encrypt the files on the victim's computers. When encrypting data, it will append the .kupidon extension to the file's name.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Ransomware"
        ],
        "refs": [
          "https://www.bleepingcomputer.com/news/security/kupidon-is-the-latest-ransomware-targeting-your-data/"
        ]
      },
      "uuid": "eb6dab0e-ab50-11ea-bb37-0242ac130002",
      "value": "OSRS Ransomware: Kupidon Ransomware"
    },
	{
      "description": "Responsible for attacks on the manufacturing sector, including Honda Motor Company.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Ransomware"
        ],
        "refs": [
          "https://www.bleepingcomputer.com/news/security/honda-investigates-possible-ransomware-attack-networks-impacted/"
        ]
      },
      "uuid": "eb6dac1c-ab50-11ea-bb37-0242ac130002",
      "value": "OSRS Ransomware: Snake Ransomware"
    },
	{
      "description": "A fake decryptor for the STOP Djvu Ransomware.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Ransomware"
        ],
        "refs": [
          "https://www.bleepingcomputer.com/news/security/fake-ransomware-decryptor-double-encrypts-desperate-victims-files/"
        ]
      },
      "uuid": "eb6dad3e-ab50-11ea-bb37-0242ac130002",
      "value": "OSRS Ransomware: Zorab Ransomware"
    },
	{
      "description": "When executed, the JS attachment will launch both a PowerShell and Bitsadmin command to download the Avaddon ransomware executable to the Temp folder and run it. Phorphiex (aka Trik) Botnet is distributing the malicious emails containing the ransomware JS file.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Ransomware"
        ],
        "refs": [
          "https://www.bleepingcomputer.com/news/security/new-avaddon-ransomware-launches-in-massive-smiley-spam-campaign/"
        ]
      },
      "uuid": "eb6daece-ab50-11ea-bb37-0242ac130002",
      "value": "OSRS Ransomware: Avaddon Ransomware"
    },
	{
      "description": "Insikt Group uncovered a new family of ransomware for sale on Exploit Forum called Thanos, developed by a threat actor with the alias Nosophoros. Nosophoros offered Thanos as a private ransomware builder with the ability to generate new Thanos ransomware clients based on 43 different configuration options. Recorded Future analyzed the Thanos ransomware builder to detect, understand, and exercise the breadth of functionality that the Thanos ransomware can support. The Thanos client is simple in its overall structure and functionality. It is written in C# and is straightforward to understand even with obfuscation, though it does incorporate some more advanced features such as the RIPlace technique. During this research, we observed an overlap between our detections and a ransomware family called Hakbit. Based on code similarity, string reuse, and core functionality, Insikt Group assesses with high confidence that ransomware samples tracked as Hakbit are built using the Thanos ransomware builder developed by Nosophoros.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Ransomware"
        ],
        "refs": [
          "https://www.recordedfuture.com/thanos-ransomware-builder/"
        ]
      },
      "uuid": "90dec70e-b0b4-11ea-b3de-0242ac130004",
      "value": "OSRS Ransomware: Thanos Ransomware"
    },
	{
      "description": "The bad actor(s) behind Hakbit ransomware recently released an updated variant of their ransomware, which encrypts the victim’s data and demands 3 Bitcoins in ransom payment. This updated variant is delivered via phishing email as a malicious Excel document, and contains added functionality from the original version reported in November 2019. Code references to SharpExec (an offensive security tool used for lateral movement) are found within Hakbit. Lastly a similar technique recently observed in a RYUK ransomware variant that sends a Wake-On-LAN packet to encrypt remote computers on specified local subnet addresses, is also featured in this Hakbit variant.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Ransomware"
        ],
        "refs": [
          "https://www.recordedfuture.com/thanos-ransomware-builder/",
		  "https://www.carbonblack.com/2020/06/08/tau-threat-analysis-hakbit-ransomware/"
        ]
      },
      "uuid": "90dec966-b0b4-11ea-b3de-0242ac130004",
      "value": "OSRS Ransomware: Hakbit Ransomware"
    },
	{
      "description": "Operators of Black Kingdom ransomware are targeting enterprises with unpatched Pulse Secure VPN software or initial access on the network, security researchers have found. The malware got caught in a honeypot, allowing researchers to analyze and document the tactics used by the threat actors. Black Kingdom exploits CVE-2019-11510, a critical vulnerability affecting earlier versions of Pulse Secure VPN that was patched in April 2019. Companies delayed updating their software even after exploits became public, prompting multiple alerts from the U.S. government and threat actors started leveraging it; some organizations continue to run a vulnerable version of the product.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Ransomware"
        ],
        "refs": [
          "https://www.bleepingcomputer.com/news/security/black-kingdom-ransomware-hacks-networks-with-pulse-vpn-flaws/"
        ]
      },
      "uuid": "d1a50762-b6ef-11ea-b3de-0242ac130004",
      "value": "OSRS Ransomware: Black Kingdom Ransomware"
    },
	{
      "description": "WastedLocker is a new ransomware locker researchers detected being used since May 2020. They believe it has been in development for a number of months prior to this and was started in conjunction with a number of other changes we have seen originate from the Evil Corp group in 2020. Evil Corp were previously associated to the Dridex malware and BitPaymer ransomware, the latter came to prominence in the first half of 2017. Recently Evil Corp has changed a number of TTPs related to their operations further described in this article. Researchers believe those changes were ultimately caused by the unsealing of indictments against Igor Olegovich Turashev and Maksim Viktorovich Yakubets, and the financial sanctions against Evil Corp in December 2019. These legal events set in motion a chain of events to disconnect the association of the current Evil Corp group and these two specific indicted individuals and the historic actions of Evil Corp.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Ransomware"
        ],
        "refs": [
          "https://research.nccgroup.com/2020/06/23/wastedlocker-a-new-ransomware-variant-developed-by-the-evil-corp-group/"
        ]
      },
      "uuid": "d1a509e2-b6ef-11ea-b3de-0242ac130004",
      "value": "OSRS Ransomware: WastedLocker Ransomware"
    },
	{
      "description": "CryCryptor has been targeting Android users in Canada, distributed via two websites under the guise of an official COVID-19 tracing app provided by Health Canada. Once the user falls victim to CryCryptor, the ransomware encrypts the files on the device – all the most common types of files – but instead of locking the device, it leaves a readme file with the attacker’s email in every directory with encrypted files.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Ransomware"
        ],
        "refs": [
          "https://www.welivesecurity.com/2020/06/24/new-ransomware-uses-covid19-tracing-guise-target-canada-eset-decryptor/"
        ]
      },
      "uuid": "7c9dabd6-bbca-11ea-b3de-0242ac130004",
      "value": "OSRS Ransomware: CryCryptor Ransomware"
    },
	{
      "description": "Ransom X is being actively used in human-operated and targeted attacks against government agencies and enterprises. May 2020 was not a good month for Texas as both the Texas Courts and the Texas Department of Transportation (TxDOT) were hit with ransomware attacks. At the time of the attacks, it was not known what ransomware targeted the government agencies. As this is human-operated ransomware, rather than one distributed via phishing or malware, when executed the ransomware will open a console that displays information to the attacker while it is running. Ransom.exx will terminate 289 processes related to security software, database servers, MSP software, remote access tools, and mail servers. By bypassing these folders, it allows the attackers to encrypt a computer while also attack other computers on the network without fear their tools will become encrypted.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Ransomware"
        ],
        "refs": [
          "https://www.bleepingcomputer.com/news/security/new-ransom-x-ransomware-used-in-texas-txdot-cyberattack/"
        ]
      },
      "uuid": "7c9dade8-bbca-11ea-b3de-0242ac130004",
      "value": "OSRS Ransomware: Ransom X Ransomware"
    },
	{
      "description": "macOS ransomware.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Ransomware"
        ],
        "refs": [
          "https://blog.malwarebytes.com/mac/2020/06/new-mac-ransomware-spreading-through-piracy/"
        ]
      },
      "uuid": "7c9daee2-bbca-11ea-b3de-0242ac130004",
      "value": "OSRS Ransomware: EvilQuest Ransomware"
    },
	{
      "description": "Try2Cry ransomware adopts USB flash drive spreading using LNK files. The last ransomware that did the same was the infamous Spora. The code of Try2Cry looks oddly familiar, though.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Ransomware"
        ],
        "refs": [
          "https://www.gdatasoftware.com/blog/2020/07/36200-ransomware-tries-to-worm"
        ]
      },
      "uuid": "6871075a-c1ee-11ea-b3de-0242ac130004",
      "value": "OSRS Ransomware: Try2Cry Ransomware"
    },
	{
      "description": "Conti is a new family of ransomware observed in the wild by the Carbon Black Threat Analysis Unit (TAU). Unlike most ransomware, Conti contains  unique features that separate it in terms of performance and focus on network-based targets. Conti uses a large number of independent threads to perform encryption, allowing up to 32 simultaneous encryption efforts, resulting in faster encryption compared to many other families. Conti also utilizes command line options to allow for control over how it scans for data, suggesting that the malware may commonly be spread and directly controlled by an adversary. This control introduces the novel ability of skipping the encryption of local files and only targeting networked SMB shares, including those from IP addresses specifically provided by the adversary. This is a very rare ability that’s previously been seen with the Sodinokibi ransomware family. Another new technique, documented in very few ransomware families, is the use of the Windows Restart Manager to ensure that all files can be encrypted. Just as Windows will attempt to cleanly shut down open applications when the operating system is rebooted, the ransomware will utilize the same functionality to cleanly close the application that has a file locked. By doing so, the file is freed up for encryption.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Ransomware"
        ],
        "refs": [
          "https://www.carbonblack.com/blog/tau-threat-discovery-conti-ransomware/"
        ]
      },
      "uuid": "c90cc004-cce8-11ea-87d0-0242ac130003",
      "value": "OSRS Ransomware: Conti Ransomware"
    },
	{
      "description": "Email scammers always seem to invent new ways of trickery to gain cash from their victims. Researchers recently came across a case where the scammer reused some existing scripts to phish and scam - copy and paste style. With a bit of modification, the script works like ransomware, without the hassle of having to compile a portable executable. This screen locker ransomware variant locks the user's screen and demand a ransom rather than the typical file encryption style ransomware. The ransom demanded in this case was in the form of Google Play Cards.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Ransomware"
        ],
        "refs": [
          "https://www.trustwave.com/en-us/resources/blogs/spiderlabs-blog/lockscreen-ransomware-phishing-leads-to-google-play-card-scam/"
        ]
      },
      "uuid": "cbf92360-d33d-11ea-87d0-0242ac130003",
      "value": "OSRS Ransomware: Lockscreen Ransomware"
    },
	{
      "description": "This first incident occurred in Europe and caught researchers attention for two reasons -  it features a ransomware family researchers were unaware of, and involved a spreading technique reminiscent of APT groups. The ransomware itself is nothing special, it’s written in C++ and crawls all connected disks to encrypt files and delete any folder called System Volume Information (which are linked to Windows restore point feature). The program also stops processes that could be locking important files, such as Microsoft Exchange and SQL Server. Files are encrypted with a combination of AES-256 in ECB mode and RSA-2048.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Ransomware"
        ],
        "refs": [
          "https://securelist.com/lazarus-on-the-hunt-for-big-game/97757/"
        ]
      },
      "uuid": "dc1ca914-d7ee-11ea-87d0-0242ac130003",
      "value": "OSRS Ransomware: VHD Ransomware"
    },
	{
      "description": "Reports say that Defray distributors are pursuing healthcare, education, manufacturing, and technology organizations using a tailored social engineering strategy. These industries, healthcare specifically, have always been particular favorites of ransomware authors. As with most ransomware, Defray is spread through phishing emails which try and coerce victims into downloading a malicious file. The proliferation of ransomware through email is well-documented. A 2016 report by Trend Micro found that email was the most common entry point, with 79 percent of ransomware detected coming from spam mail. Luckily, the Defray attacks have been relatively small, and so far only minor campaigns have been tracked. The phishing emails the authors use are well-crafted—for an attack targeting a hospital, the phishing email was from a hospital IT manager and the malicious files were disguised as patient reports. In other emails, the attackers masqueraded as a UK-based aquarium company asking for a quote or order, and the malicious file had an official logo attached. The specificity and detail show a definite effort to convince targets of their legitimacy, and the more tailored lures show the attackers are investing in more specific targets.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Ransomware"
        ],
        "refs": [
          "https://krebsonsecurity.com/2020/08/medical-debt-collection-firm-r1-rcm-hit-in-ransomware-attack/",
		  "https://www.trendmicro.com/vinfo/pl/security/news/cyber-attacks/defray-ransomware-sets-sights-on-healthcare-and-other-industries#:~:text=Defray%20behavior%20and%20demands,into%20downloading%20a%20malicious%20file.&text=If%20the%20victim%20clicks%20on,.exe%20file)%20is%20installed."
        ]
      },
      "uuid": "c66a22d4-e2e5-11ea-87d0-0242ac130003",
      "value": "OSRS Ransomware: Defray Ransomware"
    },
	{
      "description": "Like other enterprise-targeting ransomware operations, RansomEXX is human-operated, which entails threat actors compromising a network, and over time, spreading to other devices until they gain administrator credentials. Once they gain admin rights and access to the Windows domain controller, they deploy the ransomware on the network and encrypt all of its devices.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Ransomware"
        ],
        "refs": [
          "https://securityaffairs.co/wordpress/107226/cyber-crime/konica-minolta-ransomware.html?utm_source=feedly&utm_medium=rss&utm_campaign=konica-minolta-ransomware",
		  "https://www.bleepingcomputer.com/news/security/business-technology-giant-konica-minolta-hit-by-new-ransomware/"
        ]
      },
      "uuid": "c66a252c-e2e5-11ea-87d0-0242ac130003",
      "value": "OSRS Ransomware: RansomEXX Ransomware"
    },
	{
      "description": "Cyrat ransomware uses Fernet to encrypt files. This is a symmetric encryption method meant for small data files that fit into RAM. While Fernet is not unusual itself, it is not common for ransomware and in this case even problematic. This ransomware encrypts whole files regardless how big they are, whereas Fernet is unsuitable for big files. A public RSA key is used to encrypt the Fernet key. This public key is downloaded from Mediafire instead of shipping it with the ransomware. This adds another dependency. The encrypted Fernet key is saved in Desktop_EMAIL_US.txt. A user with an infected system is required to send this file to the criminals. Cyrat appends .CYRAT to encrypted files. It has a list of folders that it checks for target files.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Ransomware"
        ],
        "refs": [
          "https://www.gdatasoftware.com/blog/cyrat-ransomware"
        ]
      },
      "uuid": "0f0a5208-eeca-11ea-adc1-0242ac120002",
      "value": "OSRS Ransomware: Cyrat Ransomware"
    },
	{
      "description": "The SMAUG RaaS emerged towards the end of April 2020, and seems to have gained some traction in the following months. SMAUG appears to be a robust and full-service RaaS, with a few tweaks that set it apart from the others. Criminals who wish to become SMAUG distributors will likely be used to the offerings associated with this type of service. The SMAUG operators currently charge a 20% service fee. However, there is also a registration fee which is quite steep when compared to other fully-public services. The current registration fee is .2 BTC, around $1800 USD at today’s prices. There are some possible exceptions to getting around the registration fee. On some forums where SMAUG is advertising, the developers state that free memberships (owing only the service fees) will be given to the first five customers with a certain number of posts, and the ability to prove their past work (attacks).",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Ransomware"
        ],
        "refs": [
          "https://labs.sentinelone.com/multi-platform-smaug-raas-aims-to-see-off-competitors/"
        ]
      },
      "uuid": "0f0a54b0-eeca-11ea-adc1-0242ac120002",
      "value": "OSRS Ransomware: SMAUG RaaS"
    },
	{
      "description": "According to researcher Vitali Kremez, Zeppelin binaries are generated via a GUI wizard by affiliates who then distribute the malware in exchange for revenue sharing. The infection begins with a Microsoft Word document harboring a malicious macro. When the document is closed, a second macro runs. To further obfuscate their intent, the authors pull the string from the document text and use it in the script to execute about1.vbs from disk. The script downloads a Zeppelin ransomware and saves it. The ransomware then sleeps for 26 seconds in an attempt to out-wait dynamic analysis in an automated sandbox and then runs the ransomware executable.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Ransomware"
        ],
        "refs": [
          "https://blogs.juniper.net/en-us/threat-research/zeppelin-ransomware-returns-with-a-fresh-wave-of-attacks"
        ]
      },
      "uuid": "5f042832-f82b-11ea-adc1-0242ac120002",
      "value": "OSRS Ransomware: Zeppelin Ransomware"
    },
	{
      "description": "SunCrypt is a ransomware operation that began its activities in October 2019 but was not very active. Over the past few months, they have become much more active since releasing a dedicated leak site.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Ransomware"
        ],
        "refs": [
          "https://www.bleepingcomputer.com/news/security/university-hospital-new-jersey-hit-by-suncrypt-ransomware-data-leaked/"
        ]
      },
      "uuid": "94791b74-fdaa-11ea-adc1-0242ac120002",
      "value": "OSRS Ransomware: SunCrypt Ransomware"
    },
	{
      "description": "Starting around the end of July 2020, Mount Locker began breaching corporate networks and deploying their ransomware. From ransom notes shared with BleepingComputer by victims, the Mount Locker gang is demanding multi-million dollar ransom payments in some cases. Before encrypting files, Mount Locker will also steal unencrypted files and threaten victims that the data will be published if a ransom is not paid. For example, Mount Locker told one victim that they stole 400 GB of their data, and if they are not paid, they will contact the victim's competitors, the media, TV channels, and newspapers. Ultimately, the victim did not pay, and their data was published to a ransomware data leak site. From our analysis, when encrypting files, the ransomware will add an extension in the format .ReadManual.ID.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Ransomware"
        ],
        "refs": [
          "https://www.bleepingcomputer.com/news/security/mount-locker-ransomware-joins-the-multi-million-dollar-ransom-game/?&web_view=true"
        ]
      },
      "uuid": "34a131e2-032b-11eb-adc1-0242ac120002",
      "value": "OSRS Ransomware: Mount Locker Ransomware"
    },
	{
      "description": "FONIX Raas (Ransomware as a Service) is an offering that first came to attention in July of this year. It did not make much of a splash at the time, and even currently, we are only seeing small numbers of infections due to this ransomware family. However, RaaS that at first fly under the radar can quickly become rampant if defenders and security solutions remain unaware of them. Notably, FONIX varies somewhat from many other current RaaS offerings in that it employs four methods of encryption for each file and has an overly-complex post-infection engagement cycle. In this post, we dig a little deeper into these and other peculiarities of this new RaaS offering.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Ransomware"
        ],
        "refs": [
          "https://labs.sentinelone.com/the-fonix-raas-new-low-key-threat-with-unnecessary-complexities/"
        ]
      },
      "uuid": "899c77e4-0e23-11eb-adc1-0242ac120002",
      "value": "OSRS Ransomware: FONIX RaaS"
    },
	{
      "description": "A custom and relatively simplistic ransomware written in the Go programming language.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Ransomware"
        ],
        "refs": [
          "https://www.proofpoint.com/us/blog/threat-insight/employer21-targeting-teachers-ransomware-disguised-class-assignments"
        ]
      },
      "uuid": "899c7ad2-0e23-11eb-adc1-0242ac120002",
      "value": "OSRS Ransomware: cryptme Ransomware"
    },
	{
      "description": "W3Cryptolocker is a relatively new ransomware. Based on telemetry, this ransomware surfaced in July 2020. Dubbed W3Cryptolocker, based on a string found in its code. The loader was hosted on a potentially hacked site, italake.com. It will encrypt all files in all drives except for files having .xls extension.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Ransomware"
        ],
        "refs": [
          "https://blogs.juniper.net/en-us/threat-research/new-pastebin-like-service-used-in-multiple-malware-campaigns"
        ]
      },
      "uuid": "899c7bcc-0e23-11eb-adc1-0242ac120002",
      "value": "OSRS Ransomware: W3Cryptolocker Ransomware"
    },
	{
      "description": "The Phobos ransomware family is fairly recent, only having been first spotted by security researchers in early 2019. But since then, it has continued to push out new variants that not only evolve attack methods, but also frequently change the extension name of encrypted files in past variants. And in its short history, its victims have often complained that they were cheated by the attacker of Phobos by not restoring files. Two weeks ago, FortiGuard Labs captured a new threat sample from the wild. It was a Microsoft Word document with a malicious Macro designed to spread the EKING variant of Phobos. I ran a deep analysis on this sample, and in this analysis post I will show how this variant infects victim’s system and how it scans and encrypts files using an AES algorithm on a victim’s device as well as shared network folders.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Ransomware"
        ],
        "refs": [
          "https://www.fortinet.com/blog/threat-research/deep-analysis-the-eking-variant-of-phobos-ransomware"
        ],
        "synonyms": [
        "Phobos Ransomware variant"
        ]
      },
      "uuid": "07f6a68e-147b-11eb-adc1-0242ac120002",
      "value": "OSRS Ransomware: EKING Ransomware"
    },
	{
      "description": "Original version ransomware now called Razny Locker Ransomware.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Ransomware"
        ],
        "refs": [
          "https://www.bleepingcomputer.com/news/security/thunderx-ransomware-rebrands-as-ranzy-locker-adds-data-leak-site/"
        ]
      },
      "uuid": "07f6a986-147b-11eb-adc1-0242ac120002",
      "value": "OSRS Ransomware: ThunderX Ransomware"
    },
	{
      "description": "Originally ThunderX Ransomware. While the name has changed, strings associated with a PDB debug file in the ransomware executables still show it is the same as ThunderX.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Ransomware"
        ],
        "refs": [
          "https://www.bleepingcomputer.com/news/security/thunderx-ransomware-rebrands-as-ranzy-locker-adds-data-leak-site/"
        ]
      },
      "uuid": "07f6aae4-147b-11eb-adc1-0242ac120002",
      "value": "OSRS Ransomware: Ranzy Locker Ransomware"
    },
	{
      "description": "After being deployed, the ransomware starts encrypting the user’s files and adding the .VAGGEN extension to them. When the encryption process is finished, it drops a ransom note on the Desktop, demanding a payment equivalent to 80 USD to be paid in Bitcoin. The ransomware appears to be coded from scratch and is a relatively straightforward application written in Go which starts with the function denoted as main_main. Other functions belonging to the main application have obfuscated names, such as main_FOLOJVAG, main_DUVETVAD, main_ELDBJORT, main_HIDDENBERRIES, main_LAMNARDETTA, main_SPRINGA.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Ransomware"
        ],
        "refs": [
          "https://blog.malwarebytes.com/cybercrime/2020/10/fake-covid-19-survey-hides-ransomware-in-canadian-university-attack/"
        ]
      },
      "uuid": "84aee628-1ea8-11eb-adc1-0242ac120002",
      "value": "OSRS Ransomware: Vaggen Ransomware"
    },
	{
      "description": "RegretLocker was discovered in October and is a simple ransomware in terms of appearance as it does not contain a long-winded ransom note and uses email for communication rather than a Tor payment site. When encrypting files, it will append the innocuous-sounding .mouse extension to encrypted file names. When creating a Windows Hyper-V virtual machine, a virtual hard disk is created and stored in a VHD or VHDX file. These virtual hard disk files contain a raw disk image, including a drive's partition table and partitions, and like regular disk drives, can range in size from a few gigabytes to terabytes. When a ransomware encrypts files on a computer, it is not efficient to encrypt a large file as it slows down the entire encryption process's speed.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Ransomware"
        ],
        "refs": [
          "https://www.bleepingcomputer.com/news/security/new-regretlocker-ransomware-targets-windows-virtual-machines/"
        ]
      },
      "uuid": "ea25f9a2-2442-11eb-adc1-0242ac120002",
      "value": "OSRS Ransomware: RegretLocker Ransomware"
    },
	{
      "description": "Previously unknown ransomware dubbed Pay2Key, carries targeted attacks against Israeli companies. Initial infection is presumably made through RDP connection. Lateral movement is made using psexec.exe to execute the ransomware on the different machines within the organization. Special attention was given to the design of the network communication, in order to reduce the noise a large number of encrypted machines may generate while contacting the Command and Control servers. The encryption scheme is solid – using the AES and RSA algorithms.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Ransomware"
        ],
        "refs": [
          "https://research.checkpoint.com/2020/ransomware-alert-pay2key/"
        ]
      },
      "uuid": "ea25fc0e-2442-11eb-adc1-0242ac120002",
      "value": "OSRS Ransomware: Pay2Key Ransomware"
    },
	{
      "description": "Osno ransomware, or OsnoLocker as it is called in the code, has an implementation for XXTEA. However, it is not used in the current sample. Instead it overwrites the original content of the files with a marker. The marker is the string OsnoRansom appended by a randomly created string of length 50-200 characters consisting of uppercase letters A-Z and digits 0-9. The randomly created string will be different for every affected file. OsnoLocker adds the .osnoed extension to these files. OsnoLocker puts a ransom message into a file called RecInstruct.osnoned. It proceeds to write an executable to disk named Osno Decryptor.exe whose purpose is to lock the screen, display the ransom message that was placed in RecInstruct.osnoned and ask for a decryption code. This Osno Decryptor.exe has the module name FakeRansomware. Osno is a wiper in its current form and payment will not help to get any files back. Recovery of files via shadow volumes copies can work, though. Future versions of Osno might use the already implemented XXTEA to encrypt files.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Ransomware"
        ],
        "refs": [
          "https://www.gdatasoftware.com/blog/2020/11/36459-babax-stealer-rebrands-to-osno-installs-rootkit"
        ]
      },
      "uuid": "4c464d52-2a70-11eb-adc1-0242ac120002",
      "value": "OSRS Ransomware: OsnoLocker Ransomware"
    },
	{
      "description": "A ransomware plugin that encrypts specific file extensions on the infected endpoint. Traditionally ransomware encrypts files on the infected endpoint using a combination of asymmetric and symmetric encryption. This plugin is different. It locks files into individually created archives using randomly generated passwords. The passwords are then encrypted using an embedded public key (part of an embedded pub certificate). Once the infected user gets access to the private key (after the ransom has been paid), the private key can be plugged into the accompanying decryptor .exe that decrypts the archive passwords and subsequently unpacks the original files from the archive.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Ransomware"
        ],
        "refs": [
          "https://blog.talosintelligence.com/2020/11/crat-and-plugins.html"
        ]
      },
      "uuid": "4c464e4c-2a70-11eb-adc1-0242ac120002",
      "value": "OSRS Ransomware: Hansom Ransomware"
    },
	{
      "description": "Initial access - We were not able to find identified specific initial accesses, we found traces of Qakbot during investigations but we could not identify how it was dropped on information systems. We observed many potential intrusion vectors on patient 0 (many malwares were found on the machine). Internal reconnaissance - Prior to privilege escalation, Egregor proceeds to Active Directory reconnaissance using tools such as Sharphound or AdFind. These tools are used to gather information about users, groups, computers, and so on. They aim as well at finding the best compromission paths. Privilege escalation - During investigations, Egregor compromises Active Directory in order to become domain admin. Lateral movement - Egregor moves laterally on information systems using CobaltStrike SMB beacons. This feature allows an attacker to use SMB named pipes (logical connections between a client and a server) to communicate commands through the information system revealing C2 IP address. C2 Communication - Once settles on victim’s information systems, Egregor communicates with its Command and Control servers via HTTPS protocol so as to drop scripts or dynamic link libraries on infected hosts. You can find the list of C2 identified during investigations in section IP Addresses. Data exfiltration - Egregor masquerades svchost.exe process to launch an RClone client in order to exfiltrate data. RClone aims at managing files in cloud, it deals with multiple systems and protocols. The RClone configuration file, in plain text, is dropped by the attacker with the binary. Based on investigations and OSINT, we know that Egregor used at least three different configurations to exfiltrate data.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Ransomware"
        ],
        "refs": [
          "https://www.intrinsec.com/egregor-prolock/"
        ]
      },
      "uuid": "3c1524a6-3963-11eb-adc1-0242ac120002",
      "value": "OSRS Ransomware: Egregor Ransomware"
    },
	{
      "description": "BlueCrab ransomware (aka Sodinokibi Ransomware) is a ransomware that is actively distributed to domestic users, and is characterized by being distributed through fake forum pages created using various search keywords. When the JS file downloaded from the distribution page is executed, the infection process starts. Since the distribution page is exposed above the search results of the search engine, it is easy for users to access it, so infections by many users are being reported steadily. BlueCrab ransomware actively creates modifications to bypass AV, and attempts to bypass diagnosis with various modifications at each stage of infection. The ransomware remained unmodified for a long period of time, but occasionally transformed very actively over a period of several months. It showed active transformation from November 2019 to January 2020, and after there was no significant transformation for a while, transformation was frequent from October to December 2020. In this article, we will explain the overall infection process of BlueCrab ransomware and share the details of how the attack process was modified to bypass AV. The attacker attacks the vulnerable WordPress environment, steals privileges, and creates a post with a title including “download” using various keywords. When accessing the post, a fake forum page is displayed due to the JavaScript embedded in the internal source code, and induces the user to download and execute the file. Posts contain sentences that humans cannot understand, but search engines incorrectly judge this content and expose it to the top of the search results (SEO-Poisoning technique). These dissemination posts are presumed to be generated by automated tools, and a very large number of dissemination posts exist and are constantly being created.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Ransomware"
        ],
        "refs": [
          "https://asec.ahnlab.com/ko/19640/"
        ],
        "synonyms": [
        "REvil",
        "Sodinokibi"
        ]
      },
      "uuid": "8a5fd566-6627-11eb-ae93-0242ac130002",
      "value": "OSRS Ransomware: BlueCrab Ransomware"
    },
	{
      "description": "Zeoticus ransomware first appeared for sale in various underground forums and markets in early 2020. Initially, the ransomware was offered as a complete custom build for an undisclosed fee. The ransomware is currently Windows-specific and, according to the developers, functions on all supported versions of Windows. Unusually, there are no connectivity requirements for the payloads to execute. Zeoticus ransomware will execute fully offline, with no dependence on a C2 (Command & Control). It is also worth noting that the malware is designed not to function in some regions, specifically Russia, Belarus, and Kyrgyzstan. Like many other families, use within the CIS is discouraged in order to avoid any backlash from regional government and law enforcement agencies.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Ransomware"
        ],
        "refs": [
          "https://labs.sentinelone.com/zeoticus-2-0-ransomware-with-no-c2-required/"
        ]
      },
      "uuid": "6777e8da-6baf-11eb-9439-0242ac130002",
      "value": "OSRS Ransomware: Zeoticus Ransomware"
    },
	{
      "description": "Babuk ransomware is a new ransomware threat discovered in 2021 that attacked at least five big enterprises, with one already paying the criminals $85,000 after negotiations. This ransomware, as other variants, is deployed in the network of enterprises that the criminals carefully target and compromise. This modus operandi is known as the Big-Game hunting strategy. The group behind Babuk has also adopted the same strategies as other ransomware groups and has leaked the stolen data.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Ransomware"
        ],
        "refs": [
          "https://www.mcafee.com/enterprise/en-us/assets/reports/rp-babuk-ransomware.pdf",
		  "https://www.mcafee.com/blogs/other-blogs/mcafee-labs/babuk-ransomware/"
        ]
      },
      "uuid": "d642e97e-7cf6-11eb-9439-0242ac130002",
      "value": "OSRS Ransomware: Babuk Ransomware"
    },
	{
      "description": "HelloKitty is a ransomware family that emerged in late 2020. While it lacks the sophistication of some of the more well-known families such as Ryuk, REvil, and Conti, it has nevertheless struck some notable targets, including CEMIG0.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Ransomware"
        ],
        "refs": [
          "https://labs.sentinelone.com/hellokitty-ransomware-lacks-stealth-but-still-strikes-home/"
        ]
      },
      "uuid": "d88318b8-8583-11eb-8dcd-0242ac130003",
      "value": "OSRS Ransomware: HelloKitty Ransomware"
    },
	{
      "description": "DearCry is a new ransomware variant that has been observed exploiting Microsoft Exchange Servers ProxyLogon vulnerabilities for initial access. Early reports of the appearance of DearCry ransom notes in tandem with associated Microsoft Exchange Server compromises via ProxyLogon vulnerabilities began to surface on March 9, 2021, and victims in the U.S., Canada and Australia are suspected, according to security researcher Michael Gillespie. When executed, DearCry ransomware uses AES-256 and RSA-2048 to encrypt victim files, while also modifying file headers to include the string ‘DEARCRY!’.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Ransomware"
        ],
        "refs": [
          "https://unit42.paloaltonetworks.com/dearcry-ransomware/"
        ]
      },
      "uuid": "d8831ad4-8583-11eb-8dcd-0242ac130003",
      "value": "OSRS Ransomware: DearCry Ransomware"
    },
	{
      "description": "Matrix is a ransomware family that was first identified publicly in December 2016. Over the years since its inception, it has primarily targeted small- to medium-sized organizations. As of 2019, it had been observed across geographic locations such as the U.S., Belgium, Taiwan, Singapore, Germany, Brazil, Chile, South Africa, Canada and the UK. While initially leveraging tactics such as spam email campaigns, propagation via Windows shortcuts and the RIG exploit kit for distribution, the primary attack vector for the Matrix ransomware family shifted in 2018 to brute forcing researchersak Remote Desktop Protocol (RDP) credentials. The shift to this attack methodology appears to be a recurring trend in similar targeted ransomware families such as Dharma, Ryuk and BitPaymer.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Ransomware"
        ],
        "refs": [
          "https://unit42.paloaltonetworks.com/matrix-ransomware/"
        ]
      },
      "uuid": "537ca5c8-9625-11eb-a8b3-0242ac130003",
      "value": "OSRS Ransomware: Matrix Ransomware"
    },
	{
      "description": "An unknown financially motivated threat group is using the self-proclaimed Hades ransomware variant in cybercrime operations that have impacted at least three victims since December 2020. Known victims include a large US transportation & logistics organization, a large US consumer products organization, and a global manufacturing organization. Tactics, Techniques and Procedures (TTP) employed to compromise a victim network, escalate privileges, move laterally, evade defenses, exfiltrate data and deploy Hades ransomware are relatively consistent with other researchersll-known ransomware operators, using a combination of commodity tooling and various living-off-the-land techniques. Of note, researchers observed significant effort by the threat group to disable or bypass endpoint defenses, including Endpoint Detection and Response (EDR) tooling, using both custom tooling and hands on keys approaches. researchers assess with moderate confidence that the group's operations have just begun, and that Hades activity will likely continue to proliferate into the foreseeable future, impacting additional victims.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Ransomware"
        ],
        "refs": [
          "https://www.accenture.com/us-en/blogs/cyber-defense/unknown-threat-group-using-hades-ransomware"
        ]
      },
      "uuid": "537ca938-9625-11eb-a8b3-0242ac130003",
      "value": "OSRS Ransomware: Hades Ransomware"
    },
	{
      "description": "DoejoCrypt was the first ransomware to appear to take advantage of the vulnerabilities, starting to encrypt in limited numbers shortly after the patches were released. Ransomware attackers often use multiple tools and exploits to gain initial access, including purchasing access through a broker or reseller who sells access to systems they have already compromised. The DoejoCrypt attacks start with a variant of the Chopper web shell being deployed to the Exchange server post-exploitation. The web shell writes a batch file. Found on all systems that received the DoejoCrypt ransomware payload, this batch file performs a backup of the Security Account Manager (SAM) database and the System and Security registry hives, allowing the attackers later access to passwords of local users on the system and, more critically, in the LSA Secrets portion of the registry, where passwords for services and scheduled tasks are stored.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Ransomware"
        ],
        "refs": [
          "https://www.microsoft.com/security/blog/2021/03/25/analyzing-attacks-taking-advantage-of-the-exchange-server-vulnerabilities/"
        ]
      },
      "uuid": "537caabe-9625-11eb-a8b3-0242ac130003",
      "value": "OSRS Ransomware: DoejoCrypt Ransomware"
    },
	{
      "description": "While DoejoCrypt was a new ransomware payload, the access gained by attackers via the on-premises Exchange Server vulnerabilities will likely become part of the complex cybercriminal economy where additional ransomware operators and affiliates take advantage of it. The first existing ransomware family to capitalize on the vulnerabilities was Pydomer. This ransomware family was previously seen using vulnerabilities in attacks, notably taking advantage of Pulse Secure VPN vulnerabilities, for which Pulse Secure has released security patches, to steal credentials and perform ransomware attacks. In this campaign, the operators scanned and mass-compromised unpatched Exchange Servers to drop a web shell. They started later than some other attackers, with many compromises occurring between March 18 and March 20, a window when fewer unpatched systems were available. They then dropped a web shell, with a notable file name format.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Ransomware"
        ],
        "refs": [
          "https://www.microsoft.com/security/blog/2021/03/25/analyzing-attacks-taking-advantage-of-the-exchange-server-vulnerabilities/"
        ]
      },
      "uuid": "537cac58-9625-11eb-a8b3-0242ac130003",
      "value": "OSRS Ransomware: Pydomer Ransomware"
    },
	{
      "description": "The extension added after file encryption of the ransomware is Pecunia, but the distribution method, the contents of the ransom note and the format of the file name change after file encryption are considered to be the same as the existing Makop ransomware. Use the makop string as an extension added after Makop ransomware has been steadily spreading in this way since a year ago, so you need to be constantly careful.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Ransomware"
        ],
        "refs": [
          "https://asec.ahnlab.com/ko/22159/"
        ]
      },
      "uuid": "3a15c7b2-a68e-11eb-bcbc-0242ac130002",
      "value": "OSRS Ransomware: Makop Ransomware"
    },
	{
      "description": "Cuba ransomware is currently hitting several companies in north and south America, as well as in Europe. The attackers use a set of obfuscated PowerShell scripts to move laterally and deploy their attack. The website to leak the stolen data has been put online recently. The malware is obfuscated and comes with several evasion techniques. The actors have sold some of the stolen data. The ransomware uses multiple argument options and has the possibility to discover shared resources using the NetShareEnum API.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Ransomware"
        ],
        "refs": [
          "https://www.mcafee.com/blogs/other-blogs/mcafee-labs/mcafee-atr-threat-report-a-quick-primer-on-cuba-ransomware/",
		  "https://www.mcafee.com/enterprise/en-us/assets/reports/rp-cuba-ransomware.pdf"
        ]
      },
      "uuid": "db83cc1e-9c68-11eb-a8b3-0242ac130003",
      "value": "OSRS Ransomware: Cuba Ransomware"
    },
	{
      "description": "FIVEHANDS is written in C++ and although high level functionality is similar, the function calls and code structure to implement the majority of the functionality is written differently. Also, instead of executing threads using QueueUserWorkItem, FIVEHANDS uses IoCompletionPorts to more efficiently manage its encryption threads. FIVEHANDS also uses more functionality from the C++ standard template library (STL) than does HELLOKITTY.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Ransomware"
        ],
        "refs": [
          "https://www.fireeye.com/blog/threat-research/2021/04/unc2447-sombrat-and-fivehands-ransomware-sophisticated-financial-threat.html"
        ]
      },
      "uuid": "320d2302-ad9c-11eb-8529-0242ac130003",
      "value": "OSRS Ransomware: FIVEHANDS Ransomware"
    },
	{
      "description": "In January, researchers encountered a new ransomware using .hello as its extension in one of our cases that possibly arrived via a SharePoint server vulnerability. This appeared to be a new ransomware family dubbed as the Hello ransomware (aka WickrMe), named after the chat application that was used to contact the cybercriminals responsible. Previous variants researchersre observed using .hemming and .strike extensions and did not include the cybercriminals’ WickrMe user handles. In contrast, neresearchersr versions of the ransom notes with .hello extensions now have the WickrMe contact information.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Ransomware"
        ],
        "refs": [
          "https://www.trendmicro.com/en_us/research/21/d/hello-ransomware-uses-updated-china-chopper-web-shell-sharepoint-vulnerability.html"
        ],
        "synonyms": [
        "WickerMe"
        ]
      },
      "uuid": "2d599a18-ba42-11eb-8529-0242ac130003",
      "value": "OSRS Ransomware: Hello Ransomware"
    },
	{
      "description": "The compilation timestamp of the ransomware variant, internally named Apostle, was most likely modified by an obfuscator Agile.NET. The sample was uploaded to VirusTotal on March 29 from the  United  Arab  Emirates,  and  is  clearly  an  evolution  of  the  original  wiper  version.  This  means  it  was  most  likely  developed  between  November  29,  2020  to  March  29,  2021.  The  File  Version  Information corroborates that it was developed in 2021.Much like the wiper, upon execution the malware checks whether it is the first instance running on the machine using the same function IsFirstInstance. The mutex searched for in this version of Apostle is different, but follows a similar pattern execution of the ransomware version requires supplying it with a base64 encoded argument containing  an  XML  of  an  RSAParameters  object.  This  argument  is  passed  on  and  saved  as  the  Public Key used for the encryption process and is most likely generated on a machine owned by the threat actor. If executed without any arguments, it automatically runs the SelfDelete function, which is almost identical to the one in the older version.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Ransomware"
        ],
        "refs": [
          "https://assets.sentinelone.com/sentinellabs/evol-agrius"
        ]
      },
      "uuid": "9a17d9c6-bef2-11eb-8529-0242ac130003",
      "value": "OSRS Ransomware: Apostle Ransomware"
    },
	{
      "description": "Prometheus ransomware was first observed in February 2021 and is a new variant of a known strain called Thanos. Thanos ransomware has been advertised for sale on underground forums since at least the first half of 2020, where it has a builder that allows actors to customize a sample with a wide variety of available settings. This suggests that different threat actors may have leveraged this builder to create their own variants and brands. In this case, we turn our attention to one of those threat actors, Prometheus. While this ransomware gang claims to be part of REvil, we haven’t seen any other solid connection between the two groups. REvil operates on an affiliate-driven RaaS program, but we believe the Prometheus ransomware gang may be acting on their own and attempting to leverage the infamous REvil name and reputation to improve the chance that victims will pay the demanded ransom. This would not be the first time adversaries have used the names of well-known threat groups to strengthen their credibility. When Prometheus ransomware is executed, it tries to kill several backups and security software-related processes, such as Raccine, a ransomware prevention tool that tries to stop ransomware from deleting shadow copies in Windows.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Ransomware"
        ],
        "refs": [
          "https://unit42.paloaltonetworks.com/prometheus-ransomware/"
        ]
      },
      "uuid": "35113a0a-c9e6-11eb-b8bc-0242ac130003",
      "value": "OSRS Ransomware: Prometheus Ransomware"
    },
	{
      "description": "In the past week, Sophos analysts uncovered a new ransomware written in the Go programming language that calls itself Epsilon Red. The malware was delivered as the final executable payload in a hand-controlled attack against a US-based business in the hospitality industry in which every other early-stage component was a PowerShell script.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Ransomware"
        ],
        "refs": [
          "https://news.sophos.com/en-us/2021/05/28/epsilonred/"
        ]
      },
      "uuid": "35113b0e-c9e6-11eb-b8bc-0242ac130003",
      "value": "OSRS Ransomware: Epsilon Red Ransomware"
    },
	{
      "description": "In mid-July we responded to an incident that involved an attack on a Microsoft Exchange server. The threat actor used this entry point to get into a Domain Controller and then leveraged it as a springboard to deploy ransomware. While examining the ransomware payload, we noticed it was a new variant which we had not heard of before. In this blog we will take a look at AvosLocker a solid, yet not too fancy new ransomware family that has already claimed several victims. This type of ransomware attack is unfortunately all too common these days and has wreaked havoc across many industries. With the disappearance of the infamous REvil, it is possible new threat actors are actively looking to fill the void.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Ransomware"
        ],
        "refs": [
          "https://news.sophos.com/en-us/2021/05/28/epsilonred/"
        ]
      },
      "uuid": "3db04ac8-f625-11eb-9a03-0242ac130003",
      "value": "OSRS Ransomware: AvosLocker Ransomware"
    },
	{
      "description": "The LockFile ransomware was first observed on the network of a U.S. financial organization on July 20, 2021, with its latest activity seen as recently as August 20. LockFile has been seen on organizations around the world, with most of its victims based in the U.S. and Asia. Indications are that the attackers gain access to victims' networks via Microsoft Exchange Servers, and then use the incompletely patched PetitPotam vulnerability to gain access to the domain controller, and then spread across the network. It is not clear how the attackers gain initial access to the Microsoft Exchange Servers.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Ransomware"
        ],
        "refs": [
          "https://symantec-enterprise-blogs.security.com/blogs/threat-intelligence/lockfile-ransomware-new-petitpotam-windows"
        ]
      },
      "uuid": "44221574-0b2b-11ec-9a03-0242ac130003",
      "value": "OSRS Ransomware: LockFile Ransomware"
    },
	{
      "description": "Hive is a double-extortion ransomware group that first appeared in June 2021. The group is notable in its undiscerning choice of targets, having no limits when it comes to healthcare providers and hospitals, as evidenced in a recent attack on Memorial Health System hospitals in Ohio. Hive ransomware is written in Go to take advantage of the language’s concurrency features to encrypt files faster.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Ransomware"
        ],
        "refs": [
          "https://labs.sentinelone.com/hive-attacks-analysis-of-the-human-operated-ransomware-targeting-healthcare/"
        ]
      },
      "uuid": "442217fe-0b2b-11ec-9a03-0242ac130003",
      "value": "OSRS Ransomware: Hive Ransomware"
    },
	{
      "description": "After the demise of the DarkSide ransomware affiliate program, a vacuum was left in the market. This space was promptly filled by new groups such as Lockbit and BlackMatter. BlackMatter, the up-and-coming star of the ransomware scene, is thought to be DarkSide’s direct heir, from which it got some of its code. While no high-profile breach of BlackMatter have been published yet, BleepingComputer claims the group already netted a 4 million ransom payment.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Ransomware"
        ],
        "refs": [
          "https://blog.minerva-labs.com/blackmatter"
        ]
      },
      "uuid": "4e42cd22-1c70-11ec-9621-0242ac130002",
      "value": "OSRS Ransomware: BlackMatter Ransomware"
    },
	{
      "description": "XingLocker made its first appearance in early May of this year (circa 2021). The new group was featured in the AstroLocker ransomware blog, and it has been very active since then. In this intrusion, we observed the threat actors use multiple DLL Beacons that would call out to different Cobalt Strike C2 channels. It appears that operators used different payloads, to accomplish different tasks, on each phase of the intrusion. The threat actors used batch scripts during the intrusion for a number of purposes, primarily to disable antivirus programs and execute payloads.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Ransomware"
        ],
        "refs": [
          "https://thedfirreport.com/2021/10/18/icedid-to-xinglocker-ransomware-in-24-hours/"
        ]
      },
      "uuid": "58443da2-31af-11ec-8d3d-0242ac130003",
      "value": "OSRS Ransomware: XingLocker Ransomware"
    },
	{
      "description": "This ransomware appeared in mid-2019. Some versions of it are also known as Limbo, Legion, Odveta and Ouroboros. Limbozar is distributed through an affiliate program (RaaS). Currently, the main vector of distribution is unauthorized RDP access. Limbozar is written in C++, compiled in MS Visual Studio and uses the CryptoPP library to implement cryptographic functions. The cryptographic scheme has changed several times throughout the family’s history. When launched, modern versions of Limbozar generate an RSA-2048 session key pair, followed by a 256-bit key and a 96-bit initialization vector for the AES algorithm in GCM mode. The private RSA session key is encrypted with the AES algorithm and saved locally. Next, the key+IV pair for AES is encrypted with one of the several public RSA master keys contained in the Trojan’s body, and is also saved to the local drive. After this preparatory phase, Limbozar searches for the victim’s files and encrypts them with the AES-GCM algorithm, generating for each file a unique key+IV pair, which, in turn, it encrypts with the RSA session public key.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Ransomware"
        ],
        "refs": [
          "https://securelist.com/cis-ransomware/104452/"
        ]
      },
      "uuid": "58443eba-31af-11ec-8d3d-0242ac130003",
      "value": "OSRS Ransomware: Limbozar Ransomware"
    },
	{
      "description": "The Threat Hunter Team first spotted suspicious use of AdFind, a legitimate command-line Active Directory query tool, on the victim organization’s network. This tool is often abused by ransomware attackers as a reconnaissance tool, as well as to equip the attackers with the resources that they need for lateral movement via Active Directory. Just days after the suspicious AdFind activity was observed on the victim organization, the attackers attempted to deploy the Yanluowang ransomware.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Ransomware"
        ],
        "refs": [
          "https://symantec-enterprise-blogs.security.com/blogs/threat-intelligence/yanluowang-targeted-ransomware"
        ]
      },
      "uuid": "58443fa0-31af-11ec-8d3d-0242ac130003",
      "value": "OSRS Ransomware: Yanluowang Ransomware"
    },
	{
      "description": "Unlike other ransomware that may have a unique key in each session, BlackByte uses the same raw key (which it downloads) to encrypt files and it uses a symmetric-key algorithm – AES.  To decrypt a file, one only needs the raw key to be downloaded from the host. As long as the .PNG file it downloaded remains the same, we can use the same key to decrypt the encrypted files.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Ransomware"
        ],
        "refs": [
          "https://www.trustwave.com/en-us/resources/blogs/spiderlabs-blog/blackbyte-ransomware-pt-1-in-depth-analysis/"
        ]
      },
      "uuid": "5844407c-31af-11ec-8d3d-0242ac130003",
      "value": "OSRS Ransomware: BlackByte Ransomware"
    },
	{
      "description": "Ransomware typically installed with AnyDesk malware.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Ransomware"
        ],
        "refs": [
          "https://www.mcafee.com/blogs/enterprise/mcafee-enterprise-atr/is-there-really-such-a-thing-as-a-low-paid-ransomware-operator/"
        ]
      },
      "uuid": "9801678a-3722-11ec-8d3d-0242ac130003",
      "value": "OSRS Ransomware: Chaos Ransomware"
    },
	{
      "description": "Spook Ransomware is an emerging player first seen in late September 2021. The operators publish details of all victims regardless of whether they pay or not. Targets range across several industries with an emphasis on manufacturing. Analysis shows a significant degree of code sharing between Spook and the Prometheus and Thanos ransomware families.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Ransomware"
        ],
        "refs": [
          "https://www.sentinelone.com/labs/spook-ransomware-prometheus-derivative-names-those-that-pay-shames-those-that-dont/"
        ]
      },
      "uuid": "4ed53bd6-3ca4-11ec-9699-ef075f38685c",
      "value": "OSRS Ransomware: Spook Ransomware"
    },
	{
      "description": "Ransomware written in the Go language is quickly becoming more popular among threat actors. These include Babuk, Hive, and HelloKitty, as well as many other threats written in Golang. Go is a statically typed, object-oriented, cross-platform programming language introduced by Google. The abstraction and the support for multiple platforms is an advantage for many developers and also a disadvantage for security vendors who attempt to create signatures for malicious executable malware, which comes with all the dependent libraries built-in. Morphisec Labs has identified a new strain of ransomware, implemented in Go 1.17 and named DECAF. The first version, which includes symbols and test assertion, was identified in late September. The attackers very quickly stripped the original alpha version, added additional functionality, and uploaded this stub version to verify its detection score. Within a week they had deployed a fully weaponized version on a customer site.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Ransomware"
        ],
        "refs": [
          "https://blog.morphisec.com/decaf-ransomware-a-new-golang-threat-makes-its-appearance"
        ]
      },
      "uuid": "4ed53c08-3ca4-11ec-969a-e37d0be8a12e",
      "value": "OSRS Ransomware: Decaf Ransomware"
    },
	{
      "description": "There is a tentative link between these Yanluowang attacks and older attacks involving Thieflock, ransomware-as-a-service developed by the Canthroid (aka Fivehands) group. Several TTPs used by these attackers overlap with TTPs used in Thieflock attacks, including - Use of custom password recovery tools such as GrabFF and other open-source password dumping tools. Use of open-source network scanning tools (SoftPerfect Network Scanner). Use of free browsers, such as s3browser and Cent browser. This link begs the question of whether Yanluowang was developed by Canthroid. However, analysis of Yanluowang and Thieflock does not provide any evidence of shared authorship. Instead, the most likely hypothesis is that these Yanluowang attacks may be carried out by a former Thieflock affiliate.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Ransomware"
        ],
        "refs": [
          "https://symantec-enterprise-blogs.security.com/blogs/threat-intelligence/yanluowang-ransomware-attacks-continue"
        ]
      },
      "uuid": "42f3c70e-5911-11ec-bf63-0242ac130002",
      "value": "OSRS Ransomware: Thieflock Ransomware"
    },
	{
      "description": "In July 2020, Mandiant first detected ROLLCOAST ransomware usage by UNC2190. ROLLCOAST is a ransomware program that encrypts files on logical drives attached to a system. ROLLCOAST is a Dynamic Linked Library (DLL) with no named exports. When observed by Mandiant it uniquely had only one ordinal export 0x01. This suggested the sample was designed to avoid detection and be invoked within memory, possibly through BEACON provided to affiliates. Incident responders working on similar intrusions should capture memory for analysis. ROLLCOAST was not written to disk during this intrusion and was only detected in memory by Mandiant. The malware begins by checking the system language and exits if it detects a non-supported language code from the table below. Many other ransomware families have similar checks to avoid encrypting systems in Russia and other Commonwealth of Independent States member countries presumably to avoid attracting the attention of law enforcement in countries where the ransomware operator and affiliates are more likely to reside.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Ransomware"
        ],
        "refs": [
          "https://blog.morphisec.com/"
        ]
      },
      "uuid": "42f3cc18-5911-11ec-bf63-0242ac130002",
      "value": "OSRS Ransomware: ROLLCOAST Ransomware"
    },
	{
      "description": "In the past, threat actors have used BazarLoader to deploy Ryuk and Conti ransomware, as reported on many occasions. In this intrusion, however, a BazarLoader infection resulted in deployment of Diavol Ransomware. First discovered in June 2021, by FortiGuard Labs, Diavol Ransomware has been suspected to be linked to the Wizard Spider threat actor. In this report, we observed threat actors deploy multiple Cobalt Strike DLL beacons, perform internal discovery using Windows utilities, execute lateral movement using AnyDesk and RDP, dump credentials multiple ways, exfiltrate data and deploy domain wide ransomware in as little as 32 hours from initial access.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Ransomware"
        ],
        "refs": [
          "https://thedfirreport.com/2021/12/13/diavol-ransomware/"
        ]
      },
      "uuid": "f94cd394-5d15-11ec-bf63-0242ac130002",
      "value": "OSRS Ransomware: Diavol Ransomware"
    },
	{
      "description": "SFile, also known as Escal, first appeared in 2020, mainly for the Windows platform. Some variants of the ransomware are also used to attach the English name of the target company to the suffix of the encrypted file. For example, the variant captured this time uses nuctech-gj0okyci (nuctech is the English name of Nuctech Technology Co., Ltd.) as the suffix name. Recently, Rising captured the Linux platform variant of the ransomware. This variant provides some command-line-based parameter policy support. The encrypted file adopts the RSA+AES algorithm mode, and the encrypted file cannot be decrypted temporarily without the RSA private key.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Ransomware"
        ],
        "refs": [
          "http://it.rising.com.cn/fanglesuo/19851.html"
        ],
        "synonyms": [
        "Escal Ransomware"
        ]
      },
      "uuid": "1ebf2efc-7f70-11ec-a8a3-0242ac120002",
      "value": "OSRS Ransomware: SFile Ransomware"
    },
	{
      "description": "One of the most notable aspects of White Rabbit’s attack is how its payload binary requires a specific command-line password to decrypt its internal configuration and proceed with its ransomware routine. This method of hiding malicious activity is a trick that the ransomware family Egregor uses to hide malware techniques from analysis. White Rabbit’s payload is inconspicuous at first glance, being a small file of around 100 KB with no notable strings and seemingly no activity. The telltale sign of its malicious origin is the presence of strings for logging, but the actual behavior would not be easily observed without the correct password.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Ransomware"
        ],
        "refs": [
          "https://www.trendmicro.com/en_us/research/22/a/new-ransomware-spotted-white-rabbit-and-its-evasion-tactics.html"
        ]
      },
      "uuid": "1ebf3104-7f70-11ec-a8a3-0242ac120002",
      "value": "OSRS Ransomware: White Rabbit Ransomware"
    },
	{
      "description": "BlackCat (aka AlphaVM, AlphaV) is a newly established RaaS (Ransomware as a Service) with payloads written in Rust. While BlackCat is not the first ransomware written in the Rust language, it joins a small (yet growing) sliver of the malware landscape making use of this popular cross-platform language. First appearing in late November, BlackCat has reportedly been attacking targets in multiple countries, including Australia, India and the U.S, and demanding ransoms in the region of $400,000 to $3,000,000 in Bitcoin or Monero. In order to attract affiliates, the authors behind BlackCat have been heavily marketing their services in well-known underground forums. BlackCat operators maintain a victim blog as is standard these days. The blog hosts company names and any data leaked in the event that the victims do not agree to cooperate. Current data indicates primary delivery of BlackCat is via 3rd party framework/toolset (e.g., Cobalt Strike) or via exposed (and vulnerable) applications. BlackCat currently supports both Windows and Linux operating systems.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Ransomware"
        ],
        "refs": [
          "https://www.sentinelone.com/labs/blackcat-ransomware-highly-configurable-rust-driven-raas-on-the-prowl-for-victims/"
        ],
        "synonyms": [
        "AlphaVM",
        "AlphaV"
        ]
      },
      "uuid": "1ebf3226-7f70-11ec-a8a3-0242ac120002",
      "value": "OSRS Ransomware: BlackCat Ransomware"
    },
	{
      "description": "An actor recently has been starting up a RaaS solution that appears to primarily focus on individual computers instead of entire enterprises but is also reusing objects from other ransomware families. Not a lot has been discussed about this ransomware but we did find a tweet mentioning one of the samples during our research.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Ransomware"
        ],
        "refs": [
          "https://medium.com/walmartglobaltech/sugar-ransomware-a-new-raas-a5d94d58d9fb"
        ]
      },
      "uuid": "4984e2a2-9006-11ec-b909-0242ac120002",
      "value": "OSRS Ransomware: Sugar Ransomware"
    },
	{
      "description": "The  ransomware  presents  anti-analysis  features  like  API  hashing  and  indirect  API  calls  with  the intention of evading analysis. The only reliable way to reconstruct functions is via dynamic analysis by way of fully executing the sample. One aspect that immediately sets Macaw apart is  the  fact  that  it  requires  a  custom  token  (provided  from  the  command  line),  which  seems  specific for each victim; without it, it won’t execute (also seen in Egregor and BlackCat). This additional requirement also aids in anti-analysis. Another  new  addition  to  Macaw  was  a  special  function  that  acquires  the  imports  for  APIs  at  runtime instead of when the executable is started via the PE import section.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Ransomware"
        ],
        "refs": [
          "https://assets.sentinelone.com/sentinellabs/sentinellabs_EvilCorp"
        ]
      },
      "uuid": "89204ede-9a50-11ec-b909-0242ac120002",
      "value": "OSRS Ransomware: Macaw Locker Ransomware"
    },
	{
      "description": "Ransomware written in Go.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Ransomware"
        ],
        "refs": [
          "https://www.welivesecurity.com/2022/03/01/isaacwiper-hermeticwizard-wiper-worm-targeting-ukraine/"
        ]
      },
      "uuid": "89205168-9a50-11ec-b909-0242ac120002",
      "value": "OSRS Ransomware: HermeticRansom"
    },
	{
      "description": "Hive, which is one of the more notable ransomware families of 2021, made waves in the latter half of the year after breaching over 300 organizations in just four months — allowing the group to earn what could potentially be millions of US dollars in profit. In March 2022, we came across evidence that another, relatively unknown, ransomware known as Nokoyawa is likely connected with Hive, as the two families share some striking similarities in their attack chain, from the tools used to the order in which they execute various steps. Currently, the majority of Nokoyawa’s targets are located in South America, primarily in Argentina.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Ransomware"
        ],
        "refs": [
          "https://www.trendmicro.com/en_us/research/22/c/nokoyawa-ransomware-possibly-related-to-hive-.html"
        ]
      },
      "uuid": "475076a0-a5fe-11ec-b909-0242ac120002",
      "value": "OSRS Ransomware: Nokoyawa Ransomware"
    },
	{
      "description": "As part of our monitoring of malicious files in current use, we detected a malicious BAT file that was uploaded to VirusTotal from Iran. This file executes a ransomware that we associated with the EvilNominatus ransomware, initially exposed at the end of 2021. It seems that the ransomware’s developer is a young Iranian, who bragged about its development on Twitter. At this point, we have no details regarding any victims of this ransomware. We publish this research due to the malware’s unique method of operation, and the low number of AV engines capable of detecting it. The original BAT file the research is based on was only detected by two AV engines on VirusTotal. Another BAT file that was discovered later, which shares characteristics with the first one, wasn’t detected by any AV engines. Other files that were either generated by the BAT files or communicated with them to carry out attacks were detected by multiple AV engines. Therefore, we assess that the tool’s general level of risk is low at this point.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Ransomware"
        ],
        "refs": [
          "https://www.clearskysec.com/evilnominatus-ransomware/"
        ]
      },
      "uuid": "be5ef098-bbf0-11ec-8422-0242ac120002",
      "value": "OSRS Ransomware: EvilNominatus Ransomware"
    },
	{
      "description": "We analyzed the sample with the SHA-256 hash 5b56c5d86347e164c6e571c86dbf5b1535eae6b979fede6ed66b01e79ea33b7b, which is a 64-bit Windows PE file. It is the ransomware itself, so by the time this file is executed during an attack, the attackers probably already had extensive access to the victim’s network, and they had already exfiltrated the data they will use for the extortion. This sample does not have the capability to communicate with the threat actors. Its sole purpose is to find and encrypt files. However, it does this in an interesting and complex manner.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Ransomware"
        ],
        "refs": [
          "https://www.fortinet.com/blog/threat-research/looking-inside-pandoras-box"
        ]
      },
      "uuid": "be5ef3ea-bbf0-11ec-8422-0242ac120002",
      "value": "OSRS Ransomware: Pandora Ransomware"
    },
	{
      "description": "Ransomware used by the threat group FIN7.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Ransomware"
        ],
        "refs": [
          "https://www.mandiant.com/resources/evolution-of-fin7"
        ]
      },
      "uuid": "be5efbec-bbf0-11ec-8422-0242ac120002",
      "value": "OSRS Ransomware: Darkside Ransomware"
    },
	{
      "description": "SunnyDay is a simple piece of ransomware based on the SALSA20 stream cipher. It comes with an RSA public key blob embedded to encrypt a generated key used by the symmetric SALSA20 that will damage all the available files on the machine. One of the reasons criminals are using SALSA20 is because it offers speeds of around 4–14 cycles per byte in software on modern x86 processors and reasonable hardware performance.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Ransomware"
        ],
        "refs": [
          "https://seguranca-informatica.pt/analysis-of-the-sunnyday-ransomware/?utm_source=feedly&utm_medium=rss&utm_campaign=analysis-of-the-sunnyday-ransomware#.YlbZlsjMKUk"
        ]
      },
      "uuid": "be5efda4-bbf0-11ec-8422-0242ac120002",
      "value": "OSRS Ransomware: SunnyDay Ransomware"
    },
	{
      "description": "In one of the fastest ransomware cases we have observed, in under four hours the threat actors went from initial access, to domain wide ransomware. The initial access vector for this case was an IcedID payload delivered via email. We have observed IcedID malware being utilized as the initial access by various ransomware groups. Once the initial IcedID payload was executed, approximately 2 hours after initial infection, the threat actors appeared to begin hands-on-keyboard activity. Cobalt Strike and RDP were used to move across the network before using WMI and PsExec to deploy the Quantum ransomware. This case exemplified an extremely short Time-to-Ransom (TTR) of 3 hours and 44 minutes.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Ransomware"
        ],
        "refs": [
          "https://thedfirreport.com/2022/04/25/quantum-ransomware/"
        ]
      },
      "uuid": "a85b0646-d393-11ec-9d64-0242ac120002",
      "value": "OSRS Ransomware: Quantum Ransomware"
    },
	{
      "description": "The Black Basta ransomware was first observed in mid-April 2022, but had already caused substantial damage to over ten organizations. This new ransomware became more public after leaking data of the American Dental Association, from which the Black Basta gang was able to exfiltrate 2.9 GB of data. Black Basta ransomware must be executed with Administrator privileges, otherwise this ransomware is harmless.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Ransomware"
        ],
        "refs": [
          "https://blog.minerva-labs.com/new-black-basta-ransomware-hijacks-windows-fax-service"
        ]
      },
      "uuid": "a85b07cc-d393-11ec-9d64-0242ac120002",
      "value": "OSRS Ransomware: Black Basta Ransomware"
    },
	{
      "description": "New version of Chaos Ransomware.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Ransomware"
        ],
        "refs": [
          "https://blogs.blackberry.com/en/2022/05/yashma-ransomware-tracing-the-chaos-family-tree"
        ],
        "synonyms": [
        "Chaos Ransomware"
        ]
      },
      "uuid": "802338ce-e1a8-11ec-8fea-0242ac120002",
      "value": "OSRS Ransomware: Yashma Ransomware"
    },
	{
      "description": "YourCyanide is a sophisticated ransomware that integrates PasteBin, Discord, and Microsoft document links as part of its payload download routine. YourCyanide contains multiple layers of obfuscation and takes advantage of custom environment variables and the Enable Delayed Expansion function to hide its activities. As part of its evasion strategy, YourCyanide will also pass through different files, downloading the succeeding files via Discord and Pastebin with each step before eventually downloading the main payload.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Ransomware"
        ],
        "refs": [
          "https://www.trendmicro.com/en_us/research/22/f/yourcyanide-a-cmd-based-ransomware.html"
        ]
      },
      "uuid": "798dd172-e662-11ec-8fea-0242ac120002",
      "value": "OSRS Ransomware: YourCyanide Ransomware"
    },
	{
      "description": "Previous versoin of YourCyanide Ransomware.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Ransomware"
        ],
        "refs": [
          "https://www.trendmicro.com/en_us/research/22/f/yourcyanide-a-cmd-based-ransomware.html"
        ]
      },
      "uuid": "798dd3fc-e662-11ec-8fea-0242ac120002",
      "value": "OSRS Ransomware: GonnaCope Ransomware"
    },
	{
      "description": "Previous versoin of YourCyanide Ransomware.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Ransomware"
        ],
        "refs": [
          "https://www.trendmicro.com/en_us/research/22/f/yourcyanide-a-cmd-based-ransomware.html"
        ]
      },
      "uuid": "798dd550-e662-11ec-8fea-0242ac120002",
      "value": "OSRS Ransomware: Kekpop Ransomware"
    },
	{
      "description": "Previous versoin of YourCyanide Ransomware.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Ransomware"
        ],
        "refs": [
          "https://www.trendmicro.com/en_us/research/22/f/yourcyanide-a-cmd-based-ransomware.html"
        ]
      },
      "uuid": "798dd672-e662-11ec-8fea-0242ac120002",
      "value": "OSRS Ransomware: Kekware Ransomware"
    },
	{
      "description": "The DeadBolt ransomware kicked off 2022 with a slew of attacks that targeted internet-facing Network-Attached Storage (NAS) devices. It was first seen targeting QNAP Systems, Inc. in January 2022. According to a report from attack surface solutions provider Censys.io, as of Jan. 26, 2022, out of 130,000 QNAP NAS devices that were potential targets, 4,988 services showed signs of a DeadBolt infection. A few weeks later, ASUSTOR, another NAS devices and video surveillance solutions vendor, also experienced DeadBolt ransomware attacks that targeted an unknown number of its devices. In March, DeadBolt attackers once again targeted QNAP devices, according to Censys.io, the number of infections reached 1,146 by March 19, 2022. Most recently, on May 19,2022, QNAP released a product security update stating that internet-connected QNAP devices were once again been targeted by DeadBolt, this time aiming at NAS devices using QTS 4.3.6 and QTS 4.4.1.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Ransomware"
        ],
        "refs": [
          "https://www.trendmicro.com/en_us/research/22/f/closing-the-door-deadbolt-ransomware-locks-out-vendors-with-mult.html"
        ]
      },
      "uuid": "798dd988-e662-11ec-8fea-0242ac120002",
      "value": "OSRS Ransomware: DeadBolt Ransomware"
    },
	{
      "description": "Variant of the Cerber ransomware family.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Ransomware"
        ],
        "refs": [
          "https://blog.cyble.com/2022/06/17/cerber2021-ransomware-back-in-action/"
        ],
        "synonyms": [
        "CerberImposter"
        ]
      },
      "uuid": "82e2dcfa-f6dd-11ec-b939-0242ac120002",
      "value": "OSRS Ransomware: Cerber2021 Ransomware"
    },
	{
      "description": "Zeon ransomware was first observed in late January 2022. The group does not currently advertise its victims or data via a known public blog, although the dropped ransom note makes the usual threat of such public exposure for non-compliant victims, stating We’ve downloaded a pack of your internal data and are ready to publish it on out news website if you do not respond. The ransom note further prompts victims to visit a TOR-based payment portal to proceed with the payment. According to one source, victims must pay in XMR or BTC, with a fee of 25% in case of the latter. Observed Zeon payloads are Python-based executables packaged via pyInstaller and further obfuscated via pyArmor.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Ransomware"
        ],
        "refs": [
          "https://www.sentinelone.com/blog/from-the-front-lines-3-new-and-emerging-ransomware-threats-striking-businesses-in-2022/"
        ]
      },
      "uuid": "82e2deb2-f6dd-11ec-b939-0242ac120002",
      "value": "OSRS Ransomware: Zeon Ransomware"
    },
	{
      "description": "HelloXD is a new ransomware family that first appeared towards the end of 2021. It is another in a long line of families derived from the various Babuk source code leaks. As such, both Windows and Linux variants of HelloXD have been observed. Like Zeon, HelloXD does not currently host a public blog or victim shaming site. The ransom note instructs victims to engage the attackers via TOX chat as opposed to a direct chat link, .onion TOR website or standard email.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Ransomware"
        ],
        "refs": [
          "https://www.sentinelone.com/blog/from-the-front-lines-3-new-and-emerging-ransomware-threats-striking-businesses-in-2022/"
        ]
      },
      "uuid": "82e2dfac-f6dd-11ec-b939-0242ac120002",
      "value": "OSRS Ransomware: HelloXD Ransomware"
    },
	{
      "description": "In May 2022, researchers found another Babuk-derivative that behaves very similarly to HelloXD called Dark Angels (aka DarkAngels). Early reports on Dark Angels suggest that each ransomware sample is targeted specifically for a given organization, not unlike Mindware and SFile, which we reported on previously. Dark Angels victims are instructed to communicate with the threat actor via TOR-based chat portal and are given the (now) usual warning about not attempting to contact law enforcement, engage recovery teams or hire negotiators.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Ransomware"
        ],
        "refs": [
          "https://www.sentinelone.com/blog/from-the-front-lines-3-new-and-emerging-ransomware-threats-striking-businesses-in-2022/"
        ],
        "synonyms": [
        "DarkAngels Ransomware"
        ]
      },
      "uuid": "82e2e0ba-f6dd-11ec-b939-0242ac120002",
      "value": "OSRS Ransomware: Dark Angels Ransomware"
    },
	{
      "description": "First identified in 2021, AstraLocker is a fork of Babuk, ransomware used by the cybercriminal group of the same name. The Babuk group operated a Ransomware-as-a-Service (RaaS) platform and licensed its software to affiliates to carry out attacks. Babuk first appeared in early 2021 and was linked to a string of high-profile attacks, including a ransomware attack and data leak targeting Washington D.C.’s Metro Police Department in April, 2021. By September of 2021, the Babuk group became a target itself, when the Babuk source code was stolen and leaked to a Russian hacking forum.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Ransomware"
        ],
        "refs": [
          "https://blog.reversinglabs.com/blog/smash-and-grab-astralocker-2-pushes-ransomware-direct-from-office-docs"
        ]
      },
      "uuid": "8c2139cc-fd2e-11ec-b939-0242ac120002",
      "value": "OSRS Ransomware: AstraLocker Ransomware"
    },
	{
      "description": "ReversingLabs recently discovered of a new version of the AstraLocker ransomware (AstraLocker 2.0) that was being distributed directly from Microsoft Office files used as bait in phishing attacks. Our analysis suggests that the threat actor responsible for this campaign likely obtained the underlying code for AstraLocker 2.0 from a leak of the Babuk ransomware in September 2021. Links between the two campaigns include shared code and campaign markers, while a Monero wallet address listed for ransom payment is tied to the Chaos Ransomware gang.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Ransomware"
        ],
        "refs": [
          "https://blog.reversinglabs.com/blog/smash-and-grab-astralocker-2-pushes-ransomware-direct-from-office-docs"
        ]
      },
      "uuid": "8c213bde-fd2e-11ec-b939-0242ac120002",
      "value": "OSRS Ransomware: AstraLocker 2.0 Ransomware"
    },
	{
      "description": "AnteFrigus is distributed through malvertising that redirects users to the the RIG exploit kit. Unlike other ransomware, AnteFrigus does not target the C drive, but only other drives commonly associated with removable devices and mapped network drives. The RIG exploit kit uses malicious scripts hosted on attacker-owned or compromised sites that exploit vulnerabilities in Internet Explorer. If these vulnerabilities can be exploited, it will then install a payload in the visitor's machine without their knowledge. This ransomware only targets the D, E, F, G, H, and I drives. It does not encrypt any files located on the C drive or unmapped network shares.",
      "meta": {
	  "kill_chain": [
          "osrs-maltech:Ransomware"
        ],
        "refs": [
          "https://www.bleepingcomputer.com/news/security/strange-antefrigus-ransomware-only-targets-specific-drives/"
        ]
      },
      "uuid": "58551980-41ea-11ea-b77f-2e728ce88125",
      "value": "OSRS Ransomware: AnteFrigus Ransomware"
    }
	  ],
	"version": 21
}
