{
  "category": "OSRS-Security-Tools-Index",
  "description": "The OSRS security tools index is used to track new developments of security testing tools as well as create an inventory of these tool types for easy look-up.",
  "name": "OSRS-Security-Tools-Index",
  "source": "Open Sources",
  "type": "OSRS-Security-Tools-Index",
  "uuid": "bd0b3a26-cd82-11e9-a32f-2a2ae2dbcce4",
  "values": [
	  {
      "description": "Test place holder",
      "meta": {
        "refs": [
          "https://en.wikipedia.org/wiki/Penetration_test"
        ]
      },
      "uuid": "d9875e0a-cd82-11e9-a32f-2a2ae2dbcce4",
      "value": "Test OSRS-Security-Tools-Index Value"
    },
	{
      "description": "Nmap (Network Mapper) is a free and open-source network scanner created by Gordon Lyon (also known by his pseudonym Fyodor Vaskovich). Nmap is used to discover hosts and services on a computer network by sending packets and analyzing the responses. Nmap provides a number of features for probing computer networks, including host discovery and service and operating system detection. These features are extensible by scripts that provide more advanced service detection, vulnerability detection, and other features. Nmap can adapt to network conditions including latency and congestion during a scan. Nmap started as a Linux utility and was ported to other systems including Windows, macOS, and BSD. Linux is the most popular platform, followed by Windows.",
      "meta": {
        "refs": [
          "https://en.wikipedia.org/wiki/Nmap",
		  "https://packetstormsecurity.com/files/154000/nmap-7.80.tgz"
        ]
      },
      "uuid": "736b8676-cdbb-11e9-a32f-2a2ae2dbcce4",
      "value": "Nmap Port Scanner"
    },
	{
      "description": "The Mandos system allows computers to have encrypted root file systems and at the same time be capable of remote or unattended reboots. The computers run a small client program in the initial RAM disk environment which will communicate with a server over a network. All network communication is encrypted using TLS. The clients are identified by the server using an OpenPGP key that is unique to each client. The server sends the clients an encrypted password. The encrypted password is decrypted by the clients using the same OpenPGP key, and the password is then used to unlock the root file system.",
      "meta": {
        "refs": [
          "https://packetstormsecurity.com/files/154148/mandos_1.8.8.orig.tar.gz",
		  "https://www.recompile.se/mandos"
        ]
      },
      "uuid": "736b8b94-cdbb-11e9-a32f-2a2ae2dbcce4",
      "value": "Mandos Encrypted File System Unattended Reboot Utility"
    },
	{
      "description": "Haveged is a daemon that feeds the /dev/random pool on Linux using an adaptation of the HArdware Volatile Entropy Gathering and Expansion algorithm invented at IRISA. The algorithm is self-tuning on machines with cpuid support, and has been tested in both 32-bit and 64-bit environments. The tarball uses the GNU build mechanism, and includes self test targets and a spec file for those who want to build an RPM.",
      "meta": {
        "refs": [
          "https://wiki.archlinux.org/index.php/Haveged",
		  "https://packetstormsecurity.com/files/154166/haveged-1.9.5-alpha.tar.gz"
        ]
      },
      "uuid": "736b8cde-cdbb-11e9-a32f-2a2ae2dbcce4",
      "value": "Haveged"
    },
	{
      "description": "Tor is free and open-source software for enabling anonymous communication. The name is derived from an acronym for the original software project name The Onion Router. Tor directs Internet traffic through a free, worldwide, volunteer overlay network consisting of more than seven thousand relays to conceal a user's location and usage from anyone conducting network surveillance or traffic analysis. Using Tor makes it more difficult to trace Internet activity to the user; this includes, visits to Web sites, online posts, instant messages, and other communication forms. Tor's intended use is to protect the personal privacy of its users, as well as their freedom and ability to conduct confidential communication by keeping their Internet activities from being monitored.",
      "meta": {
        "refs": [
          "https://en.wikipedia.org/wiki/Tor_(anonymity_network)",
		  "https://packetstormsecurity.com/files/154167/tor-0.4.1.5.tar.gz"
        ]
      },
      "uuid": "736b8e1e-cdbb-11e9-a32f-2a2ae2dbcce4",
      "value": "TOR Virtual Network Tunneling Tool"
    },
	{
      "description": "Tinc is a Virtual Private Network (VPN) daemon that uses tunnelling and encryption to create a secure private network between hosts on the Internet. tinc is Free Software and licensed under the GNU General Public License version 2 or later. Because the VPN appears to the IP level network code as a normal network device, there is no need to adapt any existing software. This allows VPN sites to share information with each other over the Internet without exposing any information to others.",
      "meta": {
        "refs": [
          "https://www.tinc-vpn.org",
		  "https://packetstormsecurity.com/files/154218/tinc-1.0.36.tar.gz"
        ]
      },
      "uuid": "b8bcbfc8-cdbc-11e9-a32f-2a2ae2dbcce4",
      "value": "Tinc Virtual Private Network Daemon"
    },
	{
      "description": "I2P is an anonymous network built on top of the internet. It allows netizens to create and access content and build online communities on a network that is both distributed and dynamic. It is intended to protect communication and resist monitoring by third parties such as ISPs.",
      "meta": {
        "refs": [
          "https://geti2p.net/en/",
		  "https://packetstormsecurity.com/files/154241/i2psource_0.9.42.tar.bz2"
        ]
      },
      "uuid": "b8bcc338-cdbc-11e9-a32f-2a2ae2dbcce4",
      "value": "I2P"
    },
	{
      "description": "Zeek is a powerful network analysis framework that is much different from the typical IDS you may know. (Zeek is the new name for the long-established Bro system. Note that parts of the system retain the Bro name, and it also often appears in the documentation and distributions.)",
      "meta": {
        "refs": [
          "https://www.zeek.org/",
		  "https://packetstormsecurity.com/files/154248/bro-2.6.4.tar.gz"
        ],
		"synonyms": [
		"Bro Network Security Monitor",
		"Bro"
		]
      },
      "uuid": "b8bcc4a0-cdbc-11e9-a32f-2a2ae2dbcce4",
      "value": "Zeek Network Security Monitor"
    },
	{
      "description": "SSLsplit is a tool for man-in-the-middle attacks against SSL/TLS encrypted network connections. It is intended to be useful for network forensics, application security analysis and penetration testing. SSLsplit is designed to transparently terminate connections that are redirected to it using a network address translation engine. SSLsplit then terminates SSL/TLS and initiates a new SSL/TLS connection to the original destination address, while logging all data transmitted. Besides NAT based operation, SSLsplit also supports static destinations and using the server name indicated by SNI as upstream destination. SSLsplit is purely a transparent proxy and cannot act as a HTTP or SOCKS proxy configured in a browser.",
      "meta": {
        "refs": [
          "https://www.roe.ch/SSLsplit",
		  "https://packetstormsecurity.com/files/154273/sslsplit-0.5.5.tar.bz2"
        ]
      },
      "uuid": "b8bcc64e-cdbc-11e9-a32f-2a2ae2dbcce4",
      "value": "SSLsplit"
    },
	{
      "description": "BlackArch Linux is an Arch Linux-based penetration testing distribution for penetration testers and security researchers. The repository contains 2325 tools. You can install tools individually or in groups. BlackArch Linux is compatible with existing Arch installs.",
      "meta": {
        "refs": [
          "https://www.blackarch.org"
        ]
      },
      "uuid": "b8bcca0e-cdbc-11e9-a32f-2a2ae2dbcce4",
      "value": "BlackArch Linux"
    },
	{
      "description": "sqlmap is an open source software that is used to detect and exploit database vulnerabilities and provides options for injecting malicious codes into them. It is a penetration testing tool that automates the process of detecting and exploiting SQL injection flaws providing its user interface in the terminal. The software is run at the command line and is available to download for different operating systems: Linux distributions, Windows and Mac OS operating systems. In addition to mapping and detecting vulnerabilities, the software enables access to the database, editing and deleting data, and viewing data in tables such as users, passwords, backups, phone numbers, e-mail addresses, credit cards and other confidential and sensitive information. sqlmap has full support for multiple DBMSs, including MySQL, Oracle, PostgreSQL, Microsoft SQL Server, Microsoft Access, IBM DB2, SQLite, Firebird and SAP MaxDB. And full support for all injection techniques - Boolean, Error, Stack, Time, Union.",
      "meta": {
        "refs": [
          "https://en.wikipedia.org/wiki/Sqlmap",
		  "https://packetstormsecurity.com/files/154303/sqlmap-1.3.9.tar.gz"
        ]
      },
      "uuid": "0794d3d6-ce78-11e9-a32f-2a2ae2dbcce4",
      "value": "SQLMAP - Automatic SQL Injection Tool"
    },
	{
      "description": "Windows persistence toolkit written in C#. Author - Brett Hawkins (@h4wkst3r)",
      "meta": {
        "refs": [
          "https://github.com/fireeye/SharPersist"
        ]
      },
      "uuid": "9c0c1e42-cffa-11e9-bb65-2a2ae2dbcce4",
      "value": "SharPersist"
    },
	{
      "description": "Seatbelt is a C# project that performs a number of security oriented host-survey safety checks relevant from both offensive and defensive security perspectives. Seatbelt is licensed under the BSD 3-Clause license.",
      "meta": {
        "refs": [
          "https://en.wikipedia.org/wiki/Penetration_test"
        ]
      },
      "uuid": "9c0c22e8-cffa-11e9-bb65-2a2ae2dbcce4",
      "value": "https://github.com/GhostPack/Seatbelt"
    },
	{
      "description": "SharpUp is a C# port of various PowerUp functionality. Currently, only the most common checks have been ported; no weaponization functions have yet been implemented.",
      "meta": {
        "refs": [
          "https://github.com/GhostPack/SharpUp"
        ]
      },
      "uuid": "9c0c2464-cffa-11e9-bb65-2a2ae2dbcce4",
      "value": "SharpUp"
    },
	{
      "description": ".NET port of PowerView. PowerView is a PowerShell tool to gain network situational awareness on Windows domains. It contains a set of pure-PowerShell replacements for various windows net commands, which utilize PowerShell AD hooks and underlying Win32 API functions to perform useful Windows domain functionality.",
      "meta": {
        "refs": [
          "https://github.com/tevora-threat/SharpView"
        ]
      },
      "uuid": "9c0c25ae-cffa-11e9-bb65-2a2ae2dbcce4",
      "value": "SharpView"
    },
	{
      "description": "Wapiti allows you to audit the security of your websites or web applications. It performs black-box scans (it does not study the source code) of the web application by crawling the webpages of the deployed webapp, looking for scripts and forms where it can inject data. Once it gets the list of URLs, forms and their inputs, Wapiti acts like a fuzzer, injecting payloads to see if a script is vulnerable.",
      "meta": {
        "refs": [
          "http://wapiti.sourceforge.net/"
        ]
      },
      "uuid": "9c0c26f8-cffa-11e9-bb65-2a2ae2dbcce4",
      "value": "Wapiti"
    },
	{
      "description": "GhIDA is an IDA Pro plugin that integrates the Ghidra decompiler in IDA.",
      "meta": {
        "refs": [
          "https://github.com/Cisco-Talos/GhIDA"
        ]
      },
      "uuid": "4c89b1cc-d649-11e9-bb65-2a2ae2dbcce4",
      "value": "GhIDA"
    },
	{
      "description": "The Interactive Disassembler is a disassembler for computer software which generates assembly language source code from machine-executable code. It supports a variety of executable formats for different processors and operating systems.",
      "meta": {
        "refs": [
          "https://www.hex-rays.com/products/ida/"
        ],
		"synonyms": [
		"Interactive Disassembler"
		]
      },
      "uuid": "4c89b4b0-d649-11e9-bb65-2a2ae2dbcce4",
      "value": "IDA Pro"
    },
	{
      "description": "StringSifter is a machine learning tool that automatically ranks strings based on their relevance for malware analysis.",
      "meta": {
        "refs": [
          "https://github.com/fireeye/stringsifter"
        ]
      },
      "uuid": "4c89b69a-d649-11e9-bb65-2a2ae2dbcce4",
      "value": "StringSifter"
    },
	{
      "description": "Seatbelt is a C# project that performs a number of security oriented host-survey safety checks relevant from both offensive and defensive security perspectives.",
      "meta": {
        "refs": [
          "https://github.com/GhostPack/Seatbelt"
        ]
      },
      "uuid": "4c89b8a2-d649-11e9-bb65-2a2ae2dbcce4",
      "value": "SeatBelt"
    },
	{
      "description": "OpenSSL is a robust, commercial-grade, and full-featured toolkit for the Transport Layer Security (TLS) and Secure Sockets Layer (SSL) protocols. It is also a general-purpose cryptography library.",
      "meta": {
        "refs": [
          "https://www.openssl.org/"
        ]
      },
      "uuid": "4c89bbb8-d649-11e9-bb65-2a2ae2dbcce4",
      "value": "OpenSSL Toolkit"
    },
	{
      "description": "MailSniper is a penetration testing tool for searching through email in a Microsoft Exchange environment for specific terms (passwords, insider intel, network architecture information, etc.). It can be used as a non-administrative user to search their own email, or by an Exchange administrator to search the mailboxes of every user in a domain. MailSniper also includes additional modules for password spraying, enumerating users/domains, gathering the Global Address List from OWA and EWS, and checking mailbox permissions for every Exchange user at an organization.",
      "meta": {
        "refs": [
          "https://github.com/dafthack/MailSniper"
        ]
      },
      "uuid": "59164670-d64a-11e9-bb65-2a2ae2dbcce4",
      "value": "MailSniper"
    },
	{
      "description": "Windows File Enumeration Intel Gathering. Standard users can prove existence of privileged user artifacts. Typically, the Windows commands DIR or TYPE hand out a default Access Denied error message, when a file exists or doesn't exist, when restricted access is attempted by another user.  However, accessing files directly by attempting to open them from cmd.exe shell, we can determine existence by compare inconsistent Windows error messages.",
      "meta": {
        "refs": [
          "https://seclists.org/bugtraq/2019/Sep/16"
        ],
		"synonyms": [
		"Windows File Enumeration Intel Gathering Tool"
		]
      },
      "uuid": "59164b20-d64a-11e9-bb65-2a2ae2dbcce4",
      "value": "NtFileSins"
    },
	{
      "description": "Invoke-ACLpwn is a tool that automates the discovery and pwnage of ACLs in Active Directory that are unsafe configured. Invoke-ACLpwn is designed to run with integrated credentials as well as with specified network credentials. The script works by creating an export of all ACLs in the domain with SharpHound as well as the group membership of the user account that the tool is running under. If the user does not already have writeDACL permissions on the domain object, the tool will enumerate all ACEs of the ACL of the domain. Every identity in an ACE has an ACL of its own, which is added to the enumeration queue. If the identity is a group and the group has members, every group member is added to the enumeration queue as well.",
      "meta": {
        "refs": [
          "https://github.com/fox-it/Invoke-ACLPwn"
        ]
      },
      "uuid": "59164cb0-d64a-11e9-bb65-2a2ae2dbcce4",
      "value": "Invoke-ACLpwn"
    },
	{
      "description": "SharpHound uses graph theory to reveal the hidden and often unintended relationships within an Active Directory environment. Attacks can use SharpHound to easily identify highly complex attack paths that would otherwise be impossible to quickly identify. Defenders can use SharpHound to identify and eliminate those same attack paths. Both blue and red teams can use SharpHound to easily gain a deeper understanding of privilege relationships in an Active Directory environment. ",
      "meta": {
        "refs": [
          "https://github.com/BloodHoundAD/SharpHound"
        ]
      },
      "uuid": "59164de6-d64a-11e9-bb65-2a2ae2dbcce4",
      "value": "SharpHound"
    },
	{
      "description": "SingleFile is a Web Extension compatible with Chrome, Firefox (Desktop and Mobile), Chromium-based Edge, Vivaldi, Brave, Waterfox, Yandex browser, and Opera. It helps you to save a complete web page into a single HTML file.",
      "meta": {
        "refs": [
          "https://github.com/gildas-lormeau/SingleFile"
        ]
      },
      "uuid": "591650f2-d64a-11e9-bb65-2a2ae2dbcce4",
      "value": "SingleFile"
    },
	{
      "description": "Version 1.0.0. This tool is a PoC to demonstrate the ability of an attacker to perform an SMB or HTTP based NTLM relay attack to the EWS endpoint on an on-premise Microsoft Exchange server to compromise the mailbox of the victim. This tool provides the attacker with an OWA looking interface, with access to the user mailbox and contacts.",
      "meta": {
        "refs": [
          "https://github.com/quickbreach/ExchangeRelayX"
        ]
      },
      "uuid": "1c1210d6-d64c-11e9-bb65-2a2ae2dbcce4",
      "value": "ExchangeRelayX"
    },
	{
      "description": "ntlmRelayToEWS is a tool for performing ntlm relay attacks on Exchange Web Services (EWS). It spawns an SMBListener on port 445 and an HTTPListener on port 80, waiting for incoming connection from the victim. Once the victim connects to one of the listeners, an NTLM negociation occurs and is relayed to the target EWS server.",
      "meta": {
        "refs": [
          "https://github.com/Arno0x/NtlmRelayToEWS"
        ]
      },
      "uuid": "1c121388-d64c-11e9-bb65-2a2ae2dbcce4",
      "value": "NtlmRelayToEWS"
    },
	{
      "description": "Impacket is a collection of Python classes for working with network protocols. Impacket is focused on providing low-level programmatic access to the packets and for some protocols (e.g. SMB1-3 and MSRPC) the protocol implementation itself. Packets can be constructed from scratch, as well as parsed from raw data, and the object oriented API makes it simple to work with deep hierarchies of protocols. The library provides a set of tools as examples of what can be done within the context of this library.",
      "meta": {
        "refs": [
          "https://en.wikipedia.org/wiki/Penetration_test"
        ]
      },
      "uuid": "1c121504-d64c-11e9-bb65-2a2ae2dbcce4",
      "value": "Impacket"
    },
	{
      "description": "HTTrack is a free (GPL, libre free software) and easy-to-use offline browser utility. It allows you to download a World Wide Web site from the Internet to a local directory, building recursively all directories, getting HTML, images, and other files from the server to your computer. HTTrack arranges the original site's relative link-structure. Simply open a page of the mirrored website in your browser, and you can browse the site from link to link, as if you were viewing it online. HTTrack can also update an existing mirrored site, and resume interrupted downloads. HTTrack is fully configurable, and has an integrated help system.",
      "meta": {
        "refs": [
          "https://www.httrack.com/"
        ]
      },
      "uuid": "1c121644-d64c-11e9-bb65-2a2ae2dbcce4",
      "value": "HTTrack Website Copier"
    },
	{
      "description": "Wireshark is the world’s foremost and widely-used network protocol analyzer. It lets you see what’s happening on your network at a microscopic level and is the de facto (and often de jure) standard across many commercial and non-profit enterprises, government agencies, and educational institutions. Wireshark development thrives thanks to the volunteer contributions of networking experts around the globe and is the continuation of a project started by Gerald Combs in 1998.",
      "meta": {
        "refs": [
          "https://www.wireshark.org"
        ]
      },
      "uuid": "1c121784-d64c-11e9-bb65-2a2ae2dbcce4",
      "value": "Wireshark"
    },
	{
      "description": "Small plugin to detect mobile browser.",
      "meta": {
        "refs": [
          "https://github.com/smali-kazmi/detect-mobile-browser"
        ]
      },
      "uuid": "8dcdc7b0-db10-11e9-8a34-2a2ae2dbcce4",
      "value": "Detect Mobile Browser"
    },
	{
      "description": "Certutil.exe is a command-line program that is installed as part of Certificate Services. You can use Certutil.exe to dump and display certification authority (CA) configuration information, configure Certificate Services, backup and restore CA components, and verify certificates, key pairs, and certificate chains.",
      "meta": {
        "refs": [
          "https://docs.microsoft.com/en-us/windows-server/administration/windows-commands/certutil"
        ]
      },
      "uuid": "8dcdca30-db10-11e9-8a34-2a2ae2dbcce4",
      "value": "Certutil.exe (certutil)"
    },
	{
      "description": "For many years, WinPcap has been recognized as the industry-standard tool for link-layer network access in Windows environments, allowing applications to capture and transmit network packets bypassing the protocol stack, and including kernel-level packet filtering, a network statistics engine and support for remote packet capture.",
      "meta": {
        "refs": [
          "https://www.winpcap.org"
        ]
      },
      "uuid": "8dcdcc4c-db10-11e9-8a34-2a2ae2dbcce4",
      "value": "WinPcap"
    },
	{
      "description": "MASSCAN is an Internet-scale port scanner. It can scan the entire Internet in under 6 minutes, transmitting 10 million packets per second, from a single machine. It's input/output is similar to nmap. Internally, it uses asynchronous tranmissions, similar to port scanners like scanrand, unicornscan, and ZMap. It's more flexible, allowing arbitrary port and address ranges. MASSCAN uses a its own custom TCP/IP stack.",
      "meta": {
        "refs": [
          "https://github.com/robertdavidgraham/masscan"
        ]
      },
      "uuid": "8dcdcdbe-db10-11e9-8a34-2a2ae2dbcce4",
      "value": "MASSCAN"
    },
	{
      "description": "PacketFence is a fully supported, trusted, Free and Open Source network access control (NAC) solution. Boasting an impressive feature set including a captive-portal for registration and remediation, centralized wired and wireless management, powerful BYOD management options, 802.1X support, layer-2 isolation of problematic devices; PacketFence can be used to effectively secure networks small to very large heterogeneous networks.",
      "meta": {
        "refs": [
          "https://packetfence.org/"
        ]
      },
      "uuid": "8dcdd1a6-db10-11e9-8a34-2a2ae2dbcce4",
      "value": "PacketFence"
    },
	{
      "description": "Webfwlog is a flexible web-based firewall log analyzer and reporting tool. It supports standard system logs for linux, FreeBSD, OpenBSD, NetBSD, Solaris, Irix, OS X, etc. as well as Windows XP. Supported log file formats are netfilter, ipfilter, ipfw, ipchains and Windows XP. Webfwlog also supports logs saved in a database using the ULOG or NFLOG targets of the linux netfilter project, or any other database logs mapped with a view to the ulogd schema. Versions 1 and 2 of ulogd database schemas are supported.",
      "meta": {
        "refs": [
          "http://webfwlog.sourceforge.net/"
        ]
      },
      "uuid": "b9e59d9a-dd73-11e9-8a34-2a2ae2dbcce4",
      "value": "Webfwlog Firewall Log Analyzer"
    },
	{
      "description": "Cross Site Scripter (aka XSSer) is an automatic framework to detect, exploit and report XSS vulnerabilities in web-based applications. It provides several options to try to bypass certain filters and various special techniques for code injection.",
      "meta": {
        "refs": [
          "https://github.com/epsylon/xsser"
        ]
      },
      "uuid": "c78adc36-e18c-11e9-a359-2a2ae2dbcce4",
      "value": "XSSer"
    },
	{
      "description": "Suricata is a free and open source, mature, fast and robust network threat detection engine. The Suricata engine is capable of real time intrusion detection (IDS), inline intrusion prevention (IPS), network security monitoring (NSM) and offline pcap processing. Suricata inspects the network traffic using a powerful and extensive rules and signature language, and has powerful Lua scripting support for detection of complex threats. With standard input and output formats like YAML and JSON integrations with tools like existing SIEMs, Splunk, Logstash/Elasticsearch, Kibana, and other database become effortless. Suricata’s fast paced community driven development focuses on security, usability and efficiency. The Suricata project and code is owned and supported by the Open Information Security Foundation (OISF), a non-profit foundation committed to ensuring Suricata’s development and sustained success as an open source project.",
      "meta": {
        "refs": [
          "https://suricata-ids.org/"
        ]
      },
      "uuid": "c78ade84-e18c-11e9-a359-2a2ae2dbcce4",
      "value": "Suricata"
    },
	{
      "description": "Gephi is an interactive visualization and exploration platform for all kinds of networks and complex systems, dynamic and hierarchical graphs. Gephi is a tool for people that have to explore and understand graphs. Like Photoshop but for graphs, the user interacts with the representation, manipulate the structures, shapes and colors to reveal hidden properties. The goal is to help data analysts to make hypothesis, intuitively discover patterns, isolate structure singularities or faults during data sourcing. It is a complementary tool to traditional statistics, as visual thinking with interactive interfaces is now recognized to facilitate reasoning. This is a software for Exploratory Data Analysis, a paradigm appeared in the Visual Analytics field of research.",
      "meta": {
        "refs": [
          "https://gephi.org",
		  "https://github.com/gephi/gephi/wiki"
        ]
      },
      "uuid": "c78adfd8-e18c-11e9-a359-2a2ae2dbcce4",
      "value": "Gephi"
    },
	{
      "description": "Yara rule set that can be used to detect Russian APT like behaviors.",
      "meta": {
        "refs": [
          "https://github.com/ITAYC0HEN/APT-Ecosystem/tree/master/russia/detector"
        ]
      },
      "uuid": "c78ae104-e18c-11e9-a359-2a2ae2dbcce4",
      "value": "Russian APT Detector"
    },
	{
      "description": "Falco is a behavioral activity monitor designed to detect anomalous activity in your applications. Powered by sysdig’s system call capture infrastructure, Falco lets you continuously monitor and detect container, application, host, and network activity—all in one place—from one source of data, with one set of rules. Falco is hosted by the Cloud Native Computing Foundation (CNCF) as a sandbox level project. If you are an organization that wants to help shape the evolution of technologies that are container-packaged, dynamically-scheduled and microservices-oriented, consider joining the CNCF. For details read the Falco CNCF project proposal.",
      "meta": {
        "refs": [
          "https://github.com/falcosecurity/falco"
        ]
      },
      "uuid": "c78ae230-e18c-11e9-a359-2a2ae2dbcce4",
      "value": "Falco"
    },
	{
      "description": "Open-source jailbreaking tool for many iOS devices.",
      "meta": {
        "refs": [
          "https://github.com/axi0mX/ipwndfu"
        ]
      },
      "uuid": "a981cbd2-e5ec-11e9-81b4-2a2ae2dbcce4",
      "value": "checkm8"
    },
	{
      "description": "THE MAIN CHARACTERISTICS OF Goliath .NET Obfuscator. 100 percent VB.NET & CLSCompliant. Support FW 1.x & 2.0. Support Compilers: C#, VB.NET, Delphi.NET. GUI Wizard Style. Manual Parsing of .NET Assembly. New Renaming Printable or Unprintable Chars. Choose Symbols Overloads. Choose Obfuscation Renaming or Polymorphic. Automatic Renaming Class Resources. Choose Renaming Namespaces. Choose Encryption Code for Strings Static or Polymorphic. Choose Encryption Text by Selection Table. Signing .NET Assembly with a Strong Name. Automatic Support Multi-Language.",
      "meta": {
        "refs": [
          "https://goliath-net-obfuscator.apponic.com"
        ]
      },
      "uuid": "a981ceac-e5ec-11e9-81b4-2a2ae2dbcce4",
      "value": "Goliath.NET Obfuscator"
    },
	{
      "description": "Babel Obfuscator is a powerful protection tool for the Microsoft .NET Framework. Programs written in .NET languages, like C# and Visual Basic .NET, are normally easy to reverse engineer because they compile to MSIL (Microsoft Intermediate Language), a CPU-independent instruction set that is embedded into .NET assemblies, along with metadata allowing the reconstruction of original source code. Babel Obfuscator is able to transform assemblies in order to conceal the code, so that reversing is extremely difficult. This transformation process is called obfuscation.",
      "meta": {
        "refs": [
          "http://www.babelfor.net/products#Obfuscator"
        ]
      },
      "uuid": "a981d104-e5ec-11e9-81b4-2a2ae2dbcce4",
      "value": "babelfor.NET Obfuscator"
    },
	{
      "description": "Spices.Net Obfuscator is a .Net code obfuscation, protection and optimization tool that offers the wide range of technologies to completely protect your .Net code and secure your data. Spices.Net Obfuscator rebuilds your .Net assemblies to the new format that is impossible to disassemble, decompile, impossible to understand. .Net Obfuscator is a part of Spices.Net and offered as Visual Studio Integrated package (Spices.VSIP.Obfuscator), standalone GUI program and as console edition. You can use Spices.Net Obfuscator as freeware for non-commercial use, all features of Spices.Net Obfuscator in Free Evaluation version are presented and work without limitations.",
      "meta": {
        "refs": [
          "https://www.9rays.net/Category/55-spicesnet-obfuscator.aspx"
        ],
		"synonyms": [
		"Spices.Net Obfuscator"
		]
      },
      "uuid": "a981d2da-e5ec-11e9-81b4-2a2ae2dbcce4",
      "value": "9rays"
    },
	{
      "description": "Easily integrate Content-Security-Policy headers into your web application, either from a JSON configuration file, or programatically. CSP Builder was created by Paragon Initiative Enterprises as part of our effort to encourage better application security practices.",
      "meta": {
        "refs": [
          "https://github.com/paragonie/csp-builder"
        ]
      },
      "uuid": "a981d4c4-e5ec-11e9-81b4-2a2ae2dbcce4",
      "value": "Content Security Policy Builder (CSPB)"
    },
	{
      "description": "Code disassembler much like the popular IDA code disassembler.",
      "meta": {
        "refs": [
          "https://rada.re/"
        ]
      },
      "uuid": "a58e4f62-e5ee-11e9-81b4-2a2ae2dbcce4",
      "value": "Radare2"
    },
	{
      "description": "DFIR linux created by veterans of the Backtrack and Deft linux teams.",
      "meta": {
        "refs": [
          "https://tsurugi-linux.org"
        ]
      },
      "uuid": "a58e51d8-e5ee-11e9-81b4-2a2ae2dbcce4",
      "value": "TSURUGI Linux"
    },
	{
      "description": "The Hex-Rays Decompiler brings binary software analysis within reach of millions of programmers. It converts native processor code into a readable C-like pseudocode text. Currently, the decompiler supports compiler generated code for the x86, x64, ARM32, ARM64, and PowerPC processors and we are adding support for other platforms on an ongoing basis. The programmatic API allows you to improve the decompiler output, giving flexibility to your analysis of areas such as vulnerability search, software validation, and coverage. The decompiler runs on all standard platforms - MS Windows, Linux, and Mac OS X, both in GUI and console modes.",
      "meta": {
        "refs": [
          "https://www.hex-rays.com/products/decompiler/index.shtml"
        ]
      },
      "uuid": "a58e5322-e5ee-11e9-81b4-2a2ae2dbcce4",
      "value": "The Hex-Rays Decompiler"
    },
	{
      "description": "The jtool utility started as a companion utility to the 1st edition of MacOS internals, because I wanted to demonstrate Mach-O format intrinstics, and was annoyed with XCode's otool. Along the way, jtool absorbed additional Mach-O commands such as atos, dyldinfo, nm, segedit, pagestuff, strings, and even codesign; and, the informal ldid. Most importantly, it can be run on a variety of platforms - OS X, iOS, and even Linux, where Apple's tools don't exist. jtool provides many many novel features - in-binary search functionality, symbol injection built-in disassembler functionality with (limited but constantly improving) emulation capabilities, which already outdo fancy commercial GUI disassemblers.",
      "meta": {
        "refs": [
          "http://www.newosxbook.com/tools/jtool.html"
        ]
      },
      "uuid": "a58e546c-e5ee-11e9-81b4-2a2ae2dbcce4",
      "value": "jtool"
    },
	{
      "description": "Gephi is the leading visualization and exploration software for all kinds of graphs and networks. Gephi is open-source and free. Runs on Windows, Mac OS X and Linux.",
      "meta": {
        "refs": [
          "https://gephi.org"
        ]
      },
      "uuid": "a58e55a2-e5ee-11e9-81b4-2a2ae2dbcce4",
      "value": "Gephi"
    },
	{
      "description": "Set of Yara rules and python scripts that assists with the detection of Russian-based APT like behaviors.",
      "meta": {
        "refs": [
          "https://github.com/ITAYC0HEN/APT-Ecosystem/tree/master/russia/detector"
        ]
      },
      "uuid": "a58e56ce-e5ee-11e9-81b4-2a2ae2dbcce4",
      "value": "Russian APT Detector"
    },
	{
      "description": "NebulousAD is a tool for auditing Active Directory user passwords against a database of compromised passwords found in data breaches. The tool was made to help Windows system administrators find and, optionally, remediate the use of compromised passwords. This approach is recommended by NIST 800-63B, and can help protect against credential spraying and stuffing attacks. The Nebulous database current holds over 2.5 billion unique hashes of breached passwords. NebulousAD uses the k-anonymity model by default to preserve the privacy and security of passwords checked against the API. Only the first five characters of a SHA-2 hash are sent to the API. The tool was originally released at BSides Las Vegas 2019.",
      "meta": {
        "refs": [
          "https://github.com/NuID/nebulousAD"
        ]
      },
      "uuid": "0438fcf4-e867-11e9-81b4-2a2ae2dbcce4",
      "value": "NebulousAD"
    },
	{
      "description": "Voice-activated control for your PC games and apps.",
      "meta": {
        "refs": [
          "https://voiceattack.com"
        ]
      },
      "uuid": "0438ffa6-e867-11e9-81b4-2a2ae2dbcce4",
      "value": "VoiceAttack"
    },
	{
      "description": "Foxit Software, Inc. develops Portable Document Format software and tools used to create, edit, sign, and secure files and digital documents. It is a software company headquartered in Fremont, California, with offices in Berlin, Beijing, Fuzhou, South Yarra, Australia and other locations.",
      "meta": {
        "refs": [
          "https://www.foxitsoftware.com"
        ]
      },
      "uuid": "043900f0-e867-11e9-81b4-2a2ae2dbcce4",
      "value": "Foxit"
    },
	{
      "description": "CyberChef is a simple, intuitive web app for carrying out all manner of cyber operations within a web browser. These operations include simple encoding like XOR or Base64, more complex encryption like AES, DES and Blowfish, creating binary and hexdumps, compression and decompression of data, calculating hashes and checksums, IPv6 and X.509 parsing, changing character encodings, and much more. The tool is designed to enable both technical and non-technical analysts to manipulate data in complex ways without having to deal with complex tools or algorithms. It was conceived, designed, built and incrementally improved by an analyst in their 10% innovation time over several years.",
      "meta": {
        "refs": [
          "https://gchq.github.io/CyberChef/",
		  "https://github.com/gchq/CyberChef"
        ]
      },
      "uuid": "04390352-e867-11e9-81b4-2a2ae2dbcce4",
      "value": "CyberChef"
    },
	{
      "description": "This is a reborn tool, used during the epoche dinosaurs were traipsing the earth. Basically it analyses PDF files for Metadata. You can direct it to a file or directory with pdfs. You can show it the url of a pdf or use the integrated googlesearch (thanx to mario vilas class) to search for pdfs at target site, download and analyse them.",
      "meta": {
        "refs": [
          "https://github.com/c0decave/pdfgrab"
        ]
      },
      "uuid": "043906e0-e867-11e9-81b4-2a2ae2dbcce4",
      "value": "PDFgrab"
    },
	{
      "description": "tcpdump is a common packet analyzer that runs under the command line. It allows the user to display TCP/IP and other packets being transmitted or received over a network to which the computer is attached. Distributed under the BSD license, tcpdump is free software. Tcpdump works on most Unix-like operating systems: Linux, Solaris, FreeBSD, DragonFly BSD, NetBSD, OpenBSD, OpenWrt, macOS, HP-UX 11i, and AIX. In those systems, tcpdump uses the libpcap library to capture packets. The port of tcpdump for Windows is called WinDump; it uses WinPcap, the Windows port of libpcap.",
      "meta": {
        "refs": [
          "https://github.com/the-tcpdump-group/",
		  "https://github.com/the-tcpdump-group/tcpdump",
		  "https://www.tcpdump.org",
		  "https://en.wikipedia.org/wiki/Tcpdump"
        ],
		"synonyms": [
		"WinDump"
		]
      },
      "uuid": "6f464106-e86b-11e9-81b4-2a2ae2dbcce4",
      "value": "TCPdump"
    },
	{
      "description": "WhatWeb identifies websites. Its goal is to answer the question, What is that Website?. WhatWeb recognises web technologies including content management systems (CMS), blogging platforms, statistic/analytics packages, JavaScript libraries, web servers, and embedded devices. WhatWeb has over 1800 plugins, each to recognise something different. WhatWeb also identifies version numbers, email addresses, account IDs, web framework modules, SQL errors, and more. WhatWeb can be stealthy and fast, or thorough but slow. WhatWeb supports an aggression level to control the trade off between speed and reliability. When you visit a website in your browser, the transaction includes many hints of what web technologies are powering that website. Sometimes a single webpage visit contains enough information to identify a website but when it does not, WhatWeb can interrogate the website further. The default level of aggression, called stealthy, is the fastest and requires only one HTTP request of a website. This is suitable for scanning public websites. More aggressive modes were developed for use in penetration tests. Most WhatWeb plugins are thorough and recognise a range of cues from subtle to obvious. For example, most WordPress websites can be identified by the meta HTML tag, but a minority of WordPress websites remove this identifying tag but this does not thwart WhatWeb. The WordPress WhatWeb plugin has over 15 tests, which include checking the favicon, default installation files, login pages, and checking for wp-content within relative links.",
      "meta": {
        "refs": [
          "https://github.com/urbanadventurer/WhatWeb"
        ]
      },
      "uuid": "6f464642-e86b-11e9-81b4-2a2ae2dbcce4",
      "value": "WhatWeb Scanner"
    },
	{
      "description": "RAW Graphs is an open source data visualization framework built with the goal of making the visual representation of complex data easy for everyone. Primarily conceived as a tool for designers and vis geeks, RAW Graphs aims at providing a missing link between spreadsheet applications (e.g. Microsoft Excel, Apple Numbers, OpenRefine) and vector graphics editors (e.g. Adobe Illustrator, Inkscape, Sketch). The project, led and maintained by the DensityDesign Research Lab (Politecnico di Milano) was released publicly in 2013 and is regarded by many as one of the most important tools in the field of data visualization. The team responsable for the design, development and mantainance of the project is composed by DensityDesign , Calibro and Inmagik , who joined the team in 2019.",
      "meta": {
        "refs": [
          "https://rawgraphs.io/"
        ]
      },
      "uuid": "e45561cc-ee9a-11e9-81b4-2a2ae2dbcce4",
      "value": "RAWGraphs"
    },
	{
      "description": "Ping Castle is a tool designed to assess quickly the Active Directory security level with a methodology based on risk assessment and a maturity framework. It does not aim at a perfect evaluation but rather as an efficiency compromise.",
      "meta": {
        "refs": [
          "https://github.com/vletoux/pingcastle",
		  "https://www.pingcastle.com"
        ]
      },
      "uuid": "e455641a-ee9a-11e9-81b4-2a2ae2dbcce4",
      "value": "PingCastle"
    },
	{
      "description": "Power Dump takes a 64 bit Windows 10 powershell process dump made using procdump and retrieves powershell blocks and variables from memory. Basically its strings on steroids with a little extra logic built-in for finding powershell. Only tested and built out right now for or on Windows 10 64 bit Intel.",
      "meta": {
        "refs": [
          "https://github.com/chrisjd20/power_dump",
		  "https://docs.microsoft.com/en-us/sysinternals/downloads/procdump"
        ]
      },
      "uuid": "e4556636-ee9a-11e9-81b4-2a2ae2dbcce4",
      "value": "PowerDump"
    },
	{
      "description": "FreeRDP is a free implementation of the Remote Desktop Protocol (RDP), released under the Apache license. Enjoy the freedom of using your software wherever you want, the way you want it, in a world where interoperability can finally liberate your computing experience.",
      "meta": {
        "refs": [
          "https://github.com/FreeRDP/FreeRDP",
		  "https://www.freerdp.com/",
		  "https://github.com/FreeRDP/FreeRDP/issues",
		  "https://pub.freerdp.com/releases/",
		  "https://pub.freerdp.com/api/"
        ]
      },
      "uuid": "e455678a-ee9a-11e9-81b4-2a2ae2dbcce4",
      "value": "FreeRDP"
    },
	{
      "description": "lnk2pwn is a gui tool that automates the process of generating malicious .lnk(Windows shortcut) files.",
      "meta": {
        "refs": [
          "https://github.com/tommelo/lnk2pwn",
		  "https://github.com/it-gorillaz/lnk2pwn"
        ]
      },
      "uuid": "e8d05fd0-ee9b-11e9-81b4-2a2ae2dbcce4",
      "value": "lnk2pwn"
    },
	{
      "description": "This tool will allow you to generate LNK payloads. Upon rendering or being run, they will exfiltrate data.",
      "meta": {
        "refs": [
          "https://github.com/Plazmaz/LNKUp"
        ]
      },
      "uuid": "e8d0628c-ee9b-11e9-81b4-2a2ae2dbcce4",
      "value": "LNKUp"
    },
	{
      "description": ".VBS that creates a .lnk file spoofing the file extension with unicode chars that reverses the .lnk file extension, appends .txt to the end and changes the icon to notepad to make it appear as a textfile. When executed, the payload is a powershell webdl and execute.",
      "meta": {
        "refs": [
          "https://github.com/xillwillx/tricky.lnk"
        ]
      },
      "uuid": "e8d063ea-ee9b-11e9-81b4-2a2ae2dbcce4",
      "value": "tricky.lnk"
    },
	{
      "description": "The Metasploit Framework is a Ruby-based, modular penetration testing platform that enables you to write, test, and execute exploit code. The Metasploit Framework contains a suite of tools that you can use to test security vulnerabilities, enumerate networks, execute attacks, and evade detection. At its core, the Metasploit Framework is a collection of commonly used tools that provide a complete environment for penetration testing and exploit development.",
      "meta": {
        "refs": [
          "https://www.metasploit.com/",
		  "https://metasploit.help.rapid7.com/v1/docs/about-metasploit-framework"
        ]
      },
      "uuid": "6de40d34-ee9c-11e9-81b4-2a2ae2dbcce4",
      "value": "Metasploit"
    },
	{
      "description": "Nishang is a framework and collection of scripts and payloads which enables usage of PowerShell for offensive security, penetration testing and red teaming. Nishang is useful during all phases of penetration testing.",
      "meta": {
        "refs": [
          "https://github.com/samratashok/nishang"
        ]
      },
      "uuid": "6de40f8c-ee9c-11e9-81b4-2a2ae2dbcce4",
      "value": "Ninshang Framework"
    },
	{
      "description": "This is an IDA processor module for the Tile-GX processor architecture. ",
      "meta": {
        "refs": [
          "https://github.com/Cisco-Talos/ida_tilegx"
        ]
      },
      "uuid": "6de410d6-ee9c-11e9-81b4-2a2ae2dbcce4",
      "value": "Tilera"
    },
	{
      "description": "Living Off The Land Binaries and Scripts collection.",
      "meta": {
        "refs": [
          "https://github.com/LOLBAS-Project/LOLBAS",
		  "https://lolbas-project.github.io/"
        ]
      },
      "uuid": "6de4120c-ee9c-11e9-81b4-2a2ae2dbcce4",
      "value": "Living Off The Land Binaries and Scripts (LOLBAS)"
    },
	{
      "description": "Shellcode runner for all application whitelisting bypasses.",
      "meta": {
        "refs": [
          "https://github.com/fireeye/DueDLLigence"
        ]
      },
      "uuid": "6de41338-ee9c-11e9-81b4-2a2ae2dbcce4",
      "value": "DueDLLigence"
    },
	{
      "description": "Faraday introduces a new concept - IPE (Integrated Penetration-Test Environment) a multiuser Penetration test IDE. Designed for distributing, indexing, and analyzing the data generated during a security audit. Faraday was made to let you take advantage of the available tools in the community in a truly multiuser way. Designed for simplicity, users should notice no difference between their own terminal application and the one included in Faraday. Developed with a specialized set of functionalities, users improve their own work. Do you remember the last time you programmed without an IDE? What IDEs are to programming, Faraday is to pentesting.",
      "meta": {
        "refs": [
          "https://github.com/infobyte/faraday"
        ]
      },
      "uuid": "4669ae38-ee9e-11e9-81b4-2a2ae2dbcce4",
      "value": "Faraday"
    },
	{
      "description": "GRR Rapid Response is an incident response framework focused on remote live forensics. GRR is a python client (agent) that is installed on target systems, and python server infrastructure that can manage and talk to clients.",
      "meta": {
        "refs": [
          "https://github.com/google/grr"
        ]
      },
      "uuid": "4669b0ae-ee9e-11e9-81b4-2a2ae2dbcce4",
      "value": "GRR Rapid Response"
    },
	{
      "description": "Apple Inc. RDP application for connecting to iOS devices remotely.",
      "meta": {
        "refs": [
          "https://support.apple.com/remote-desktop"
        ]
      },
      "uuid": "e80725fe-0316-11ea-8d71-362b9e155667",
      "value": "Apple Remote Desktop (ARD) - RDP Tool"
    },
	{
      "description": "ARDvark parses the Apple Remote Desktop (ARD) database file, and associated cache files to pull out application usage, user activity, and filesystem listing The ARD database contains information about all systems within an ARD deployment in an enterprise.",
      "meta": {
        "refs": [
          "https://github.com/fireeye/ARDvark"
        ]
      },
      "uuid": "e8072874-0316-11ea-8d71-362b9e155667",
      "value": "ARDvark (Forensics)"
    },
	{
      "description": "Open-source jailbreaking tool for many iOS devices.",
      "meta": {
        "refs": [
          "https://github.com/axi0mX/ipwndfu"
        ]
      },
      "uuid": "e80729d2-0316-11ea-8d71-362b9e155667",
      "value": "ipwndfu"
    },
	{
      "description": "OnionShare is an open source tool that lets you securely and anonymously share a file of any size.",
      "meta": {
        "refs": [
          "https://onionshare.org/"
        ]
      },
      "uuid": "e8072afe-0316-11ea-8d71-362b9e155667",
      "value": "OnionShare"
    },
	{
      "description": "Security Support Provider Interface (SSPI) is a Win32 API used by Microsoft Windows systems to perform a variety of security-related operations such as authentication. SSPI functions as a common interface to several Security Support Providers (SSPs) - A Security Support Provider is a dynamic-link library (DLL) that makes one or more security packages available to applications.",
      "meta": {
        "refs": [
          "https://en.wikipedia.org/wiki/Security_Support_Provider_Interface",
		  "https://docs.microsoft.com/en-us/windows/win32/rpc/security-support-providers-ssps-"
        ]
      },
      "uuid": "e8072c34-0316-11ea-8d71-362b9e155667",
      "value": "Security Support Provider (SSP)"
    },
	{
      "description": "SharpSploit Console is just a quick proof of concept binary to help penetration testers or red teams with less C# experience play with some of the awesomeness that is SharpSploit. By following the instructions below you should be able to embed both the SharpSploit.dll and System.Management.Automation.dll into the SharpSploitConsole binary, creating a standalone exe you can drop on an appropriate target sytem and run over a non-interactive shell (such as beacon).  This concept can be applied to many C# binaries. For example, we could embed the System.Management.Automation.dll into our favorite C# NoPowershell.exe, creating a binary that does not rely on the System.Management.Automation.dll on the target system.",
      "meta": {
        "refs": [
          "https://github.com/anthemtotheego/SharpSploitConsole"
        ]
      },
      "uuid": "33aea5e4-0318-11ea-8d71-362b9e155667",
      "value": "SharpSploitConsole"
    },
	{
      "description": "Open source time provider.",
      "meta": {
        "refs": [
          "https://github.com/scottlundgren/w32time"
        ]
      },
      "uuid": "33aea896-0318-11ea-8d71-362b9e155667",
      "value": "GameTime"
    },
	{
      "description": "Metasploit encodeing scheme.",
      "meta": {
        "refs": [
          "https://www.fireeye.com/blog/threat-research/2019/10/shikata-ga-nai-encoder-still-going-strong.html"
        ]
      },
      "uuid": "33aea9d6-0318-11ea-8d71-362b9e155667",
      "value": "Shikata Ga Nai (SGN)"
    },
	{
      "description": "The Microsoft Macro Assembler (MASM) is an x86 assembler that uses the Intel syntax for MS-DOS and Microsoft Windows. Beginning with MASM 8.0, there are two versions of the assembler - One for 16-bit & 32-bit assembly sources, and another (ML64) for 64-bit sources only. MASM is maintained by Microsoft, but since version 6.12 it has not been sold as a separate product. It is instead supplied with various Microsoft SDKs and C compilers. Recent versions of MASM are included with Microsoft Visual Studio.",
      "meta": {
        "refs": [
          "https://en.wikipedia.org/wiki/Microsoft_Macro_Assembler"
        ]
      },
      "uuid": "33aeab02-0318-11ea-8d71-362b9e155667",
      "value": "MASM (Microsoft Macro Assembler)"
    },
	{
      "description": "Stegano, a pure Python Steganography module.",
      "meta": {
        "refs": [
          "https://github.com/cedricbonhomme/Stegano"
        ]
      },
      "uuid": "33aeac38-0318-11ea-8d71-362b9e155667",
      "value": "Stegano"
    },
	{
      "description": "The native Microsoft command-line utility NetShell has the ability to load custom helper DLLs to extend its functionality. An attacker may leverage this built-in functionality to maintain persistence by crafting a malicious helper DLL. The helper will only execute when netsh.exe is started. Some VPN software runs netsh in the background by default, which may allow an attacker to target remote users who primarily use VPN in their day-to-day tasks. The PoC will need to be built as a dll (x64), then added as a helper to netsh. The PoC spawns a new thread, so netsh will still be usable while a payload is running. However, when netsh ends so will your shell.",
      "meta": {
        "refs": [
          "https://github.com/rtcrowley/Offensive-Netsh-Helper"
        ]
      },
      "uuid": "792a2976-0319-11ea-8d71-362b9e155667",
      "value": "Offensive-Netsh-Helper"
    },
	{
      "description": "Redline, FireEye premier free endpoint security tool, provides host investigative capabilities to users to find signs of malicious activity through memory and file analysis and the development of a threat assessment profile. Use Redline to collect, analyze and filter endpoint data and perform IOC analysis and hit review. In addition, users of FireEye Endpoint Security (HX) can open triage collections directly in Redline for in-depth analysis, allowing the user to establish the timeline and scope of an incident.",
      "meta": {
        "refs": [
          "https://fireeye.market/apps/211364"
        ]
      },
      "uuid": "792a2be2-0319-11ea-8d71-362b9e155667",
      "value": "FireEye Redline"
    },
	{
      "description": "Windows Management Instrumentation (WMI) is the infrastructure for management data and operations on Windows-based operating systems. You can write WMI scripts or applications to automate administrative tasks on remote computers but WMI also supplies management data to other parts of the operating system and products, for example System Center Operations Manager, formerly Microsoft Operations Manager (MOM), or Windows Remote Management (WinRM).",
      "meta": {
        "refs": [
          "https://docs.microsoft.com/en-us/windows/win32/wmisdk/wmi-start-page"
        ]
      },
      "uuid": "792a2d36-0319-11ea-8d71-362b9e155667",
      "value": "Windows Management Instrumentation (WMI)"
    },
	{
      "description": "The Managed Object Format (MOF) compiler parses a file containing MOF statements and adds the classes and class instances defined in the file to the WMI repository. MOF files are usually automatically compiled during the installation of the systems with which they are provided, but you can also compile MOF files by using this tool.",
      "meta": {
        "refs": [
          "https://docs.microsoft.com/en-us/windows/win32/wmisdk/mofcomp"
        ]
      },
      "uuid": "792a30ce-0319-11ea-8d71-362b9e155667",
      "value": "mofcomp"
    },
	{
      "description": "Decompile binary MOF file (BMF) from WMI buffer.",
      "meta": {
        "refs": [
          "https://github.com/pali/bmfdec"
        ]
      },
      "uuid": "792a3222-0319-11ea-8d71-362b9e155667",
      "value": "bmfdec"
    },
	{
      "description": "The Volatility Framework is a completely open collection of tools, implemented in Python under the GNU General Public License, for the extraction of digital artifacts from volatile memory (RAM) samples. The extraction techniques are performed completely independent of the system being investigated but offer visibilty into the runtime state of the system. The framework is intended to introduce people to the techniques and complexities associated with extracting digital artifacts from volatile memory samples and provide a platform for further work into this exciting area of research.",
      "meta": {
        "refs": [
          "https://github.com/volatilityfoundation/volatility"
        ]
      },
      "uuid": "4de3125e-031a-11ea-8d71-362b9e155667",
      "value": "Volatility"
    },
	{
      "description": "DNS Analysis Tool.",
      "meta": {
        "refs": [
          "https://n0where.net/dns-analysis-tool-bluto",
		  "https://github.com/darryllane/Bluto"
        ]
      },
      "uuid": "4de316d2-031a-11ea-8d71-362b9e155667",
      "value": "Bluto"
    },
	{
      "description": "AIEngine is a next generation interactive programmable Python, Ruby, Java, Lua packet inspection engine with capabilities of learning without any human intervention, NIDS(Network Intrusion Detection System) functionality, DNS domain classification, network collector, network forensics and many others.",
      "meta": {
        "refs": [
          "https://github.com/camp0/aiengine",
		  "https://bitbucket.org/camp0/aiengine"
        ]
      },
      "uuid": "4de3183a-031a-11ea-8d71-362b9e155667",
      "value": "AIEngine"
    },
	{
      "description": "Travesty – A directory and file enumeration tool (post directory traversal exploitation) This tool assists security analysts in identifying interesting directories and files once a directory traversal has been found.",
      "meta": {
        "refs": [
          "https://github.com/telspacesystems/travesty/",
		  "https://blog.telspace.co.za/2019/11/travesty-directory-and-file-enumeration.html"
        ]
      },
      "uuid": "4de31966-031a-11ea-8d71-362b9e155667",
      "value": "Travesty"
    },
	{
      "description": "A not so very intelligent fuzzer.",
      "meta": {
        "refs": [
          "https://github.com/oxagast/ansvif"
        ]
      },
      "uuid": "b1c570fe-031b-11ea-8d71-362b9e155667",
      "value": "Ansvif"
    },
	{
      "description": "The samhain open source host-based intrusion detection system (HIDS) provides file integrity checking and logfile monitoring analysis, as well as rootkit detection, port monitoring, detection of rogue SUID executables, and hidden processes. It has been designed to monitor multiple hosts with potentially different operating systems, providing centralized logging and maintenance, although it can also be used as standalone application on a single host.",
      "meta": {
        "refs": [
          "https://la-samhna.de/samhain/",
		  "https://github.com/pilbender/samhain"
        ]
      },
      "uuid": "b1c5748c-031b-11ea-8d71-362b9e155667",
      "value": "Samhain File Integrity Checker"
    },
	{
      "description": "SoftEther VPN is free open-source, cross-platform, multi-protocol VPN client and VPN server software, developed as part of Daiyuu Nobori's master's thesis research at the University of Tsukuba.",
      "meta": {
        "refs": [
          "https://www.softether.org/"
        ]
      },
      "uuid": "a4d61368-097d-11ea-9a9f-362b9e155667",
      "value": "SoftEther VPN"
    },
	{
      "description": "svchost.exe (Service Host, or SvcHost) is a system process that can host from one to many Windows services in the Windows NT family of operating systems. Svchost is essential in the implementation of so-called shared service processes, where a number of services can share a process in order to reduce resource consumption. Grouping multiple services into a single process conserves computing resources, and this consideration was of particular concern to NT designers because creating Windows processes takes more time and consumes more memory than in other operating systems, e.g. in the Unix family. However, if one of the services causes an unhandled exception, the entire process may crash. In addition, identifying component services can be more difficult for end users. Problems with various hosted services, particularly with Windows Update, get reported by users (and headlined by the press) as involving svchost. The svchost process was introduced in Windows 2000, although the underlying support for shared service processes has existed since Windows NT 3.1.",
      "meta": {
        "refs": [
          "https://en.wikipedia.org/wiki/Svchost.exe"
        ]
      },
      "uuid": "a4d6178c-097d-11ea-9a9f-362b9e155667",
      "value": "svchost"
    },
	{
      "description": "Build interactive map of cameras, printers, tweets and photos. The script creates a map of cameras, printers, tweets and photos based on your coordinates. Everything is clearly presented in form of interactive map with icons and popups.",
      "meta": {
        "refs": [
          "https://github.com/woj-ciech/kamerka"
        ],
		"synonyms": [
		"FIST (Flickr, Instagram, Shodan, Twitter)"
		]
      },
      "uuid": "a4d61aa2-097d-11ea-9a9f-362b9e155667",
      "value": "Kamerka"
    },
	{
      "description": "CERTrating is a tool for assessing the Maturity Level of CERTs and their services.",
      "meta": {
        "refs": [
          "https://certrating.it/"
        ]
      },
      "uuid": "09b14784-0c90-11ea-8d71-362b9e155667",
      "value": "CERTrating"
    },
	{
      "description": "checkra1n is a community project to provide a high-quality semi-tethered jailbreak to all, based on the checkm8 bootrom exploit.",
      "meta": {
        "refs": [
          "https://checkra.in/"
        ]
      },
      "uuid": "09b149f0-0c90-11ea-8d71-362b9e155667",
      "value": "checkra1n"
    },
	{
      "description": "Bing-ip2hosts is a Bing.com web scraper to discover hostnames by IP address.",
      "meta": {
        "refs": [
          "https://github.com/urbanadventurer/bing-ip2hosts"
        ]
      },
      "uuid": "d1274c76-114c-11ea-9a9f-362b9e155667",
      "value": "Bing-ip2hosts"
    },
	{
      "description": "Cyber threat hunting guide that can be used for academic purposes or to improve current cyber threat hunting operations.",
      "meta": {
        "refs": [
          "https://www.slideshare.net/HuyKha2/cthow-v20-cyber-threat-hunting-on-windows?from_action=save"
        ]
      },
      "uuid": "d1275054-114c-11ea-9a9f-362b9e155667",
      "value": "CTHoW v2.0 - Cyber Threat Hunting on Windows"
    },
	{
      "description": "This is a set of utilities wrapping the decompiler API into something sane. This code focus on vulnerability research and bug hunting, however most of the functionality is generic enough to be used for broader reverse engineering purposes.",
      "meta": {
        "refs": [
          "https://github.com/fireeye/FIDL"
        ]
      },
      "uuid": "1285314c-16c5-11ea-8d71-362b9e155667",
      "value": "FLARE IDA Decompiler Library (FIDL)"
    },
	{
      "description": "GnuPG is a complete and free implementation of the OpenPGP standard as defined by RFC4880 (also known as PGP). GnuPG allows you to encrypt and sign your data and communications; it features a versatile key management system, along with access modules for all kinds of public key directories. GnuPG, also known as GPG, is a command line tool with features for easy integration with other applications. A wealth of frontend applications and libraries are available. GnuPG also provides support for S MIME and Secure Shell (ssh). Since its introduction in 1997, GnuPG is Free Software (meaning that it respects your freedom). It can be freely used, modified and distributed under the terms of the GNU General Public License.",
      "meta": {
        "refs": [
          "https://gnupg.org/"
        ]
      },
      "uuid": "1285343a-16c5-11ea-8d71-362b9e155667",
      "value": "GNU Privacy Guard"
    },
	{
      "description": "Kali Linux is an Advanced Penetration Testing Linux distribution used for Penetration Testing, Ethical Hacking and network security assessments.",
      "meta": {
        "refs": [
          "https://www.kali.org/"
        ]
      },
      "uuid": "12853a7a-16c5-11ea-8d71-362b9e155667",
      "value": "Kali Linux"
    },
	{
      "description": "Yoda's Protector is a free, open source, Windows 32-bit software protector.",
      "meta": {
        "refs": [
          "https://sourceforge.net/projects/yodap/",
		  "https://sourceforge.net/p/yodap/wiki/"
        ]
      },
      "uuid": "5459fd0a-17b5-11ea-8d71-362b9e155667",
      "value": "Yodas Protector"
    },
	{
      "description": "Mussels is a cross-platform and general-purpose dependency build automation tool. Mussels helps automate the building of applications and their versioned dependency chains using the original build systems intended by the software authors.",
      "meta": {
        "refs": [
          "https://github.com/Cisco-Talos/Mussels"
        ]
      },
      "uuid": "4f0dca72-184e-11ea-8d71-362b9e155667",
      "value": "Mussels"
    },
	{
      "description": "ConfuserEx is an free, open-source protector for .NET applications. It is the successor of Confuser project.",
      "meta": {
        "refs": [
          "https://yck1509.github.io/ConfuserEx/"
        ]
      },
      "uuid": "4f0dcd9c-184e-11ea-8d71-362b9e155667",
      "value": "ConfuserEx"
    },
	{
      "description": "A tool for taking Raw SS Tables (not snappy compressed) and obfuscating text fields. Works for Cassandra 2.1 SS tables. I will add support for other versions if requested.",
      "meta": {
        "refs": [
          "https://github.com/chbatey/cassandra-sstable-obfuscator"
        ],
		"synonyms": [
		"SSTable Obfuscator"
		]
      },
      "uuid": "4f0dcf18-184e-11ea-8d71-362b9e155667",
      "value": "Cassandra (CyaX)"
    },
	{
      "description": "Python 3 REST API & JS GUI for managing hashcat crack jobs in a queuing system.",
      "meta": {
        "refs": [
          "https://github.com/f0cker/crackq"
        ]
      },
      "uuid": "4f0defc0-184e-11ea-8d71-362b9e155667",
      "value": "CrackQ"
    },
	{
      "description": "hashcat is the world's fastest and most advanced password recovery utility, supporting five unique modes of attack for over 200 highly-optimized hashing algorithms. hashcat currently supports CPUs, GPUs, and other hardware accelerators on Linux, Windows, and macOS, and has facilities to help enable distributed password cracking.",
      "meta": {
        "refs": [
          "https://github.com/hashcat/hashcat"
        ]
      },
      "uuid": "4f0df394-184e-11ea-8d71-362b9e155667",
      "value": "HashCat"
    },
	{
      "description": "RawDisk is a legitimate commercial driver from the EldoS Corporation that is used for interacting with files, disks, and partitions. The driver allows for direct modification of data on a local computer's hard drive. In some cases, the tool can enact these raw disk modifications from user-mode processes, circumventing Windows operating system security features.",
      "meta": {
        "refs": [
          "https://attack.mitre.org/software/S0364/"
        ]
      },
      "uuid": "8bc6a12c-1f8e-11ea-978f-2e728ce88125",
      "value": "EldoS RawDisk"
    },
	{
      "description": "This CLI framework is based on sploitkit and is an attempt to gather hacking techniques and exploits especially focused on drone hacking. For the ease of use, the interface has a layout that looks like Metasploit.",
      "meta": {
        "refs": [
          "https://github.com/dhondta/dronesploit"
        ]
      },
      "uuid": "8bc6a398-1f8e-11ea-978f-2e728ce88125",
      "value": "DroneSploit"
    },
	{
      "description": "With CodeVeil you can encrypt your .NET applications and DLLs. CodeVeil adds native code to the assembly to decrypt the assembly just before the .NET runtime needs access to the data. The decoder includes anti-debugging, anti-tracing, modification tracking, and various other advanced techniques to prevent unauthorized access and modification of your assemblies. And, veiled assemblies can be used just like any other assembly. No third party dll is required with your distribution.",
      "meta": {
        "refs": [
          "https://download.cnet.com/CodeVeil/3000-10250_4-10729770.html"
        ]
      },
      "uuid": "8bc6a69a-1f8e-11ea-978f-2e728ce88125",
      "value": "CodeVeil"
    },
	{
      "description": "This tool is a proof of concept code, to give researchers and security consultants the possibility to show how easy it would be to gain unauthorized access from remote to a system.",
      "meta": {
        "refs": [
          "https://github.com/vanhauser-thc/thc-hydra"
        ]
      },
      "uuid": "8bc6a80c-1f8e-11ea-978f-2e728ce88125",
      "value": "thc-hydra"
    },
	{
      "description": "A PowerShell TCP/IP swiss army knife that works with Netcat & Ncat.",
      "meta": {
        "refs": [
          "https://github.com/secabstraction/PowerCat"
        ]
      },
      "uuid": "8bc6a956-1f8e-11ea-978f-2e728ce88125",
      "value": "powercat"
    },
	{
      "description": ".NET Reactor is a powerful code protection and software licensing system for software written for the .NET Framework, and supports all languages that generate .NET assemblies.",
      "meta": {
        "refs": [
          "https://www.eziriz.com/dotnet_reactor.htm"
        ]
      },
      "uuid": "aac557ac-1f8f-11ea-978f-2e728ce88125",
      "value": ".NET Reactor"
    },
	{
      "description": "Penetration testing analysis tool.",
      "meta": {
        "refs": [
          "https://github.com/chrchang/plink-ng"
        ]
      },
      "uuid": "aac55a18-1f8f-11ea-978f-2e728ce88125",
      "value": "Plink-ng"
    },
	{
      "description": "Clam AntiVirus (ClamAV) is a free software, cross-platform and open-source antivirus software toolkit able to detect many types of malicious software, including viruses. One of its main uses is on mail servers as a server-side email virus scanner. The application was developed for Unix and has third party versions available for AIX, BSD, HP-UX, Linux, macOS, OpenVMS, OSF (Tru64) and Solaris. As of version 0.97.5, ClamAV builds and runs on Microsoft Windows. Both ClamAV and its updates are made available free of charge.",
      "meta": {
        "refs": [
          "https://en.wikipedia.org/wiki/Clam_AntiVirus",
		  "https://packetstormsecurity.com/files/154185/clamav-0.101.4.tar.gz"
        ]
      },
      "uuid": "736b8f4a-cdbb-11e9-a32f-2a2ae2dbcce4",
      "value": "Clam AntiVirus"
    }
	  ],
	"version": 19
}
