{
  "category": "BLS-A-THRU-P",
  "description": "Cluster designed for tagging OSINT artifacts appropriate U.S. Bureau of Labor Statistics class codes. This cluster covers class codes Q thru Z.",
  "name": "OSRS Bureau of Labor Statistics - Q thru Z",
  "source": "US Bureau of Labor Statistics - Industries at a Glance",
  "type": "OSRS-CMCF-BLOCK-OSRS",
  "uuid": "feda733c-2817-11ea-978f-2e728ce88125",
  "values": [
	  {
      "description": "Industries in the Rail Transportation subsector provide rail transportation of passengers and or cargo using railroad rolling stock. The railroads in this subsector primarily either operate on networks, with physical facilities, labor force, and equipment spread over an extensive geographic area, or operate over a short distance on a local rail line.",
      "meta": {
	  "kill_chain": [
          "general-artifact:BLS Index Q thru Z"
        ],
        "refs": [
          "https://github.com/open-source-rs/Comprehensive-Modular-Cybersecurity-Framework-CMCF",
          "https://www.bls.gov/iag/tgs/iag482.htm"
        ]
      },
      "uuid": "0b361c9a-28b2-11ea-978f-2e728ce88125",
      "value": "OSRS BLS: NAICS 482 Rail Transportation"
    },
	{
      "description": "Industries in the Real Estate subsector group establishments that are primarily engaged in renting or leasing real estate to others, managing real estate for others, selling, buying, or renting real estate for others, and providing other real estate related services, such as appraisal services. This subsector includes equity Real Estate Investment Trusts (REITs) that are primarily engaged in leasing buildings, dwellings, or other real estate property to others.",
      "meta": {
	  "kill_chain": [
          "general-artifact:BLS Index Q thru Z"
        ],
        "refs": [
          "https://github.com/open-source-rs/Comprehensive-Modular-Cybersecurity-Framework-CMCF",
          "https://www.bls.gov/iag/tgs/iag531.htm"
        ]
      },
      "uuid": "39be74a6-2b1c-11ea-85fa-2e728ce88125",
      "value": "OSRS BLS: NAICS 531 Real Estate"
    },
	{
      "description": "The Real Estate and Rental and Leasing sector comprises establishments primarily engaged in renting, leasing, or otherwise allowing the use of tangible or intangible assets, and establishments providing related services. The major portion of this sector comprises establishments that rent, lease, or otherwise allow the use of their own assets by others. The assets may be tangible, as is the case of real estate and equipment, or intangible, as is the case with patents and trademarks. This sector also includes establishments primarily engaged in managing real estate for others, selling, renting and (or) buying real estate for others, and appraising real estate. These activities are closely related to this sector's main activity, and it was felt that from a production basis they would best be included here. In addition, a substantial proportion of property management is self-performed by lessors. The main components of this sector are the real estate lessors industries (including equity real estate investment trusts (REITs)), equipment lessors industries (including motor vehicles, computers, and consumer goods), and lessors of nonfinancial intangible assets (except copyrighted works).",
      "meta": {
	  "kill_chain": [
          "general-artifact:BLS Index Q thru Z"
        ],
        "refs": [
          "https://github.com/open-source-rs/Comprehensive-Modular-Cybersecurity-Framework-CMCF",
          "https://www.bls.gov/iag/tgs/iag53.htm"
        ]
      },
      "uuid": "39be7730-2b1c-11ea-85fa-2e728ce88125",
      "value": "OSRS BLS: NAICS 53 Real Estate and Rental and Leasing"
    },
	{
      "description": "Industries in the Religious, Grantmaking, Civic, Professional, and Similar Organizations subsector group establishments that organize and promote religious activities, support various causes through grantmaking, advocate various social and political causes, and promote and defend the interests of their members.",
      "meta": {
	  "kill_chain": [
          "general-artifact:BLS Index Q thru Z"
        ],
        "refs": [
          "https://github.com/open-source-rs/Comprehensive-Modular-Cybersecurity-Framework-CMCF",
          "https://www.bls.gov/iag/tgs/iag813.htm"
        ]
      },
      "uuid": "39be788e-2b1c-11ea-85fa-2e728ce88125",
      "value": "OSRS BLS: NAICS 813 Religious, Grantmaking, Civic, Professional, and Similar Organizations"
    },
	{
      "description": "Industries in the Rental and Leasing Services subsector include establishments that provide a wide array of tangible goods, such as automobiles, computers, consumer goods, and industrial machinery and equipment, to customers in return for a periodic rental or lease payment. The subsector includes two main types of establishments (1) those that are engaged in renting consumer goods and equipment and (2) those that are engaged in leasing machinery and equipment often used for business operations.",
      "meta": {
	  "kill_chain": [
          "general-artifact:BLS Index Q thru Z"
        ],
        "refs": [
          "https://github.com/open-source-rs/Comprehensive-Modular-Cybersecurity-Framework-CMCF",
          "https://www.bls.gov/iag/tgs/iag532.htm"
        ]
      },
      "uuid": "39be7eba-2b1c-11ea-85fa-2e728ce88125",
      "value": "OSRS BLS: NAICS 532 Rental and Leasing Services"
    },
	{
      "description": "Industries in the Repair and Maintenance subsector restore machinery, equipment, and other products to working order. These establishments also typically provide general or routine maintenance (i.e., servicing) on such products to ensure they work efficiently and to prevent breakdown and unnecessary repairs.",
      "meta": {
	  "kill_chain": [
          "general-artifact:BLS Index Q thru Z"
        ],
        "refs": [
          "https://github.com/open-source-rs/Comprehensive-Modular-Cybersecurity-Framework-CMCF",
          "https://www.bls.gov/iag/tgs/iag811.htm"
        ]
      },
      "uuid": "39be8022-2b1c-11ea-85fa-2e728ce88125",
      "value": "OSRS BLS: NAICS 811 Repair and Maintenance"
    },
	{
      "description": "The Retail Trade sector comprises establishments engaged in retailing merchandise, generally without transformation, and rendering services incidental to the sale of merchandise. The retailing process is the final step in the distribution of merchandise, retailers are, therefore, organized to sell merchandise in small quantities to the general public. This sector comprises two main types of retailers: store and nonstore retailers. 1. Store retailers operate fixed point-of-sale locations, located and designed to attract a high volume of walk-in customers. In general, retail stores have extensive displays of merchandise and use mass-media advertising to attract customers. They typically sell merchandise to the general public for personal or household consumption, but some also serve business and institutional clients. In addition to retailing merchandise, some types of store retailers are also engaged in the provision of after-sales services, such as repair and installation. 2. Nonstore retailers, like store retailers, are organized to serve the general public, but their retailing methods differ. The establishments of this subsector reach customers and market merchandise with methods, such as the broadcasting of infomercials, the broadcasting and publishing of direct-response advertising, the publishing of paper and electronic catalogs, door-to-door solicitation, in-home demonstration, selling from portable stalls (street vendors, except food), and distribution through vending machines.",
      "meta": {
	  "kill_chain": [
          "general-artifact:BLS Index Q thru Z"
        ],
        "refs": [
          "https://github.com/open-source-rs/Comprehensive-Modular-Cybersecurity-Framework-CMCF",
          "https://www.bls.gov/iag/tgs/iag44-45.htm"
        ]
      },
      "uuid": "39be816c-2b1c-11ea-85fa-2e728ce88125",
      "value": "OSRS BLS: NAICS 44-45 Retail Trade"
    },
	{
      "description": "Industries in the Scenic and Sightseeing Transportation subsector utilize transportation equipment to provide recreation and entertainment. These activities have a production process distinct from passenger transportation carried out for the purpose of other types of for-hire transportation. This process does not emphasize efficient transportation, in fact, such activities often use obsolete vehicles, such as steam trains, to provide some extra ambience. The activity is local in nature, usually involving a same-day return to the point of departure.",
      "meta": {
	  "kill_chain": [
          "general-artifact:BLS Index Q thru Z"
        ],
        "refs": [
          "https://github.com/open-source-rs/Comprehensive-Modular-Cybersecurity-Framework-CMCF",
          "https://www.bls.gov/iag/tgs/iag487.htm"
        ]
      },
      "uuid": "39be82ac-2b1c-11ea-85fa-2e728ce88125",
      "value": "OSRS BLS: NAICS 487 Scenic and Sightseeing Transportation"
    },
	{
      "description": "Industries in the Securities, Commodity Contracts, and Other Financial Investments and Related Activities subsector group establishments that are primarily engaged in one of the following (1) underwriting securities issues and (or) making markets for securities and commodities, (2) acting as agents (i.e., brokers) between buyers and sellers of securities and commodities, (3) providing securities and commodity exchange services, and (4) providing other services, such as managing portfolios of assets, providing investment advice, and trust, fiduciary, and custody services.",
      "meta": {
	  "kill_chain": [
          "general-artifact:BLS Index Q thru Z"
        ],
        "refs": [
          "https://github.com/open-source-rs/Comprehensive-Modular-Cybersecurity-Framework-CMCF",
          "https://www.bls.gov/iag/tgs/iag523.htm"
        ]
      },
      "uuid": "39be83e2-2b1c-11ea-85fa-2e728ce88125",
      "value": "OSRS BLS: NAICS 523 Securities, Commodity Contracts, and Other Financial Investments and Related Activities"
    },
	{
      "description": "Industries in the Social Assistance subsector provide a wide variety of social assistance services directly to their clients. These services do not include residential or accommodation services, except on a short stay basis.",
      "meta": {
	  "kill_chain": [
          "general-artifact:BLS Index Q thru Z"
        ],
        "refs": [
          "https://github.com/open-source-rs/Comprehensive-Modular-Cybersecurity-Framework-CMCF",
          "https://www.bls.gov/iag/tgs/iag624.htm"
        ]
      },
      "uuid": "39be8522-2b1c-11ea-85fa-2e728ce88125",
      "value": "OSRS BLS: NAICS 624 Rail Transportation"
    },
	{
      "description": "Industries in the Sporting Goods, Hobby, Book, and Music Stores subsector are engaged in retailing and providing expertise on use of sporting equipment or other specific leisure activities, such as needlework and musical instruments. Book stores are also included in this subsector.",
      "meta": {
	  "kill_chain": [
          "general-artifact:BLS Index Q thru Z"
        ],
        "refs": [
          "https://github.com/open-source-rs/Comprehensive-Modular-Cybersecurity-Framework-CMCF",
          "https://www.bls.gov/iag/tgs/iag451.htm"
        ]
      },
      "uuid": "8373a6e0-2b24-11ea-978f-2e728ce88125",
      "value": "OSRS BLS: NAICS 451 Sporting Goods, Hobby, Book, and Music Stores"
    },
	{
      "description": "Industries in the Support Activities for Agriculture and Forestry subsector provide support services that are an essential part of agricultural and forestry production. These support activities may be performed by the agriculture or forestry producing establishment or conducted independently as an alternative source of inputs required for the production process for a given crop, animal, or forestry industry. Establishments that primarily perform these activities independent of the agriculture or forestry producing establishment are in this subsector.",
      "meta": {
	  "kill_chain": [
          "general-artifact:BLS Index Q thru Z"
        ],
        "refs": [
          "https://github.com/open-source-rs/Comprehensive-Modular-Cybersecurity-Framework-CMCF",
          "https://www.bls.gov/iag/tgs/iag115.htm"
        ]
      },
      "uuid": "8373a942-2b24-11ea-978f-2e728ce88125",
      "value": "OSRS BLS: NAICS 115 Support Activities for Agriculture and Forestry"
    },
	{
      "description": "Industries in the Support Activities for Mining subsector group establishments primarily providing support services, on a contract or fee basis, required for the mining and quarrying of minerals and for the extraction of oil and gas. Establishments performing exploration (except geophysical surveying and mapping) for minerals, on a contract or fee basis, are included in this subsector. Exploration includes traditional prospecting methods, such as taking core samples and making geological observations at prospective sites. The activities performed on a contract or fee basis by establishments in the Support Activities for Mining subsector are also often performed in-house by mining operators.",
      "meta": {
	  "kill_chain": [
          "general-artifact:BLS Index Q thru Z"
        ],
        "refs": [
          "https://github.com/open-source-rs/Comprehensive-Modular-Cybersecurity-Framework-CMCF",
          "https://www.bls.gov/iag/tgs/iag213.htm"
        ]
      },
      "uuid": "8373af8c-2b24-11ea-978f-2e728ce88125",
      "value": "OSRS BLS: NAICS 213 Support Activities for Mining"
    },
	{
      "description": "Industries in the Support Activities for Transportation subsector provide services which support transportation. These services may be provided to transportation carrier establishments or to the general public. This subsector includes a wide array of establishments, including air traffic control services, marine cargo handling, and motor vehicle towing.",
      "meta": {
	  "kill_chain": [
          "general-artifact:BLS Index Q thru Z"
        ],
        "refs": [
          "https://github.com/open-source-rs/Comprehensive-Modular-Cybersecurity-Framework-CMCF",
          "https://www.bls.gov/iag/tgs/iag488.htm"
        ]
      },
      "uuid": "8373b0e0-2b24-11ea-978f-2e728ce88125",
      "value": "OSRS BLS: NAICS 488 Support Activities for Transportation"
    },
	{
      "description": "Industries in the Telecommunications subsector group establishments that provide telecommunications and the services related to that activity (e.g., telephony, including Voice over Internet Protocol (VoIP), cable and satellite television distribution services, Internet access, telecommunications reselling services). The Telecommunications subsector is primarily engaged in operating, and (or) providing access to facilities for the transmission of voice, data, text, sound, and video. Transmission facilities may be based on a single technology or a combination of technologies.",
      "meta": {
	  "kill_chain": [
          "general-artifact:BLS Index Q thru Z"
        ],
        "refs": [
          "https://github.com/open-source-rs/Comprehensive-Modular-Cybersecurity-Framework-CMCF",
          "https://www.bls.gov/iag/tgs/iag517.htm"
        ]
      },
      "uuid": "8373b220-2b24-11ea-978f-2e728ce88125",
      "value": "OSRS BLS: NAICS 517 Telecommunications"
    },
	{
      "description": "Industries in the Textile Mills subsector group establishments that transform a basic fiber (natural or synthetic) into a product, such as yarn or fabric that is further manufactured into usable items, such as apparel, sheets, towels, and textile bags for individual or industrial consumption. The further manufacturing may be performed in the same establishment and classified in this subsector, or it may be performed at a separate establishment and be classified elsewhere in manufacturing.",
      "meta": {
	  "kill_chain": [
          "general-artifact:BLS Index Q thru Z"
        ],
        "refs": [
          "https://github.com/open-source-rs/Comprehensive-Modular-Cybersecurity-Framework-CMCF",
          "https://www.bls.gov/iag/tgs/iag313.htm"
        ]
      },
      "uuid": "8373b360-2b24-11ea-978f-2e728ce88125",
      "value": "OSRS BLS: NAICS 313 Textile Mills"
    },
	{
      "description": "Industries in the Textile Product Mills subsector group establishments that make textile products (except apparel). With a few exceptions, processes used in these industries are generally cut and sew (i.e., purchasing fabric and cutting and sewing to make nonapparel textile products, such as sheets and towels).",
      "meta": {
	  "kill_chain": [
          "general-artifact:BLS Index Q thru Z"
        ],
        "refs": [
          "https://github.com/open-source-rs/Comprehensive-Modular-Cybersecurity-Framework-CMCF",
          "https://www.bls.gov/iag/tgs/iag314.htm"
        ]
      },
      "uuid": "8373b496-2b24-11ea-978f-2e728ce88125",
      "value": "OSRS BLS: NAICS 314 Textile Product Mills"
    },
	{
      "description": "Industries in the Transit and Ground Passenger Transportation subsector include a variety of passenger transportation activities, such as urban transit systems, chartered bus, school bus, and interurban bus transportation, and taxis. These activities are distinguished based primarily on such production process factors as vehicle types, routes, and schedules.",
      "meta": {
	  "kill_chain": [
          "general-artifact:BLS Index Q thru Z"
        ],
        "refs": [
          "https://github.com/open-source-rs/Comprehensive-Modular-Cybersecurity-Framework-CMCF",
          "https://www.bls.gov/iag/tgs/iag485.htm"
        ]
      },
      "uuid": "8373b9e6-2b24-11ea-978f-2e728ce88125",
      "value": "OSRS BLS: NAICS 485 Transit and Ground Passenger Transportation"
    },
	{
      "description": "Industries in the Transportation Equipment Manufacturing subsector produce equipment for transporting people and goods. Transportation equipment is a type of machinery. An entire subsector is devoted to this activity because of the significance of its economic size in all three North American countries. Establishments in this subsector utilize production processes similar to those of other machinery manufacturing establishments - bending, forming, welding, machining, and assembling metal or plastic parts into components and finished products. However, the assembly of components and subassemblies and their further assembly into finished vehicles tends to be a more common production process in this subsector than in the Machinery Manufacturing subsector.",
      "meta": {
	  "kill_chain": [
          "general-artifact:BLS Index Q thru Z"
        ],
        "refs": [
          "https://github.com/open-source-rs/Comprehensive-Modular-Cybersecurity-Framework-CMCF",
          "https://www.bls.gov/iag/tgs/iag336.htm"
        ]
      },
      "uuid": "8373bb6c-2b24-11ea-978f-2e728ce88125",
      "value": "OSRS BLS: NAICS 336 Transportation Equipment Manufacturing"
    },
	{
      "description": "The Transportation and Warehousing sector includes industries providing transportation of passengers and cargo, warehousing and storage for goods, scenic and sightseeing transportation, and support activities related to modes of transportation. Establishments in these industries use transportation equipment or transportation related facilities as a productive asset. The type of equipment depends on the mode of transportation. The modes of transportation are air, rail, water, road, and pipeline.",
      "meta": {
	  "kill_chain": [
          "general-artifact:BLS Index Q thru Z"
        ],
        "refs": [
          "https://github.com/open-source-rs/Comprehensive-Modular-Cybersecurity-Framework-CMCF",
          "https://www.bls.gov/iag/tgs/iag48-49.htm"
        ]
      },
      "uuid": "8373bcb6-2b24-11ea-978f-2e728ce88125",
      "value": "OSRS BLS: NAICS 48-49 Transportation and Warehousing"
    },
	{
      "description": "Industries in the Truck Transportation subsector provide over-the-road transportation of cargo using motor vehicles, such as trucks and tractor trailers. The subsector is subdivided into general freight trucking and specialized freight trucking. This distinction reflects differences in equipment used, type of load carried, scheduling, terminal, and other networking services. General freight transportation establishments handle a wide variety of general commodities, generally palletized, and transported in a container or van trailer. Specialized freight transportation is the transportation of cargo that, because of size, weight, shape, or other inherent characteristics require specialized equipment for transportation.",
      "meta": {
	  "kill_chain": [
          "general-artifact:BLS Index Q thru Z"
        ],
        "refs": [
          "https://github.com/open-source-rs/Comprehensive-Modular-Cybersecurity-Framework-CMCF",
          "https://www.bls.gov/iag/tgs/iag484.htm"
        ]
      },
      "uuid": "60afba92-2b27-11ea-978f-2e728ce88125",
      "value": "OSRS BLS: NAICS 484 Truck Transportation"
    },
	{
      "description": "The Utilities sector comprises establishments engaged in the provision of the following utility services electric power, natural gas, steam supply, water supply, and sewage removal. Within this sector, the specific activities associated with the utility services provided vary by utility electric power includes generation, transmission, and distribution, natural gas includes distribution, steam supply includes provision and (or) distribution, water supply includes treatment and distribution, and sewage removal includes collection, treatment, and disposal of waste through sewer systems and sewage treatment facilities.",
      "meta": {
	  "kill_chain": [
          "general-artifact:BLS Index Q thru Z"
        ],
        "refs": [
          "https://github.com/open-source-rs/Comprehensive-Modular-Cybersecurity-Framework-CMCF",
          "https://www.bls.gov/iag/tgs/iag22.htm"
        ]
      },
      "uuid": "60afbda8-2b27-11ea-978f-2e728ce88125",
      "value": "OSRS BLS: NAICS 22 Utilities"
    },
	{
      "description": "Industries in the Warehousing and Storage subsector are primarily engaged in operating warehousing and storage facilities for general merchandise, refrigerated goods, and other warehouse products. These establishments provide facilities to store goods. They do not sell the goods they handle. These establishments take responsibility for storing the goods and keeping them secure. They may also provide a range of services, often referred to as logistics services, related to the distribution of goods. Logistics services can include labeling, breaking bulk, inventory control and management, light assembly, order entry and fulfillment, packaging, pick and pack, price marking and ticketing, and transportation arrangement. However, establishments in this industry group always provide warehousing or storage services in addition to any logistic services. Furthermore, the warehousing or storage of goods must be more than incidental to the performance of services, such as price marking.",
      "meta": {
	  "kill_chain": [
          "general-artifact:BLS Index Q thru Z"
        ],
        "refs": [
          "https://github.com/open-source-rs/Comprehensive-Modular-Cybersecurity-Framework-CMCF",
          "https://www.bls.gov/iag/tgs/iag493.htm"
        ]
      },
      "uuid": "60afbf24-2b27-11ea-978f-2e728ce88125",
      "value": "OSRS BLS: NAICS 493 Warehousing and Storage"
    },
	{
      "description": "Industries in the Waste Management and Remediation Services subsector group establishments engaged in the collection, treatment, and disposal of waste materials. This includes establishments engaged in local hauling of waste materials, operating materials recovery facilities (i.e., those that sort recyclable materials from the trash stream), providing remediation services (i.e., those that provide for the cleanup of contaminated buildings, mine sites, soil, or ground water), and providing septic pumping and other miscellaneous waste management services. There are three industry groups within the subsector that separate these activities into waste collection, waste treatment and disposal, and remediation and other waste management.",
      "meta": {
	  "kill_chain": [
          "general-artifact:BLS Index Q thru Z"
        ],
        "refs": [
          "https://github.com/open-source-rs/Comprehensive-Modular-Cybersecurity-Framework-CMCF",
          "https://www.bls.gov/iag/tgs/iag562.htm"
        ]
      },
      "uuid": "60afc082-2b27-11ea-978f-2e728ce88125",
      "value": "OSRS BLS: NAICS 562 Waste Management and Remediation Services"
    },
	{
      "description": "Industries in the Water Transportation subsector provide water transportation of passengers and cargo using watercraft, such as ships, barges, and boats. The subsector is composed of two industry groups (1) one for deep sea, coastal, and Great Lakes, and (2) one for inland water transportation. This split typically reflects the difference in equipment used.",
      "meta": {
	  "kill_chain": [
          "general-artifact:BLS Index Q thru Z"
        ],
        "refs": [
          "https://github.com/open-source-rs/Comprehensive-Modular-Cybersecurity-Framework-CMCF",
          "https://www.bls.gov/iag/tgs/iag483.htm"
        ]
      },
      "uuid": "60afc370-2b27-11ea-978f-2e728ce88125",
      "value": "OSRS BLS: NAICS 483 Water Transportation"
    },
	{
      "description": "Industries in the Wholesale Electronic Markets and Agents and Brokers subsector arrange for the sale of goods owned by others, generally on a fee or commission basis. They act on behalf of the buyers and sellers of goods. This subsector contains agents and brokers as well as business to business electronic markets that facilitate wholesale trade.",
      "meta": {
	  "kill_chain": [
          "general-artifact:BLS Index Q thru Z"
        ],
        "refs": [
          "https://github.com/open-source-rs/Comprehensive-Modular-Cybersecurity-Framework-CMCF",
          "https://www.bls.gov/iag/tgs/iag425.htm"
        ]
      },
      "uuid": "60afcb7c-2b27-11ea-978f-2e728ce88125",
      "value": "OSRS BLS: NAICS 425 Wholesale Electronic Markets and Agents and Brokers"
    },
	{
      "description": "The Wholesale Trade sector comprises establishments engaged in wholesaling merchandise, generally without transformation, and rendering services incidental to the sale of merchandise. The merchandise described in this sector includes the outputs of agriculture, mining, manufacturing, and certain information industries, such as publishing. The wholesaling process is an intermediate step in the distribution of merchandise. Wholesalers are organized to sell or arrange the purchase or sale of (a) goods for resale (i.e., goods sold to other wholesalers or retailers), (b) capital or durable nonconsumer goods, and (c) raw and intermediate materials and supplies used in production. Wholesalers sell merchandise to other businesses and normally operate from a warehouse or office. These warehouses and offices are characterized by having little or no display of merchandise. In addition, neither the design nor the location of the premises is intended to solicit walk-in traffic. Wholesalers do not normally use advertising directed to the general public. Customers are generally reached initially via telephone, in-person marketing, or by specialized advertising that may include Internet and other electronic means. Follow-up orders are either vendor-initiated or client-initiated, generally based on previous sales, and typically exhibit strong ties between sellers and buyers. In fact, transactions are often conducted between wholesalers and clients that have long-standing business relationships.",
      "meta": {
	  "kill_chain": [
          "general-artifact:BLS Index Q thru Z"
        ],
        "refs": [
          "https://github.com/open-source-rs/Comprehensive-Modular-Cybersecurity-Framework-CMCF",
          "https://www.bls.gov/iag/tgs/iag42.htm"
        ]
      },
      "uuid": "60afcd84-2b27-11ea-978f-2e728ce88125",
      "value": "OSRS BLS: NAICS 42 Wholesale Trade"
    },
	{
      "description": "Industries in the Wood Product Manufacturing subsector manufacture wood products, such as lumber, plywood, veneers, wood containers, wood flooring, wood trusses, manufactured homes (i.e., mobile homes), and prefabricated wood buildings. The production processes of the Wood Product Manufacturing subsector include sawing, planing, shaping, laminating, and assembling of wood products starting from logs that are cut into bolts, or lumber that then may be further cut, or shaped by lathes or other shaping tools. The lumber or other transformed wood shapes may also be subsequently planed or smoothed, and assembled into finished products, such as wood containers. The Wood Product Manufacturing subsector includes establishments that make wood products from logs and bolts that are sawed and shaped, and establishments that purchase sawed lumber and make wood products. With the exception of sawmills and wood preservation establishments, the establishments are grouped into industries mainly based on the specific products manufactured.",
      "meta": {
	  "kill_chain": [
          "general-artifact:BLS Index Q thru Z"
        ],
        "refs": [
          "https://github.com/open-source-rs/Comprehensive-Modular-Cybersecurity-Framework-CMCF",
          "https://www.bls.gov/iag/tgs/iag321.htm"
        ]
      },
      "uuid": "60afcf00-2b27-11ea-978f-2e728ce88125",
      "value": "OSRS BLS: NAICS 321 Wood Product Manufacturing"
    },
	{
      "description": "The Specialty Trade Contractors subsector comprises establishments whose primary activity is performing specific activities (e.g., pouring concrete, site preparation, plumbing, painting, and electrical work) involved in building construction or other activities that are similar for all types of construction, but that are not responsible for the entire project. The work performed may include new work, additions, alterations, maintenance, and repairs. The production work performed by establishments in this subsector is usually subcontracted from establishments of the general contractor type or operative builders, but especially in remodeling and repair construction, work also may be done directly for the owner of the property. Specialty trade contractors usually perform most of their work at the construction site, although they may have shops where they perform prefabrication and other work. Establishments primarily engaged in preparing sites for new construction are also included in this subsector.",
      "meta": {
	  "kill_chain": [
          "general-artifact:BLS Index Q thru Z"
        ],
        "refs": [
          "https://github.com/open-source-rs/Comprehensive-Modular-Cybersecurity-Framework-CMCF",
          "https://www.bls.gov/iag/tgs/iag238.htm"
        ]
      },
      "uuid": "39be889c-2b1c-11ea-85fa-2e728ce88125",
      "value": "OSRS BLS: NAICS 238 Specialty Trade Contractors"
    }
	  ],
	"version": 2
}
