{
  "category": "OSRS-MITRE-Collection",
  "description": "Collection consists of techniques adversaries may use to gather information and the sources information is collected from that are relevant to following through on the adversary's objectives. Frequently, the next goal after collecting data is to steal (exfiltrate) the data. Common target sources include various drive types, browsers, audio, video, and email. Common collection methods include capturing screenshots and keyboard input.",
  "name": "OSRS-MITRE-Collection",
  "source": "MITRE ATT&CK",
  "type": "OSRS-MITRE-Collection",
  "uuid": "9a5efcb0-fa3c-11e9-aad5-362b9e155667",
  "values": [
	  {
      "description": "Test place holder",
      "meta": {
        "refs": [
          "https://attack.mitre.org/tactics/TA0009/"
        ]
      },
      "uuid": "b9680fdc-fa43-11e9-aad5-362b9e155667",
      "value": "Test OSRS-MITRE-Collection Value"
    },
	{
      "description": "An adversary can leverage a computer's peripheral devices (e.g., microphones and webcams) or applications (e.g., voice and video call services) to capture audio recordings for the purpose of listening into sensitive conversations to gather information.",
      "meta": {
        "refs": [
          "https://attack.mitre.org/techniques/T1123"
        ]
      },
      "uuid": "d435ab32-fb09-11e9-8f0b-362b9e155667",
      "value": "Audio Capture T1123"
    },
	{
      "description": "Once established within a system or network, an adversary may use automated techniques for collecting internal data. Methods for performing this technique could include use of Scripting to search for and copy information fitting set criteria such as file type, location, or name at specific time intervals. This functionality could also be built into remote access tools.",
      "meta": {
        "refs": [
          "https://attack.mitre.org/techniques/T1119"
        ]
      },
      "uuid": "d435ad80-fb09-11e9-8f0b-362b9e155667",
      "value": "Automated Collection T1119"
    },
	{
      "description": "Adversaries may collect data stored in the Windows clipboard from users copying information within or between applications.",
      "meta": {
        "refs": [
          "https://attack.mitre.org/techniques/T1115"
        ]
      },
      "uuid": "d435aeca-fb09-11e9-8f0b-362b9e155667",
      "value": "Clipboard Data T1115"
    },
	{
      "description": "Adversaries may access data objects from improperly secured cloud storage.",
      "meta": {
        "refs": [
          "https://attack.mitre.org/techniques/T1530"
        ]
      },
      "uuid": "d435aff6-fb09-11e9-8f0b-362b9e155667",
      "value": "Data from Cloud Storage Object T1530"
    },
	{
      "description": "Sensitive data can be collected from local system sources, such as the file system or databases of information residing on the system prior to Exfiltration.",
      "meta": {
        "refs": [
          "https://attack.mitre.org/techniques/T1005"
        ]
      },
      "uuid": "9a7387f6-fb0a-11e9-aad5-362b9e155667",
      "value": "Data from Local System T1005"
    },
	{
      "description": "Sensitive data can be collected from remote systems via shared network drives (host shared directory, network file server, etc.) that are accessible from the current system prior to Exfiltration.",
      "meta": {
        "refs": [
          "https://attack.mitre.org/techniques/T1039"
        ]
      },
      "uuid": "9a738a58-fb0a-11e9-aad5-362b9e155667",
      "value": "Data from Network Shared Drive T1039"
    },
	{
      "description": "Sensitive data can be collected from any removable media (optical disk drive, USB memory, etc.) connected to the compromised system prior to Exfiltration.",
      "meta": {
        "refs": [
          "https://attack.mitre.org/techniques/T1025"
        ]
      },
      "uuid": "9a738d46-fb0a-11e9-aad5-362b9e155667",
      "value": "Data from Removable Media T1025"
    },
	{
      "description": "Collected data is staged in a central location or directory prior to Exfiltration. Data may be kept in separate files or combined into one file through techniques such as Data Compressed or Data Encrypted.",
      "meta": {
        "refs": [
          "https://attack.mitre.org/techniques/T1074"
        ]
      },
      "uuid": "9a738e86-fb0a-11e9-aad5-362b9e155667",
      "value": "Data Staged T1074"
    },
	{
      "description": "Adversaries may target user email to collect sensitive information from a target.",
      "meta": {
        "refs": [
          "https://attack.mitre.org/techniques/T1114"
        ]
      },
      "uuid": "9a738fa8-fb0a-11e9-aad5-362b9e155667",
      "value": "Email Collection T1114"
    },
	{
      "description": "Adversaries can use methods of capturing user input for obtaining credentials for Valid Accounts and information Collection that include keylogging and user input field interception.",
      "meta": {
        "refs": [
          "https://attack.mitre.org/techniques/T1056"
        ]
      },
      "uuid": "0159ca5c-fb0b-11e9-8f0b-362b9e155667",
      "value": "Input Capture T1056"
    },
	{
      "description": "Adversaries can take advantage of security vulnerabilities and inherent functionality in browser software to change content, modify behavior, and intercept information as part of various man in the browser techniques.",
      "meta": {
        "refs": [
          "https://attack.mitre.org/techniques/T1185"
        ]
      },
      "uuid": "0159ccd2-fb0b-11e9-8f0b-362b9e155667",
      "value": "Man in the Browser T1185"
    },
	{
      "description": "Adversaries may attempt to take screen captures of the desktop to gather information over the course of an operation. Screen capturing functionality may be included as a feature of a remote access tool used in post-compromise operations.",
      "meta": {
        "refs": [
          "https://attack.mitre.org/techniques/T1113"
        ]
      },
      "uuid": "0159d114-fb0b-11e9-8f0b-362b9e155667",
      "value": "Screen Capture T1113"
    },
	{
      "description": "An adversary can leverage a computer's peripheral devices (e.g., integrated cameras or webcams) or applications (e.g., video call services) to capture video recordings for the purpose of gathering information. Images may also be captured from devices or applications, potentially in specified intervals, in lieu of video files.",
      "meta": {
        "refs": [
          "https://attack.mitre.org/techniques/T1125"
        ]
      },
      "uuid": "0159d286-fb0b-11e9-8f0b-362b9e155667",
      "value": "Video Capture T1125"
    },
	{
      "description": "Adversaries may leverage information repositories to mine valuable information. Information repositories are tools that allow for storage of information, typically to facilitate collaboration or information sharing between users, and can store a wide variety of data that may aid adversaries in further objectives, or direct access to the target information.",
      "meta": {
        "refs": [
          "https://attack.mitre.org/techniques/T1213"
        ]
      },
      "uuid": "d435b122-fb09-11e9-8f0b-362b9e155667",
      "value": "Data from Information Repositories T1213"
    }
	  ],
	"version": 3
}
