{
  "category": "SEC-TOOL-Q-THRU-STRING",
  "description": "Cluster designed for tagging OSINT artifacts that relate to various tools used by cybersecurity personnel for various purposes.",
  "name": "OSRS Security Tool Index - SecTool Q thru String",
  "source": "OSRS DEV",
  "type": "OSRS-CMCF-BLOCK-H",
  "uuid": "feda733c-2817-11ea-978f-2e728ce88125",
  "values": [
	{
      "description": "Open-source jailbreaking tool for many iOS devices.",
      "meta": {
	  "kill_chain": [
          "osrs-sec-tool:SecTool Q thru String"
        ],
        "refs": [
          "https://github.com/axi0mX/ipwndfu"
        ]
      },
      "uuid": "c71e67cc-29c1-11ea-978f-2e728ce88125",
      "value": "OSRS SecTool: checkm8"
    },
	{
      "description": "A PowerShell TCP/IP swiss army knife that works with Netcat & Ncat.",
      "meta": {
	  "kill_chain": [
          "osrs-sec-tool:SecTool Q thru String"
        ],
        "refs": [
          "https://github.com/secabstraction/PowerCat"
        ]
      },
      "uuid": "8f04afc0-3f94-11ea-b77f-2e728ce88125",
      "value": "OSRS SecTool: powercat"
    },
	{
      "description": "Code disassembler much like the popular IDA code disassembler.",
      "meta": {
	  "kill_chain": [
          "osrs-sec-tool:SecTool Q thru String"
        ],
        "refs": [
          "https://rada.re/"
        ]
      },
      "uuid": "8f04b268-3f94-11ea-b77f-2e728ce88125",
      "value": "OSRS SecTool: Radare2"
    },
	{
      "description": "The Managed Object Format (MOF) compiler parses a file containing MOF statements and adds the classes and class instances defined in the file to the WMI repository. MOF files are usually automatically compiled during the installation of the systems with which they are provided, but you can also compile MOF files by using this tool.",
      "meta": {
	  "kill_chain": [
          "osrs-sec-tool:SecTool Q thru String"
        ],
        "refs": [
          "https://docs.microsoft.com/en-us/windows/win32/wmisdk/mofcomp"
        ]
      },
      "uuid": "8f04b5ba-3f94-11ea-b77f-2e728ce88125",
      "value": "OSRS SecTool: mofcomp"
    },
	{
      "description": "RAW Graphs is an open source data visualization framework built with the goal of making the visual representation of complex data easy for everyone. Primarily conceived as a tool for designers and vis geeks, RAW Graphs aims at providing a missing link between spreadsheet applications (e.g. Microsoft Excel, Apple Numbers, OpenRefine) and vector graphics editors (e.g. Adobe Illustrator, Inkscape, Sketch). The project, led and maintained by the DensityDesign Research Lab (Politecnico di Milano) was released publicly in 2013 and is regarded by many as one of the most important tools in the field of data visualization. The team responsable for the design, development and mantainance of the project is composed by DensityDesign , Calibro and Inmagik , who joined the team in 2019.",
      "meta": {
	  "kill_chain": [
          "osrs-sec-tool:SecTool Q thru String"
        ],
        "refs": [
          "https://rawgraphs.io/"
        ]
      },
      "uuid": "8f04b718-3f94-11ea-b77f-2e728ce88125",
      "value": "OSRS SecTool: RAWGraphs"
    },
	{
      "description": "Yara rule set that can be used to detect Russian APT like behaviors.",
      "meta": {
	  "kill_chain": [
          "osrs-sec-tool:SecTool Q thru String"
        ],
        "refs": [
          "https://github.com/ITAYC0HEN/APT-Ecosystem/tree/master/russia/detector"
        ]
      },
      "uuid": "8f04b84e-3f94-11ea-b77f-2e728ce88125",
      "value": "OSRS SecTool: Russian APT Detector"
    },
	{
      "description": "SQLMAP is an open source software that is used to detect and exploit database vulnerabilities and provides options for injecting malicious codes into them. It is a penetration testing tool that automates the process of detecting and exploiting SQL injection flaws providing its user interface in the terminal. The software is run at the command line and is available to download for different operating systems: Linux distributions, Windows and Mac OS operating systems. In addition to mapping and detecting vulnerabilities, the software enables access to the database, editing and deleting data, and viewing data in tables such as users, passwords, backups, phone numbers, e-mail addresses, credit cards and other confidential and sensitive information. sqlmap has full support for multiple DBMSs, including MySQL, Oracle, PostgreSQL, Microsoft SQL Server, Microsoft Access, IBM DB2, SQLite, Firebird and SAP MaxDB. And full support for all injection techniques - Boolean, Error, Stack, Time, Union.",
      "meta": {
	  "kill_chain": [
          "osrs-sec-tool:SecTool Q thru String"
        ],
        "refs": [
          "https://en.wikipedia.org/wiki/Sqlmap",
		  "https://packetstormsecurity.com/files/154303/sqlmap-1.3.9.tar.gz"
        ]
      },
      "uuid": "8f04b97a-3f94-11ea-b77f-2e728ce88125",
      "value": "OSRS SecTool: SQLMAP - Automatic SQL Injection Tool"
    },
	{
      "description": "SSLsplit is a tool for man-in-the-middle attacks against SSL/TLS encrypted network connections. It is intended to be useful for network forensics, application security analysis and penetration testing. SSLsplit is designed to transparently terminate connections that are redirected to it using a network address translation engine. SSLsplit then terminates SSL/TLS and initiates a new SSL/TLS connection to the original destination address, while logging all data transmitted. Besides NAT based operation, SSLsplit also supports static destinations and using the server name indicated by SNI as upstream destination. SSLsplit is purely a transparent proxy and cannot act as a HTTP or SOCKS proxy configured in a browser.",
      "meta": {
	  "kill_chain": [
          "osrs-sec-tool:SecTool Q thru String"
        ],
        "refs": [
          "https://www.roe.ch/SSLsplit",
		  "https://packetstormsecurity.com/files/154273/sslsplit-0.5.5.tar.bz2"
        ]
      },
      "uuid": "8f04ba9c-3f94-11ea-b77f-2e728ce88125",
      "value": "OSRS SecTool: SSLsplit"
    },
	{
      "description": "The samhain open source host-based intrusion detection system (HIDS) provides file integrity checking and logfile monitoring analysis, as well as rootkit detection, port monitoring, detection of rogue SUID executables, and hidden processes. It has been designed to monitor multiple hosts with potentially different operating systems, providing centralized logging and maintenance, although it can also be used as standalone application on a single host.",
      "meta": {
	  "kill_chain": [
          "osrs-sec-tool:SecTool Q thru String"
        ],
        "refs": [
          "https://la-samhna.de/samhain/",
		  "https://github.com/pilbender/samhain"
        ]
      },
      "uuid": "8f04bbc8-3f94-11ea-b77f-2e728ce88125",
      "value": "OSRS SecTool: Samhain File Integrity Checker"
    },
	{
      "description": "Seatbelt is a C# project that performs a number of security oriented host-survey safety checks relevant from both offensive and defensive security perspectives.",
      "meta": {
	  "kill_chain": [
          "osrs-sec-tool:SecTool Q thru String"
        ],
        "refs": [
          "https://github.com/GhostPack/Seatbelt"
        ]
      },
      "uuid": "8f04bcea-3f94-11ea-b77f-2e728ce88125",
      "value": "OSRS SecTool: SeatBelt"
    },
	{
      "description": "Security Support Provider Interface (SSPI) is a Win32 API used by Microsoft Windows systems to perform a variety of security-related operations such as authentication. SSPI functions as a common interface to several Security Support Providers (SSPs) - A Security Support Provider is a dynamic-link library (DLL) that makes one or more security packages available to applications.",
      "meta": {
	  "kill_chain": [
          "osrs-sec-tool:SecTool Q thru String"
        ],
        "refs": [
          "https://en.wikipedia.org/wiki/Security_Support_Provider_Interface",
		  "https://docs.microsoft.com/en-us/windows/win32/rpc/security-support-providers-ssps-"
        ]
      },
      "uuid": "8f04bf9c-3f94-11ea-b77f-2e728ce88125",
      "value": "OSRS SecTool: Security Support Provider (SSP)"
    },
	{
      "description": "Seatbelt is a C# project that performs a number of security oriented host-survey safety checks relevant from both offensive and defensive security perspectives.",
      "meta": {
	  "kill_chain": [
          "osrs-sec-tool:SecTool Q thru String"
        ],
        "refs": [
          "https://github.com/GhostPack/Seatbelt"
        ]
      },
      "uuid": "26a078d8-3f94-11ea-b77f-2e728ce88125",
      "value": "OSRS SecTool: SeatBelt"
    }
	  ],
	"version": 1
}
