{
  "category": "SEC-TOOL-Q-THRU-STRING",
  "description": "Cluster designed for tagging OSINT artifacts that relate to various tools used by cybersecurity personnel for various purposes.",
  "name": "OSRS Security Tool Index - SecTool Q thru String",
  "source": "OSRS DEV",
  "type": "CMCF-BLOCK-OSRS",
  "uuid": "deb05256-49bf-11ea-b77f-2e728ce88125",
  "values": [
	{
      "description": "Open-source jailbreaking tool for many iOS devices.",
      "meta": {
	  "kill_chain": [
          "osrs-sec-tool:SecTool Q thru String"
        ],
        "refs": [
          "https://github.com/axi0mX/ipwndfu"
        ]
      },
      "uuid": "c71e67cc-29c1-11ea-978f-2e728ce88125",
      "value": "OSRS SecTool: checkm8"
    },
	{
      "description": "A PowerShell TCP/IP swiss army knife that works with Netcat & Ncat.",
      "meta": {
	  "kill_chain": [
          "osrs-sec-tool:SecTool Q thru String"
        ],
        "refs": [
          "https://github.com/secabstraction/PowerCat"
        ]
      },
      "uuid": "8f04afc0-3f94-11ea-b77f-2e728ce88125",
      "value": "OSRS SecTool: powercat"
    },
	{
      "description": "Code disassembler much like the popular IDA code disassembler.",
      "meta": {
	  "kill_chain": [
          "osrs-sec-tool:SecTool Q thru String"
        ],
        "refs": [
          "https://rada.re/"
        ]
      },
      "uuid": "8f04b268-3f94-11ea-b77f-2e728ce88125",
      "value": "OSRS SecTool: Radare2"
    },
	{
      "description": "The Managed Object Format (MOF) compiler parses a file containing MOF statements and adds the classes and class instances defined in the file to the WMI repository. MOF files are usually automatically compiled during the installation of the systems with which they are provided, but you can also compile MOF files by using this tool.",
      "meta": {
	  "kill_chain": [
          "osrs-sec-tool:SecTool Q thru String"
        ],
        "refs": [
          "https://docs.microsoft.com/en-us/windows/win32/wmisdk/mofcomp"
        ]
      },
      "uuid": "8f04b5ba-3f94-11ea-b77f-2e728ce88125",
      "value": "OSRS SecTool: mofcomp"
    },
	{
      "description": "RAW Graphs is an open source data visualization framework built with the goal of making the visual representation of complex data easy for everyone. Primarily conceived as a tool for designers and vis geeks, RAW Graphs aims at providing a missing link between spreadsheet applications (e.g. Microsoft Excel, Apple Numbers, OpenRefine) and vector graphics editors (e.g. Adobe Illustrator, Inkscape, Sketch). The project, led and maintained by the DensityDesign Research Lab (Politecnico di Milano) was released publicly in 2013 and is regarded by many as one of the most important tools in the field of data visualization. The team responsable for the design, development and mantainance of the project is composed by DensityDesign , Calibro and Inmagik , who joined the team in 2019.",
      "meta": {
	  "kill_chain": [
          "osrs-sec-tool:SecTool Q thru String"
        ],
        "refs": [
          "https://rawgraphs.io/"
        ]
      },
      "uuid": "8f04b718-3f94-11ea-b77f-2e728ce88125",
      "value": "OSRS SecTool: RAWGraphs"
    },
	{
      "description": "Yara rule set that can be used to detect Russian APT like behaviors.",
      "meta": {
	  "kill_chain": [
          "osrs-sec-tool:SecTool Q thru String"
        ],
        "refs": [
          "https://github.com/ITAYC0HEN/APT-Ecosystem/tree/master/russia/detector"
        ]
      },
      "uuid": "8f04b84e-3f94-11ea-b77f-2e728ce88125",
      "value": "OSRS SecTool: Russian APT Detector"
    },
	{
      "description": "SQLMAP is an open source software that is used to detect and exploit database vulnerabilities and provides options for injecting malicious codes into them. It is a penetration testing tool that automates the process of detecting and exploiting SQL injection flaws providing its user interface in the terminal. The software is run at the command line and is available to download for different operating systems: Linux distributions, Windows and Mac OS operating systems. In addition to mapping and detecting vulnerabilities, the software enables access to the database, editing and deleting data, and viewing data in tables such as users, passwords, backups, phone numbers, e-mail addresses, credit cards and other confidential and sensitive information. sqlmap has full support for multiple DBMSs, including MySQL, Oracle, PostgreSQL, Microsoft SQL Server, Microsoft Access, IBM DB2, SQLite, Firebird and SAP MaxDB. And full support for all injection techniques - Boolean, Error, Stack, Time, Union.",
      "meta": {
	  "kill_chain": [
          "osrs-sec-tool:SecTool Q thru String"
        ],
        "refs": [
          "https://en.wikipedia.org/wiki/Sqlmap",
		  "https://packetstormsecurity.com/files/154303/sqlmap-1.3.9.tar.gz"
        ]
      },
      "uuid": "8f04b97a-3f94-11ea-b77f-2e728ce88125",
      "value": "OSRS SecTool: SQLMAP - Automatic SQL Injection Tool"
    },
	{
      "description": "SSLsplit is a tool for man-in-the-middle attacks against SSL/TLS encrypted network connections. It is intended to be useful for network forensics, application security analysis and penetration testing. SSLsplit is designed to transparently terminate connections that are redirected to it using a network address translation engine. SSLsplit then terminates SSL/TLS and initiates a new SSL/TLS connection to the original destination address, while logging all data transmitted. Besides NAT based operation, SSLsplit also supports static destinations and using the server name indicated by SNI as upstream destination. SSLsplit is purely a transparent proxy and cannot act as a HTTP or SOCKS proxy configured in a browser.",
      "meta": {
	  "kill_chain": [
          "osrs-sec-tool:SecTool Q thru String"
        ],
        "refs": [
          "https://www.roe.ch/SSLsplit",
		  "https://packetstormsecurity.com/files/154273/sslsplit-0.5.5.tar.bz2"
        ]
      },
      "uuid": "8f04ba9c-3f94-11ea-b77f-2e728ce88125",
      "value": "OSRS SecTool: SSLsplit"
    },
	{
      "description": "The samhain open source host-based intrusion detection system (HIDS) provides file integrity checking and logfile monitoring analysis, as well as rootkit detection, port monitoring, detection of rogue SUID executables, and hidden processes. It has been designed to monitor multiple hosts with potentially different operating systems, providing centralized logging and maintenance, although it can also be used as standalone application on a single host.",
      "meta": {
	  "kill_chain": [
          "osrs-sec-tool:SecTool Q thru String"
        ],
        "refs": [
          "https://la-samhna.de/samhain/",
		  "https://github.com/pilbender/samhain"
        ]
      },
      "uuid": "8f04bbc8-3f94-11ea-b77f-2e728ce88125",
      "value": "OSRS SecTool: Samhain File Integrity Checker"
    },
	{
      "description": "Seatbelt is a C# project that performs a number of security oriented host-survey safety checks relevant from both offensive and defensive security perspectives.",
      "meta": {
	  "kill_chain": [
          "osrs-sec-tool:SecTool Q thru String"
        ],
        "refs": [
          "https://github.com/GhostPack/Seatbelt"
        ]
      },
      "uuid": "8f04bcea-3f94-11ea-b77f-2e728ce88125",
      "value": "OSRS SecTool: SeatBelt"
    },
	{
      "description": "Security Support Provider Interface (SSPI) is a Win32 API used by Microsoft Windows systems to perform a variety of security-related operations such as authentication. SSPI functions as a common interface to several Security Support Providers (SSPs) - A Security Support Provider is a dynamic-link library (DLL) that makes one or more security packages available to applications.",
      "meta": {
	  "kill_chain": [
          "osrs-sec-tool:SecTool Q thru String"
        ],
        "refs": [
          "https://en.wikipedia.org/wiki/Security_Support_Provider_Interface",
		  "https://docs.microsoft.com/en-us/windows/win32/rpc/security-support-providers-ssps-"
        ]
      },
      "uuid": "8f04bf9c-3f94-11ea-b77f-2e728ce88125",
      "value": "OSRS SecTool: Security Support Provider (SSP)"
    },
	{
      "description": "The samhain open source host-based intrusion detection system (HIDS) provides file integrity checking and logfile monitoring analysis, as well as rootkit detection, port monitoring, detection of rogue SUID executables, and hidden processes. It has been designed to monitor multiple hosts with potentially different operating systems, providing centralized logging and maintenance, although it can also be used as standalone application on a single host.",
      "meta": {
	  "kill_chain": [
          "osrs-sec-tool:SecTool Q thru String"
        ],
        "refs": [
          "https://la-samhna.de/samhain/",
		  "https://github.com/pilbender/samhain"
        ]
      },
      "uuid": "5910747c-42cc-11ea-b77f-2e728ce88125",
      "value": "OSRS SecTool: Samhain File Integrity Checker"
    },
	{
      "description": "Windows persistence toolkit written in C#. Author - Brett Hawkins (@h4wkst3r).",
      "meta": {
	  "kill_chain": [
          "osrs-sec-tool:SecTool Q thru String"
        ],
        "refs": [
          "https://github.com/fireeye/SharPersist"
        ]
      },
      "uuid": "59107760-42cc-11ea-b77f-2e728ce88125",
      "value": "OSRS SecTool: SharPersist"
    },
	{
      "description": "SharpHound uses graph theory to reveal the hidden and often unintended relationships within an Active Directory environment. Attacks can use SharpHound to easily identify highly complex attack paths that would otherwise be impossible to quickly identify. Defenders can use SharpHound to identify and eliminate those same attack paths. Both blue and red teams can use SharpHound to easily gain a deeper understanding of privilege relationships in an Active Directory environment.",
      "meta": {
	  "kill_chain": [
          "osrs-sec-tool:SecTool Q thru String"
        ],
        "refs": [
          "https://github.com/BloodHoundAD/SharpHound"
        ]
      },
      "uuid": "59107922-42cc-11ea-b77f-2e728ce88125",
      "value": "OSRS SecTool: SharpHound"
    },
	{
      "description": "SharpSploit Console is just a quick proof of concept binary to help penetration testers or red teams with less C# experience play with some of the awesomeness that is SharpSploit. By following the instructions below you should be able to embed both the SharpSploit.dll and System.Management.Automation.dll into the SharpSploitConsole binary, creating a standalone exe you can drop on an appropriate target sytem and run over a non-interactive shell (such as beacon). This concept can be applied to many C# binaries. For example, we could embed the System.Management.Automation.dll into our favorite C# NoPowershell.exe, creating a binary that does not rely on the System.Management.Automation.dll on the target system.",
      "meta": {
	  "kill_chain": [
          "osrs-sec-tool:SecTool Q thru String"
        ],
        "refs": [
          "https://github.com/anthemtotheego/SharpSploitConsole"
        ]
      },
      "uuid": "59107abc-42cc-11ea-b77f-2e728ce88125",
      "value": "OSRS SecTool: SharpSploitConsole"
    },
	{
      "description": "SharpUp is a C# port of various PowerUp functionality. Currently, only the most common checks have been ported; no weaponization functions have yet been implemented.",
      "meta": {
	  "kill_chain": [
          "osrs-sec-tool:SecTool Q thru String"
        ],
        "refs": [
          "https://github.com/GhostPack/SharpUp"
        ]
      },
      "uuid": "59107c24-42cc-11ea-b77f-2e728ce88125",
      "value": "OSRS SecTool: SharpUp"
    },
	{
      "description": ".NET port of PowerView. PowerView is a PowerShell tool to gain network situational awareness on Windows domains. It contains a set of pure-PowerShell replacements for various windows net commands, which utilize PowerShell AD hooks and underlying Win32 API functions to perform useful Windows domain functionality.",
      "meta": {
	  "kill_chain": [
          "osrs-sec-tool:SecTool Q thru String"
        ],
        "refs": [
          "https://github.com/tevora-threat/SharpView"
        ]
      },
      "uuid": "59107daa-42cc-11ea-b77f-2e728ce88125",
      "value": "OSRS SecTool: SharpView"
    },
	{
      "description": "Metasploit encodeing scheme.",
      "meta": {
	  "kill_chain": [
          "osrs-sec-tool:SecTool Q thru String"
        ],
        "refs": [
          "https://www.fireeye.com/blog/threat-research/2019/10/shikata-ga-nai-encoder-still-going-strong.html"
        ]
      },
      "uuid": "59107f4e-42cc-11ea-b77f-2e728ce88125",
      "value": "OSRS SecTool: Shikata Ga Nai (SGN)"
    },
	{
      "description": "SingleFile is a Web Extension compatible with Chrome, Firefox (Desktop and Mobile), Chromium-based Edge, Vivaldi, Brave, Waterfox, Yandex browser, and Opera. It helps you to save a complete web page into a single HTML file.",
      "meta": {
	  "kill_chain": [
          "osrs-sec-tool:SecTool Q thru String"
        ],
        "refs": [
          "https://github.com/gildas-lormeau/SingleFile"
        ]
      },
      "uuid": "5910812e-42cc-11ea-b77f-2e728ce88125",
      "value": "OSRS SecTool: SingleFile"
    },
	{
      "description": "SoftEther VPN is free open-source, cross-platform, multi-protocol VPN client and VPN server software, developed as part of Daiyuu Nobori's master's thesis research at the University of Tsukuba.",
      "meta": {
	  "kill_chain": [
          "osrs-sec-tool:SecTool Q thru String"
        ],
        "refs": [
          "https://www.softether.org/"
        ]
      },
      "uuid": "591082c8-42cc-11ea-b77f-2e728ce88125",
      "value": "OSRS SecTool: SoftEther VPN"
    },
	{
      "description": "Stegano, a pure Python Steganography module.",
      "meta": {
	  "kill_chain": [
          "osrs-sec-tool:SecTool Q thru String"
        ],
        "refs": [
          "https://github.com/cedricbonhomme/Stegano"
        ]
      },
      "uuid": "5910849e-42cc-11ea-b77f-2e728ce88125",
      "value": "OSRS SecTool: Stegano"
    },
	{
      "description": "StringSifter is a machine learning tool that automatically ranks strings based on their relevance for malware analysis.",
      "meta": {
	  "kill_chain": [
          "osrs-sec-tool:SecTool Q thru String"
        ],
        "refs": [
          "https://github.com/fireeye/stringsifter"
        ]
      },
      "uuid": "89d63bfa-42cc-11ea-b77f-2e728ce88125",
      "value": "OSRS SecTool: StringSifter"
    },
	{
      "description": "Suricata is a free and open source, mature, fast and robust network threat detection engine. The Suricata engine is capable of real time intrusion detection (IDS), inline intrusion prevention (IPS), network security monitoring (NSM) and offline pcap processing. Suricata inspects the network traffic using a powerful and extensive rules and signature language, and has powerful Lua scripting support for detection of complex threats. With standard input and output formats like YAML and JSON integrations with tools like existing SIEMs, Splunk, Logstash/Elasticsearch, Kibana, and other database become effortless. Suricata’s fast paced community driven development focuses on security, usability and efficiency. The Suricata project and code is owned and supported by the Open Information Security Foundation (OISF), a non-profit foundation committed to ensuring Suricata’s development and sustained success as an open source project.",
      "meta": {
	  "kill_chain": [
          "osrs-sec-tool:SecTool Q thru String"
        ],
        "refs": [
          "https://suricata-ids.org/"
        ]
      },
      "uuid": "89d63eac-42cc-11ea-b77f-2e728ce88125",
      "value": "OSRS SecTool: Suricata"
    },
	{
      "description": "tcpdump is a common packet analyzer that runs under the command line. It allows the user to display TCP/IP and other packets being transmitted or received over a network to which the computer is attached. Distributed under the BSD license, tcpdump is free software. Tcpdump works on most Unix-like operating systems: Linux, Solaris, FreeBSD, DragonFly BSD, NetBSD, OpenBSD, OpenWrt, macOS, HP-UX 11i, and AIX. In those systems, tcpdump uses the libpcap library to capture packets. The port of tcpdump for Windows is called WinDump; it uses WinPcap, the Windows port of libpcap.",
      "meta": {
	  "kill_chain": [
          "osrs-sec-tool:SecTool Q thru String"
        ],
        "refs": [
          "https://github.com/the-tcpdump-group/",
		  "https://github.com/the-tcpdump-group/tcpdump",
		  "https://www.tcpdump.org",
		  "https://en.wikipedia.org/wiki/Tcpdump"
        ],
        "synonyms": [
        "WinDump"
        ]
      },
      "uuid": "89d64000-42cc-11ea-b77f-2e728ce88125",
      "value": "OSRS SecTool: TCPdump"
    },
	{
      "description": "Tor is free and open-source software for enabling anonymous communication. The name is derived from an acronym for the original software project name The Onion Router. Tor directs Internet traffic through a free, worldwide, volunteer overlay network consisting of more than seven thousand relays to conceal a user's location and usage from anyone conducting network surveillance or traffic analysis. Using Tor makes it more difficult to trace Internet activity to the user; this includes, visits to Web sites, online posts, instant messages, and other communication forms. Tor's intended use is to protect the personal privacy of its users, as well as their freedom and ability to conduct confidential communication by keeping their Internet activities from being monitored.",
      "meta": {
	  "kill_chain": [
          "osrs-sec-tool:SecTool Q thru String"
        ],
        "refs": [
          "https://en.wikipedia.org/wiki/Tor_(anonymity_network)",
		  "https://packetstormsecurity.com/files/154167/tor-0.4.1.5.tar.gz"
        ]
      },
      "uuid": "89d64370-42cc-11ea-b77f-2e728ce88125",
      "value": "OSRS SecTool: TOR Virtual Network Tunneling Tool"
    },
	{
      "description": "DFIR linux created by veterans of the Backtrack and Deft linux teams.",
      "meta": {
	  "kill_chain": [
          "osrs-sec-tool:SecTool Q thru String"
        ],
        "refs": [
          "https://tsurugi-linux.org"
        ]
      },
      "uuid": "89d644ce-42cc-11ea-b77f-2e728ce88125",
      "value": "OSRS SecTool: TSURUGI Linux"
    },
	{
      "description": "The Hex-Rays Decompiler brings binary software analysis within reach of millions of programmers. It converts native processor code into a readable C-like pseudocode text. Currently, the decompiler supports compiler generated code for the x86, x64, ARM32, ARM64, and PowerPC processors and we are adding support for other platforms on an ongoing basis. The programmatic API allows you to improve the decompiler output, giving flexibility to your analysis of areas such as vulnerability search, software validation, and coverage. The decompiler runs on all standard platforms - MS Windows, Linux, and Mac OS X, both in GUI and console modes.",
      "meta": {
	  "kill_chain": [
          "osrs-sec-tool:SecTool Q thru String"
        ],
        "refs": [
          "https://www.hex-rays.com/products/decompiler/index.shtml"
        ]
      },
      "uuid": "89d64604-42cc-11ea-b77f-2e728ce88125",
      "value": "OSRS SecTool: The Hex-Rays Decompiler"
    },
	{
      "description": "This is an IDA processor module for the Tile-GX processor architecture.",
      "meta": {
	  "kill_chain": [
          "osrs-sec-tool:SecTool Q thru String"
        ],
        "refs": [
          "https://github.com/Cisco-Talos/ida_tilegx"
        ]
      },
      "uuid": "89d64730-42cc-11ea-b77f-2e728ce88125",
      "value": "OSRS SecTool: Tilera"
    },
	{
      "description": "Tinc is a Virtual Private Network (VPN) daemon that uses tunnelling and encryption to create a secure private network between hosts on the Internet. tinc is Free Software and licensed under the GNU General Public License version 2 or later. Because the VPN appears to the IP level network code as a normal network device, there is no need to adapt any existing software. This allows VPN sites to share information with each other over the Internet without exposing any information to others.",
      "meta": {
	  "kill_chain": [
          "osrs-sec-tool:SecTool Q thru String"
        ],
        "refs": [
          "https://www.tinc-vpn.org",
		  "https://packetstormsecurity.com/files/154218/tinc-1.0.36.tar.gz"
        ]
      },
      "uuid": "89d64852-42cc-11ea-b77f-2e728ce88125",
      "value": "OSRS SecTool: Tinc Virtual Private Network Daemon"
    },
	{
      "description": "Travesty – A directory and file enumeration tool (post directory traversal exploitation) This tool assists security analysts in identifying interesting directories and files once a directory traversal has been found.",
      "meta": {
	  "kill_chain": [
          "osrs-sec-tool:SecTool Q thru String"
        ],
        "refs": [
          "https://github.com/telspacesystems/travesty/",
		  "https://blog.telspace.co.za/2019/11/travesty-directory-and-file-enumeration.html"
        ]
      },
      "uuid": "89d64a50-42cc-11ea-b77f-2e728ce88125",
      "value": "OSRS SecTool: Travesty"
    },
	{
      "description": "svchost.exe (Service Host, or SvcHost) is a system process that can host from one to many Windows services in the Windows NT family of operating systems. Svchost is essential in the implementation of so-called shared service processes, where a number of services can share a process in order to reduce resource consumption. Grouping multiple services into a single process conserves computing resources, and this consideration was of particular concern to NT designers because creating Windows processes takes more time and consumes more memory than in other operating systems, e.g. in the Unix family. However, if one of the services causes an unhandled exception, the entire process may crash. In addition, identifying component services can be more difficult for end users. Problems with various hosted services, particularly with Windows Update, get reported by users (and headlined by the press) as involving svchost. The svchost process was introduced in Windows 2000, although the underlying support for shared service processes has existed since Windows NT 3.1.",
      "meta": {
	  "kill_chain": [
          "osrs-sec-tool:SecTool Q thru String"
        ],
        "refs": [
          "https://en.wikipedia.org/wiki/Svchost.exe"
        ]
      },
      "uuid": "89d64df2-42cc-11ea-b77f-2e728ce88125",
      "value": "OSRS SecTool: svchost"
    },
	{
      "description": "Voice-activated control for your PC games and apps.",
      "meta": {
	  "kill_chain": [
          "osrs-sec-tool:SecTool Q thru String"
        ],
        "refs": [
          "https://voiceattack.com"
        ]
      },
      "uuid": "bad7edb6-42cc-11ea-b77f-2e728ce88125",
      "value": "OSRS SecTool: VoiceAttack"
    },
	{
      "description": "The Volatility Framework is a completely open collection of tools, implemented in Python under the GNU General Public License, for the extraction of digital artifacts from volatile memory (RAM) samples. The extraction techniques are performed completely independent of the system being investigated but offer visibilty into the runtime state of the system. The framework is intended to introduce people to the techniques and complexities associated with extracting digital artifacts from volatile memory samples and provide a platform for further work into this exciting area of research.",
      "meta": {
	  "kill_chain": [
          "osrs-sec-tool:SecTool Q thru String"
        ],
        "refs": [
          "https://github.com/volatilityfoundation/volatility"
        ]
      },
      "uuid": "bad7f022-42cc-11ea-b77f-2e728ce88125",
      "value": "OSRS SecTool: Volatility"
    },
	{
      "description": "Wapiti allows you to audit the security of your websites or web applications. It performs black-box scans (it does not study the source code) of the web application by crawling the webpages of the deployed webapp, looking for scripts and forms where it can inject data. Once it gets the list of URLs, forms and their inputs, Wapiti acts like a fuzzer, injecting payloads to see if a script is vulnerable.",
      "meta": {
	  "kill_chain": [
          "osrs-sec-tool:SecTool Q thru String"
        ],
        "refs": [
          "http://wapiti.sourceforge.net/"
        ]
      },
      "uuid": "bad7f1ee-42cc-11ea-b77f-2e728ce88125",
      "value": "OSRS SecTool: Wapiti"
    },
	{
      "description": "Webfwlog is a flexible web-based firewall log analyzer and reporting tool. It supports standard system logs for linux, FreeBSD, OpenBSD, NetBSD, Solaris, Irix, OS X, etc. as well as Windows XP. Supported log file formats are netfilter, ipfilter, ipfw, ipchains and Windows XP. Webfwlog also supports logs saved in a database using the ULOG or NFLOG targets of the linux netfilter project, or any other database logs mapped with a view to the ulogd schema. Versions 1 and 2 of ulogd database schemas are supported.",
      "meta": {
	  "kill_chain": [
          "osrs-sec-tool:SecTool Q thru String"
        ],
        "refs": [
          "http://webfwlog.sourceforge.net/"
        ]
      },
      "uuid": "bad7f34c-42cc-11ea-b77f-2e728ce88125",
      "value": "OSRS SecTool: Webfwlog Firewall Log Analyzer"
    },
	{
      "description": "WhatWeb identifies websites. Its goal is to answer the question, What is that Website?. WhatWeb recognises web technologies including content management systems (CMS), blogging platforms, statistic/analytics packages, JavaScript libraries, web servers, and embedded devices. WhatWeb has over 1800 plugins, each to recognise something different. WhatWeb also identifies version numbers, email addresses, account IDs, web framework modules, SQL errors, and more. WhatWeb can be stealthy and fast, or thorough but slow. WhatWeb supports an aggression level to control the trade off between speed and reliability. When you visit a website in your browser, the transaction includes many hints of what web technologies are powering that website. Sometimes a single webpage visit contains enough information to identify a website but when it does not, WhatWeb can interrogate the website further. The default level of aggression, called stealthy, is the fastest and requires only one HTTP request of a website. This is suitable for scanning public websites. More aggressive modes were developed for use in penetration tests. Most WhatWeb plugins are thorough and recognise a range of cues from subtle to obvious. For example, most WordPress websites can be identified by the meta HTML tag, but a minority of WordPress websites remove this identifying tag but this does not thwart WhatWeb. The WordPress WhatWeb plugin has over 15 tests, which include checking the favicon, default installation files, login pages, and checking for wp-content within relative links.",
      "meta": {
	  "kill_chain": [
          "osrs-sec-tool:SecTool Q thru String"
        ],
        "refs": [
          "https://github.com/urbanadventurer/WhatWeb"
        ]
      },
      "uuid": "bad7f482-42cc-11ea-b77f-2e728ce88125",
      "value": "OSRS SecTool: WhatWeb Scanner"
    },
	{
      "description": "For many years, WinPcap has been recognized as the industry-standard tool for link-layer network access in Windows environments, allowing applications to capture and transmit network packets bypassing the protocol stack, and including kernel-level packet filtering, a network statistics engine and support for remote packet capture.",
      "meta": {
	  "kill_chain": [
          "osrs-sec-tool:SecTool Q thru String"
        ],
        "refs": [
          "https://www.winpcap.org"
        ]
      },
      "uuid": "bad7f766-42cc-11ea-b77f-2e728ce88125",
      "value": "OSRS SecTool: WinPcap"
    },
	{
      "description": "Windows Management Instrumentation (WMI) is the infrastructure for management data and operations on Windows-based operating systems. You can write WMI scripts or applications to automate administrative tasks on remote computers but WMI also supplies management data to other parts of the operating system and products, for example System Center Operations Manager, formerly Microsoft Operations Manager (MOM), or Windows Remote Management (WinRM).",
      "meta": {
	  "kill_chain": [
          "osrs-sec-tool:SecTool Q thru String"
        ],
        "refs": [
          "https://docs.microsoft.com/en-us/windows/win32/wmisdk/wmi-start-page"
        ]
      },
      "uuid": "bad7f8b0-42cc-11ea-b77f-2e728ce88125",
      "value": "OSRS SecTool: Windows Management Instrumentation (WMI)"
    },
	{
      "description": "Wireshark is the world’s foremost and widely-used network protocol analyzer. It lets you see what’s happening on your network at a microscopic level and is the de facto (and often de jure) standard across many commercial and non-profit enterprises, government agencies, and educational institutions. Wireshark development thrives thanks to the volunteer contributions of networking experts around the globe and is the continuation of a project started by Gerald Combs in 1998.",
      "meta": {
	  "kill_chain": [
          "osrs-sec-tool:SecTool Q thru String"
        ],
        "refs": [
          "https://www.wireshark.org"
        ]
      },
      "uuid": "bad7f9dc-42cc-11ea-b77f-2e728ce88125",
      "value": "OSRS SecTool: Wireshark"
    },
	{
      "description": "Cross Site Scripter (aka XSSer) is an automatic framework to detect, exploit and report XSS vulnerabilities in web-based applications. It provides several options to try to bypass certain filters and various special techniques for code injection.",
      "meta": {
	  "kill_chain": [
          "osrs-sec-tool:SecTool Q thru String"
        ],
        "refs": [
          "https://github.com/epsylon/xsser"
        ]
      },
      "uuid": "bad7fb08-42cc-11ea-b77f-2e728ce88125",
      "value": "OSRS SecTool: XSSer"
    },
	{
      "description": "Yoda's Protector is a free, open source, Windows 32-bit software protector.",
      "meta": {
	  "kill_chain": [
          "osrs-sec-tool:SecTool Q thru String"
        ],
        "refs": [
          "https://sourceforge.net/projects/yodap/",
		  "https://sourceforge.net/p/yodap/wiki/"
        ]
      },
      "uuid": "bad7fcd4-42cc-11ea-b77f-2e728ce88125",
      "value": "OSRS SecTool: Yodas Protector"
    },
	{
      "description": ".VBS that creates a .lnk file spoofing the file extension with unicode chars that reverses the .lnk file extension, appends .txt to the end and changes the icon to notepad to make it appear as a textfile. When executed, the payload is a powershell webdl and execute.",
      "meta": {
	  "kill_chain": [
          "osrs-sec-tool:SecTool Q thru String"
        ],
        "refs": [
          "https://github.com/xillwillx/tricky.lnk"
        ]
      },
      "uuid": "36afe42c-42d0-11ea-b77f-2e728ce88125",
      "value": "OSRS SecTool: tricky.lnk"
    },
	{
      "description": "Zeek is a powerful network analysis framework that is much different from the typical IDS you may know. (Zeek is the new name for the long-established Bro system. Note that parts of the system retain the Bro name, and it also often appears in the documentation and distributions.)",
      "meta": {
	  "kill_chain": [
          "osrs-sec-tool:SecTool Q thru String"
        ],
        "refs": [
          "https://www.zeek.org/",
		  "https://packetstormsecurity.com/files/154248/bro-2.6.4.tar.gz"
        ],
        "synonyms": [
        "Bro Network Security Monitor",
		"Bro"
        ]
      },
      "uuid": "36afe698-42d0-11ea-b77f-2e728ce88125",
      "value": "OSRS SecTool: Zeek Network Security Monitor"
    },
	{
      "description": "Spices.Net Obfuscator is a .Net code obfuscation, protection and optimization tool that offers the wide range of technologies to completely protect your .Net code and secure your data. Spices.Net Obfuscator rebuilds your .Net assemblies to the new format that is impossible to disassemble, decompile, impossible to understand. .Net Obfuscator is a part of Spices.Net and offered as Visual Studio Integrated package (Spices.VSIP.Obfuscator), standalone GUI program and as console edition. You can use Spices.Net Obfuscator as freeware for non-commercial use, all features of Spices.Net Obfuscator in Free Evaluation version are presented and work without limitations.",
      "meta": {
	  "kill_chain": [
          "osrs-sec-tool:SecTool Q thru String"
        ],
        "refs": [
          "https://www.9rays.net/Category/55-spicesnet-obfuscator.aspx"
        ],
        "synonyms": [
        "Spices.Net Obfuscator"
        ]
      },
      "uuid": "36afe83c-42d0-11ea-b77f-2e728ce88125",
      "value": "OSRS SecTool: 9rays"
    },
	{
      "description": "This tool is a proof of concept code, to give researchers and security consultants the possibility to show how easy it would be to gain unauthorized access from remote to a system.",
      "meta": {
	  "kill_chain": [
          "osrs-sec-tool:SecTool Q thru String"
        ],
        "refs": [
          "https://github.com/vanhauser-thc/thc-hydra"
        ]
      },
      "uuid": "04000126-42d3-11ea-b77f-2e728ce88125",
      "value": "OSRS SecTool: thc-hydra"
    },
	{
      "description": "Richsploit Exploitation toolkit for RichFaces.",
      "meta": {
	  "kill_chain": [
          "osrs-sec-tool:SecTool Q thru String"
        ],
        "refs": [
          "https://www.redtimmy.com/java-hacking/richsploit-one-tool-to-exploit-all-versions-of-richfaces-ever-released/",
		  "https://github.com/redtimmy/Richsploit"
        ]
      },
      "uuid": "51f2a47c-67b5-11ea-bc55-0242ac130003",
      "value": "OSRS SecTool: Richsploit"
    },
	{
      "description": "A generic shell script compiler. Shc takes a script, which is specified on the command line and produces C source code. The generated source code is then compiled and linked to produce a stripped binary executable. The compiled binary will still be dependent on the shell specified in the first line of the shell code (i.e shebang) (i.e. #!/bin/sh), thus shc does not create completely independent binaries. shc itself is not a compiler such as cc, it rather encodes and encrypts a shell script and generates C source code with the added expiration capability. It then uses the system compiler to compile a stripped binary which behaves exactly like the original script. Upon execution, the compiled binary will decrypt and execute the code with the shell -c option.",
      "meta": {
	  "kill_chain": [
          "osrs-sec-tool:SecTool Q thru String"
        ],
        "refs": [
          "https://github.com/neurobin/shc"
        ],
        "synonyms": [
        "Shell Script Compiler"
        ]
      },
      "uuid": "0818d910-70f8-11ea-bc55-0242ac130003",
      "value": "OSRS SecTool: SHC"
    },
	{
      "description": "Open-source file encryption application.",
      "meta": {
	  "kill_chain": [
          "osrs-sec-tool:SecTool Q thru String"
        ],
        "refs": [
          "https://cr.yp.to/snuffle/salsa20/merged/salsa20.c"
        ]
      },
      "uuid": "6837ab54-74e1-11ea-bc55-0242ac130003",
      "value": "OSRS SecTool: Salsa20"
    },
	{
      "description": "ysoserial is a collection of utilities and property-oriented programming gadget chains discovered in common java libraries that can, under the right conditions, exploit Java applications performing unsafe deserialization of objects. The main driver program takes a user-specified command and wraps it in the user-specified gadget chain, then serializes these objects to stdout. When an application with the required gadgets on the classpath unsafely deserializes this data, the chain will automatically be invoked and cause the command to be executed on the application host.",
      "meta": {
	  "kill_chain": [
          "osrs-sec-tool:SecTool Q thru String"
        ],
        "refs": [
          "https://github.com/frohoff/ysoserial"
        ]
      },
      "uuid": "b843b910-74fc-11ea-bc55-0242ac130003",
      "value": "OSRS SecTool: ysoserial"
    },
	{
      "description": "Recon-Informer is a basic real-time anti-reconnaissance detection tool for offensive security systems, useful for penetration testers. It runs on Windows or Linux and leverages scapy. Purpose - Recon-Informer is NOT meant for protecting public facing or lan critical enterprise systems whatsoever. Its purpose is detect possible recon against our attacker system on a LAN to provide us defensive intel. Therefore, this script is most useful for basic short-term defensive visibility.",
      "meta": {
	  "kill_chain": [
          "osrs-sec-tool:SecTool Q thru String"
        ],
        "refs": [
          "https://github.com/hyp3rlinx/0/blob/master/Recon-Informer.py"
        ]
      },
      "uuid": "0af1a3c6-7673-11ea-bc55-0242ac130003",
      "value": "OSRS SecTool: Recon-Informer"
    },
	{
      "description": "Online resource for encoding data.",
      "meta": {
	  "kill_chain": [
          "osrs-sec-tool:SecTool Q thru String"
        ],
        "refs": [
          "https://www.sojson.com/"
        ]
      },
      "uuid": "23e68f10-7752-11ea-bc55-0242ac130003",
      "value": "OSRS SecTool: Sojson Obfuscator"
    },
	{
      "description": "Bolt is a pure Go key/value store inspired by Howard Chu's LMDB project. The goal of the project is to provide a simple, fast, and reliable database for projects that don't require a full database server such as Postgres or MySQL. Since Bolt is meant to be used as such a low-level piece of functionality, simplicity is key. The API will be small and only focus on getting values and setting values. That's it.",
      "meta": {
	  "kill_chain": [
          "osrs-sec-tool:SecTool Q thru String"
        ],
        "refs": [
          "https://github.com/boltdb/bolt"
        ]
      },
      "uuid": "09098daa-79b4-11ea-bc55-0242ac130003",
      "value": "OSRS SecTool: BoltDB"
    },
	{
      "description": "Sandbox isolation tool developed by the cybersecurity vendor Sophos.",
      "meta": {
	  "kill_chain": [
          "osrs-sec-tool:SecTool Q thru String"
        ],
        "refs": [
          "https://www.sandboxie.com/",
		  "https://www.bleepingcomputer.com/news/software/the-sandboxie-windows-sandbox-isolation-tool-is-now-open-source/"
        ]
      },
      "uuid": "90fba306-7d8d-11ea-bc55-0242ac130003",
      "value": "OSRS SecTool: Sandboxie"
    },
	{
      "description": "SkyWrapper is an open-source project which analyzes behaviors of temporary tokens created in a given AWS account. The tool is aiming to find suspicious creation forms and uses of temporary tokens to detect malicious activity in the account. The tool analyzes the AWS account, and creating an excel sheet includes all the currently living temporary tokens. A summary of the finding printed to the screen after each run.",
      "meta": {
	  "kill_chain": [
          "osrs-sec-tool:SecTool Q thru String"
        ],
        "refs": [
          "https://github.com/cyberark/SkyWrapper"
        ]
      },
      "uuid": "cf3c2844-8020-11ea-bc55-0242ac130003",
      "value": "OSRS SecTool: SkyWrapper"
    },
	{
      "description": "testssl.sh is a free command line tool which checks a server's service on any port for the support of TLS/SSL ciphers, protocols as well as some cryptographic flaws.",
      "meta": {
	  "kill_chain": [
          "osrs-sec-tool:SecTool Q thru String"
        ],
        "refs": [
          "https://github.com/drwetter/testssl.sh"
        ]
      },
      "uuid": "d9e045a2-83d9-11ea-bc55-0242ac130003",
      "value": "OSRS SecTool: testssl.sh"
    },
	{
      "description": "Defeating Windows User Account Control by abusing built-in Windows AutoElevate backdoor.",
      "meta": {
	  "kill_chain": [
          "osrs-sec-tool:SecTool Q thru String"
        ],
        "refs": [
          "https://github.com/hfiref0x/UACME"
        ]
      },
      "uuid": "48d7cbca-8afa-11ea-bc55-0242ac130003",
      "value": "OSRS SecTool: UACMe"
    },
	{
      "description": "URLCrazy is an OSINT tool to generate and test domain typos or variations to detect or perform typo squatting, URL hijacking, phishing, and corporate espionage.",
      "meta": {
	  "kill_chain": [
          "osrs-sec-tool:SecTool Q thru String"
        ],
        "refs": [
          "https://github.com/urbanadventurer/urlcrazy"
        ]
      },
      "uuid": "48d7ce04-8afa-11ea-bc55-0242ac130003",
      "value": "OSRS SecTool: URLCrazy"
    },
	{
      "description": "A fast SSH mass-scanner, login cracker and banner grabber tool using the python-masscan and shodan module.",
      "meta": {
	  "kill_chain": [
          "osrs-sec-tool:SecTool Q thru String"
        ],
        "refs": [
          "https://github.com/noptrix/sshprank"
        ]
      },
      "uuid": "84c5305a-8fbe-11ea-bc55-0242ac130003",
      "value": "OSRS SecTool: sshprank"
    },
	{
      "description": "WinSCP is a free and open-source SFTP, FTP, WebDAV, Amazon S3 and SCP client for Microsoft Windows. Its main function is secure file transfer between a local and a remote computer. Beyond this, WinSCP offers basic file manager and file synchronization functionality.",
      "meta": {
	  "kill_chain": [
          "osrs-sec-tool:SecTool Q thru String"
        ],
        "refs": [
          "https://en.wikipedia.org/wiki/WinSCP",
		  "https://winscp.net/eng/index.php"
        ]
      },
      "uuid": "a8709994-9546-11ea-bb37-0242ac130002",
      "value": "OSRS SecTool: WinSCP"
    },
	{
      "description": "Rclone is a command line program to sync files and directories to and from.",
      "meta": {
	  "kill_chain": [
          "osrs-sec-tool:SecTool Q thru String"
        ],
        "refs": [
          "https://rclone.org/"
        ]
      },
      "uuid": "94b1d1d6-9ada-11ea-bb37-0242ac130002",
      "value": "OSRS SecTool: Rclone"
    },
	{
      "description": "Router Scan can find and identify various devices from a large number of known routers and, most importantly, pull out useful information from them, in particular, the characteristics of a wireless network - method of protecting an access point (encryption), access point name (SSID) and key access points (passphrase). It also receives information about the WAN connection (convenient when scanning a local network) and displays the brand and model of the router.",
      "meta": {
	  "kill_chain": [
          "osrs-sec-tool:SecTool Q thru String"
        ],
        "refs": [
          "https://github.com/axi0mX/ipwndfu"
        ]
      },
      "uuid": "3c10d9a8-a04f-11ea-bb37-0242ac130002",
      "value": "OSRS SecTool: Router Scan (StasM)"
    },
	{
      "description": "unc0ver is a jail​break, which means that you can have the freedom to do whatever you would like to do to your iOS device. Allowing you to change what you want and operate within your purview, unc0ver unlocks the true power of your iDevice.",
      "meta": {
	  "kill_chain": [
          "osrs-sec-tool:SecTool Q thru String"
        ],
        "refs": [
          "https://unc0ver.dev/"
        ]
      },
      "uuid": "3c10dba6-a04f-11ea-bb37-0242ac130002",
      "value": "OSRS SecTool: Unc0ver iOS Jailbreak Tool "
    },
	{
      "description": "Portable fuzzer.",
      "meta": {
	  "kill_chain": [
          "osrs-sec-tool:SecTool Q thru String"
        ],
        "refs": [
          "https://github.com/ollseg/usb-device-fuzzing/tree/master/USBFuzz"
        ]
      },
      "uuid": "3c10dc96-a04f-11ea-bb37-0242ac130002",
      "value": "OSRS SecTool: USBFuzz"
    },
	{
      "description": "OpenSSH is the premier connectivity tool for remote login with the SSH protocol. It encrypts all traffic to eliminate eavesdropping, connection hijacking, and other attacks. In addition, OpenSSH provides a large suite of secure tunneling capabilities, several authentication methods, and sophisticated configuration options.",
      "meta": {
	  "kill_chain": [
          "osrs-sec-tool:SecTool Q thru String"
        ],
        "refs": [
          "https://www.openssh.com/"
        ]
      },
      "uuid": "d970d308-a66a-11ea-bb37-0242ac130002",
      "value": "OSRS SecTool: OpenSSH"
    },
	{
      "description": "OpenStego is a steganography application that provides two functionalities - Data Hiding - It can hide any data within a cover file (e.g. images). Watermarking - Watermarking files (e.g. images) with an invisible signature. It can be used to detect unauthorized file copying.",
      "meta": {
	  "kill_chain": [
          "osrs-sec-tool:SecTool Q thru String"
        ],
        "refs": [
          "https://github.com/syvaidya/openstego"
        ]
      },
      "uuid": "c1153b48-ab4f-11ea-bb37-0242ac130002",
      "value": "OSRS SecTool: OpenStego"
    },
	{
      "description": "UFONet - is a free software, P2P and cryptographic -disruptive toolkit- that allows to perform DoS and DDoS attacks.",
      "meta": {
	  "kill_chain": [
          "osrs-sec-tool:SecTool Q thru String"
        ],
        "refs": [
          "https://github.com/epsylon/ufonet"
        ]
      },
      "uuid": "c1153d64-ab4f-11ea-bb37-0242ac130002",
      "value": "OSRS SecTool: UFONet"
    },
	{
      "description": "SmartAssembly is an obfuscator that helps protect your application against reverse-engineering or modification, by making it difficult for a third-party to access your source code.",
      "meta": {
	  "kill_chain": [
          "osrs-sec-tool:SecTool Q thru String"
        ],
        "refs": [
          "https://www.red-gate.com/products/dotnet-development/smartassembly/"
        ]
      },
      "uuid": "ade6eec0-b0b5-11ea-b3de-0242ac130004",
      "value": "OSRS SecTool: SmartAssembly Obfuscator"
    },
	{
      "description": "SharpExec is an offensive security C# tool designed to aid with lateral movement.",
      "meta": {
	  "kill_chain": [
          "osrs-sec-tool:SecTool Q thru String"
        ],
        "refs": [
          "https://github.com/anthemtotheego/SharpExec"
        ]
      },
      "uuid": "ade6f0be-b0b5-11ea-b3de-0242ac130004",
      "value": "OSRS SecTool: SharpExec"
    },
	{
      "description": "Search engine with scoring. Can search domain, IP, certificate, vulnerabilities, and DNS records.",
      "meta": {
	  "kill_chain": [
          "osrs-sec-tool:SecTool Q thru String"
        ],
        "refs": [
          "https://spyse.com/"
        ]
      },
      "uuid": "5870f538-b6f2-11ea-b3de-0242ac130004",
      "value": "OSRS SecTool: Spyse Cybersecurity Search Engine"
    },
	{
      "description": "Driver loader for bypassing Windows x64 Driver Signature Enforcement.",
      "meta": {
	  "kill_chain": [
          "osrs-sec-tool:SecTool Q thru String"
        ],
        "refs": [
          "https://github.com/hfiref0x/TDL"
        ]
      },
      "uuid": "5870f7fe-b6f2-11ea-b3de-0242ac130004",
      "value": "OSRS SecTool: TDL (Turla Driver Loader)"
    },
	{
      "description": "This script takes either a list of users or, if not specified, will query the domain for a list of users on every brute attempt. The users queried will have a badPwdCount attribute of two less than the LockoutThreshold to ensure they are not locked in the brute attempt, with a new list being queried for every attempt. Designed to simply input the LockoutThreshold as well as a password list and then run. Note that each DC is queried for bad password count for each user for each brute, so this script is noisy.",
      "meta": {
	  "kill_chain": [
          "osrs-sec-tool:SecTool Q thru String"
        ],
        "refs": [
          "https://gitlab.com/Kurobeats/shellntel-scripts/blob/master/Invoke-SMBAutoBrute.ps1"
        ]
      },
      "uuid": "5870f902-b6f2-11ea-b3de-0242ac130004",
      "value": "OSRS SecTool: SMBAutoBrute"
    },
	{
      "description": "SessionGopher is a PowerShell tool that finds and decrypts saved session information for remote access tools. It has WMI functionality built in so it can be run remotely. Its best use case is to identify systems that may connect to Unix systems, jump boxes, or point-of-sale terminals.",
      "meta": {
	  "kill_chain": [
          "osrs-sec-tool:SecTool Q thru String"
        ],
        "refs": [
          "https://github.com/Arvanaghi/SessionGopher"
        ]
      },
      "uuid": "5870fa6a-b6f2-11ea-b3de-0242ac130004",
      "value": "OSRS SecTool: SessionGopher"
    },
	{
      "description": "Sifter is a osint, recon & vulnerability scanner. It combines a plethara of tools within different module sets in order to quickly perform recon tasks, check network firewalling, enumerate remote and local hosts, and scan for the 'blue' vulnerabilities within microsft and if unpatched, exploit them. It uses tools like blackwidow and konan for webdir enumeration and attack surface mapping rapidly using ASM. Gathered info is saved to the results folder, these output files can be easily parsed over to TigerShark in order to be utilised within your campaign. Or compiled for a final report to wrap up a penetration test.",
      "meta": {
	  "kill_chain": [
          "osrs-sec-tool:SecTool Q thru String"
        ],
        "refs": [
          "https://github.com/s1l3nt78/sifter"
        ]
      },
      "uuid": "4a17af76-bbcb-11ea-b3de-0242ac130004",
      "value": "OSRS SecTool: Sifter"
    },
	{
      "description": "A Simple and Comprehensive Vulnerability Scanner for Containers and other Artifacts, Suitable for CI.",
      "meta": {
	  "kill_chain": [
          "osrs-sec-tool:SecTool Q thru String"
        ],
        "refs": [
          "https://github.com/aquasecurity/trivy"
        ]
      },
      "uuid": "4a17b20a-bbcb-11ea-b3de-0242ac130004",
      "value": "OSRS SecTool: Trivy"
    },
	{
      "description": "Scout Suite is an open source multi-cloud security-auditing tool, which enables security posture assessment of cloud environments. Using the APIs exposed by cloud providers, Scout Suite gathers configuration data for manual inspection and highlights risk areas. Rather than going through dozens of pages on the web consoles, Scout Suite presents a clear view of the attack surface automatically.",
      "meta": {
	  "kill_chain": [
          "osrs-sec-tool:SecTool Q thru String"
        ],
        "refs": [
          "https://github.com/nccgroup/ScoutSuite"
        ]
      },
      "uuid": "a942b26a-c1ee-11ea-b3de-0242ac130004",
      "value": "OSRS SecTool: Scout Suite"
    },
	{
      "description": "Stunnel is a proxy designed to add TLS encryption functionality to existing clients and servers without any changes in the programs' code. Its architecture is optimized for security, portability, and scalability (including load-balancing), making it suitable for large deployments. Stunnel uses the OpenSSL library for cryptography, so it supports whatever cryptographic algorithms are compiled into the library. It can benefit from the FIPS 140-2 validation of the OpenSSL FIPS Object Module, as long as the building process meets its Security Policy. A scanned FIPS 140-2 Validation Certificate document is available for download on the NIST web page. The OpenSSL FIPS 140-2 module is currently only available for OpenSSL 1.0.2. FIPS-enabled Windows installers of stunnel are available on request with our customer support plans. Stunnel is a free software authored by Michał Trojnara. Although distributed under GNU GPL version 2 or later with OpenSSL exception, stunnel is not a community project. We retain the copyright of the source code. Please contact us for commercial support or non-GPL licenses. Free, community-based support is also available via stunnel-users mailing list.",
      "meta": {
	  "kill_chain": [
          "osrs-sec-tool:SecTool Q thru String"
        ],
        "refs": [
          "https://www.stunnel.org/"
        ]
      },
      "uuid": "b02bebcc-cce9-11ea-87d0-0242ac130003",
      "value": "OSRS SecTool: stunnel"
    },
	{
      "description": "Packet crafting for Python2 and Python3.",
      "meta": {
	  "kill_chain": [
          "osrs-sec-tool:SecTool Q thru String"
        ],
        "refs": [
          "https://scapy.net/"
        ]
      },
      "uuid": "a89bede8-d33e-11ea-87d0-0242ac130003",
      "value": "OSRS SecTool: Scapy Packet Manipulation"
    },
	{
      "description": "SCShell is a fileless lateral movement tool that relies on ChangeServiceConfigA to run commands. The beauty of this tool is that it does not perform authentication against SMB. Everything is performed over DCERPC. The utility can be used remotely WITHOUT registering a service or creating a service. It also doesn't have to drop any file on the remote system (depending on the technique used to execute).",
      "meta": {
	  "kill_chain": [
          "osrs-sec-tool:SecTool Q thru String"
        ],
        "refs": [
          "https://github.com/Mr-Un1k0d3r/SCShell"
        ]
      },
      "uuid": "a89beffa-d33e-11ea-87d0-0242ac130003",
      "value": "OSRS SecTool: SCShell"
    },
	{
      "description": "SharpMove - .NET authenticated execution for remote hosts.",
      "meta": {
	  "kill_chain": [
          "osrs-sec-tool:SecTool Q thru String"
        ],
        "refs": [
          "https://github.com/0xthirteen/SharpMove"
        ]
      },
      "uuid": "a89bf5b8-d33e-11ea-87d0-0242ac130003",
      "value": "OSRS SecTool: SharpMove"
    },
	{
      "description": "Das U-Boot -- the Universal Boot Loader.",
      "meta": {
	  "kill_chain": [
          "osrs-sec-tool:SecTool Q thru String"
        ],
        "refs": [
          "https://www.denx.de/wiki/U-Boot"
        ]
      },
      "uuid": "a89bf6f8-d33e-11ea-87d0-0242ac130003",
      "value": "OSRS SecTool: U-Boot"
    },
	{
      "description": "REMnux is a Linux toolkit for reverse-engineering and analyzing malicious software. REMnux provides a curated collection of free tools created by the community. Analysts can use it to investigate malware without having to find, install, and configure the tools.",
      "meta": {
	  "kill_chain": [
          "osrs-sec-tool:SecTool Q thru String"
        ],
        "refs": [
          "https://github.com/REMnux",
		  "https://remnux.org/"
        ]
      },
      "uuid": "1d4ea026-d7f0-11ea-87d0-0242ac130003",
      "value": "OSRS SecTool: REMnux Malware Analysis Tool"
    },
	{
      "description": "Winstrument is a framework of modular scripts to aid in instrumenting Windows software using Frida for reverse engineering and attack surface analysis.",
      "meta": {
	  "kill_chain": [
          "osrs-sec-tool:SecTool Q thru String"
        ],
        "refs": [
          "https://github.com/nccgroup/winstrument"
        ]
      },
      "uuid": "1d4ea292-d7f0-11ea-87d0-0242ac130003",
      "value": "OSRS SecTool: Winstrument"
    },
	{
      "description": "SkyArk currently focuses on mitigating the new threat of Cloud Shadow Admins, and helps organizations to discover, assess and protect cloud privileged entities. Stealthy and undercover cloud admins may reside in every public cloud platform and SkyArk helps mitigating the risk in AWS and Azure.",
      "meta": {
	  "kill_chain": [
          "osrs-sec-tool:SecTool Q thru String"
        ],
        "refs": [
          "https://github.com/cyberark/SkyArk"
        ]
      },
      "uuid": "1d4ea418-d7f0-11ea-87d0-0242ac130003",
      "value": "OSRS SecTool: SkyArk (Cloud Account Auditing Tool)"
    },
	{
      "description": "Tracee is a lightweight and easy to use container and system tracing tool. It allows you to observe system calls and other system events in real time. A unique feature of Tracee is that it will only trace newly created processes and containers (that were started after Tracee has started), in order to help the user focus on relevant events instead of every single thing that happens on the system (which can be overwhelming). Adding new events to Tracee (especially system calls) is straightforward, and will usually require no more than adding few lines of code.",
      "meta": {
	  "kill_chain": [
          "osrs-sec-tool:SecTool Q thru String"
        ],
        "refs": [
          "https://github.com/aquasecurity/tracee"
        ]
      },
      "uuid": "70acb324-e2e6-11ea-87d0-0242ac130003",
      "value": "OSRS SecTool: Tracee"
    },
	{
      "description": "A suite of open source security tools that includes but is not limited to tools like AtomicBird, DesertNut, and Londor.",
      "meta": {
	  "kill_chain": [
          "osrs-sec-tool:SecTool Q thru String"
        ],
        "refs": [
          "https://github.com/FuzzySecurity/Sharp-Suite"
        ]
      },
      "uuid": "a33194de-f373-11ea-adc1-0242ac120002",
      "value": "OSRS SecTool: Sharp-Suite"
    },
	{
      "description": "Weave Scope automatically detects processes, containers, hosts. No kernel modules, no agents, no special libraries, no coding. Seamless integration with Docker, Kubernetes, DCOS and AWS ECS.",
      "meta": {
	  "kill_chain": [
          "osrs-sec-tool:SecTool Q thru String"
        ],
        "refs": [
          "https://www.weave.works/oss/scope/"
        ]
      },
      "uuid": "1ed70192-f82d-11ea-adc1-0242ac120002",
      "value": "OSRS SecTool: Weave Scope"
    },
	{
      "description": "This package is constructed for testing the clustering patterns of structure and attribute among a social network through the scan statistics. Most contents are related to the references mentioned below. Some data sets are presented to be examples in this package as well.",
      "meta": {
	  "kill_chain": [
          "osrs-sec-tool:SecTool Q thru String"
        ],
        "refs": [
          "https://github.com/TunChiehHsu/SNscan"
        ]
      },
      "uuid": "7f1903a4-08a7-11eb-adc1-0242ac120002",
      "value": "OSRS SecTool: SNScan"
    },
	{
      "description": "WinRAR is a trialware file archiver utility for Windows, developed by Eugene Roshal of win.rar GmbH. It can create and view archives in RAR or ZIP file formats, and unpack numerous archive file formats.",
      "meta": {
	  "kill_chain": [
          "osrs-sec-tool:SecTool Q thru String"
        ],
        "refs": [
          "https://en.wikipedia.org/wiki/WinRAR"
        ]
      },
      "uuid": "7f1905b6-08a7-11eb-adc1-0242ac120002",
      "value": "OSRS SecTool: WinRAR"
    },
	{
      "description": "As indicated by sources like vulndb & cve, on a daily basis, approximately 50 new vulnerabilities become known to industry and it’s safe to assume that count is going to increase furthermore. It’s a huge number of vulnerabilities to assess and remediate effectively and quickly. So today organizations are focusing (or should focus) on reducing the risk rather than eliminating it and vulnerability management is (almost) equal to risk prioritisation and risk is a variable and dynamic concept determined by multiple factors. Theoretically, the approach of considering factors like base CVSS, asset accessibility, criticality, exploit availability, business sensitivity etc. looks appropriate to adopt but it’s not practically possible to do it manually for every vulnerability affecting every asset by every organisation.",
      "meta": {
	  "kill_chain": [
          "osrs-sec-tool:SecTool Q thru String"
        ],
        "refs": [
          "https://github.com/varchashva/vPrioritizer"
        ]
      },
      "uuid": "7f1906b0-08a7-11eb-adc1-0242ac120002",
      "value": "OSRS SecTool: vPrioritizer"
    },
	{
      "description": "Open-source, multi-cloud auditing tool.",
      "meta": {
	  "kill_chain": [
          "osrs-sec-tool:SecTool Q thru String"
        ],
        "refs": [
          "https://github.com/nccgroup/ScoutSuite/releases/tag/5.10",
		  "https://research.nccgroup.com/2020/10/01/tool-release-scoutsuite-5-10/"
        ]
      },
      "uuid": "7f190782-08a7-11eb-adc1-0242ac120002",
      "value": "OSRS SecTool: ScoutSuite"
    },
	{
      "description": "A Simple Ransomware Protection.",
      "meta": {
	  "kill_chain": [
          "osrs-sec-tool:SecTool Q thru String"
        ],
        "refs": [
          "https://github.com/Neo23x0/Raccine"
        ]
      },
      "uuid": "7f19084a-08a7-11eb-adc1-0242ac120002",
      "value": "OSRS SecTool: Raccine"
    },
	{
      "description": "A Banner Grabber, in Go.",
      "meta": {
	  "kill_chain": [
          "osrs-sec-tool:SecTool Q thru String"
        ],
        "refs": [
          "https://github.com/zmap/zgrab"
        ]
      },
      "uuid": "7f190908-08a7-11eb-adc1-0242ac120002",
      "value": "OSRS SecTool: zgrab"
    },
	{
      "description": "Raptor is a Web application firewall made in C, uses DFA to block SQL injection, Cross site scripting and path traversal.",
      "meta": {
	  "kill_chain": [
          "osrs-sec-tool:SecTool Q thru String"
        ],
        "refs": [
          "https://github.com/CoolerVoid/raptor_waf"
        ]
      },
      "uuid": "63294294-147d-11eb-adc1-0242ac120002",
      "value": "OSRS SecTool: Raptor WAF"
    },
	{
      "description": "A Python based scanner to find potential SSRF parameters in a web application.",
      "meta": {
	  "kill_chain": [
          "osrs-sec-tool:SecTool Q thru String"
        ],
        "refs": [
          "https://github.com/In3tinct/See-SURF"
        ]
      },
      "uuid": "632944ba-147d-11eb-adc1-0242ac120002",
      "value": "OSRS SecTool: See-SURF"
    },
	{
      "description": "Takeover AWS ips and have a working POC for Subdomain Takeover.",
      "meta": {
	  "kill_chain": [
          "osrs-sec-tool:SecTool Q thru String"
        ],
        "refs": [
          "https://github.com/In3tinct/Taken"
        ]
      },
      "uuid": "632945b4-147d-11eb-adc1-0242ac120002",
      "value": "OSRS SecTool: Taken"
    },
	{
      "description": "Rubeus is a C# toolset for raw Kerberos interaction and abuses. It is heavily adapted from Benjamin Delpy's Kekeo project (CC BY-NC-SA 4.0 license) and Vincent LE TOUX's MakeMeEnterpriseAdmin project (GPL v3.0 license). Full credit goes to Benjamin and Vincent for working out the hard components of weaponization- without their prior work this project would not exist. Charlie Clark and Ceri Coburn have both made significant contributions to the Rubeus codebase. Elad Shamir contributed some essential work for resource-based constrained delegation. Their work is very appreciated! Rubeus also uses a C# ASN.1 parsing/encoding library from Thomas Pornin named DDer that was released with an MIT-like license. Huge thanks to Thomas for his clean and stable code! PKINIT code heavily adapted from @SteveSyfuhs's Bruce tool. Bruce made RFC4556 (PKINIT) a lot easier to understand. Huge thanks to Steve! The KerberosRequestorSecurityToken.GetRequest method for Kerberoasting was contributed to PowerView (and then incorporated into Rubeus) by @machosec. @harmj0y is the primary author of this code base. Rubeus is licensed under the BSD 3-Clause license.",
      "meta": {
	  "kill_chain": [
          "osrs-sec-tool:SecTool Q thru String"
        ],
        "refs": [
          "https://github.com/GhostPack/Rubeus"
        ]
      },
      "uuid": "65b8a5f6-2443-11eb-adc1-0242ac120002",
      "value": "OSRS SecTool: Rubeus"
    },
	{
      "description": "Seatbelt is a C# project that performs a number of security oriented host-survey safety checks relevant from both offensive and defensive security perspectives.",
      "meta": {
	  "kill_chain": [
          "osrs-sec-tool:SecTool Q thru String"
        ],
        "refs": [
          "https://github.com/GhostPack/Seatbelt"
        ]
      },
      "uuid": "26a078d8-3f94-11ea-b77f-2e728ce88125",
      "value": "OSRS SecTool: SeatBelt"
    }
	  ],
	"version": 27
}
