{
  "category": "SEC-TOOL-A-THRU-P",
  "description": "Cluster designed for tagging OSINT artifacts that relate to various tools used by cybersecurity personnel for various purposes.",
  "name": "OSRS Security Tool Index - SecTool A thru P",
  "source": "OSRS DEV",
  "type": "CMCF-BLOCK-OSRS",
  "uuid": "deb05256-49bf-11ea-b77f-2e728ce88125",
  "values": [
	{
      "description": ".NET Reactor is a powerful code protection and software licensing system for software written for the .NET Framework, and supports all languages that generate .NET assemblies.",
      "meta": {
	  "kill_chain": [
          "osrs-sec-tool:SecTool A thru P"
        ],
        "refs": [
          "https://www.eziriz.com/dotnet_reactor.htm"
        ]
      },
      "uuid": "69d02cfa-2826-11ea-978f-2e728ce88125",
      "value": "OSRS SecTool: .NET Reactor"
    },
	{
      "description": "ARDvark parses the Apple Remote Desktop (ARD) database file, and associated cache files to pull out application usage, user activity, and filesystem listing The ARD database contains information about all systems within an ARD deployment in an enterprise.",
      "meta": {
	  "kill_chain": [
          "osrs-sec-tool:SecTool A thru P"
        ],
        "refs": [
          "https://github.com/fireeye/ARDvark"
        ]
      },
      "uuid": "6d474ea2-3f7a-11ea-b77f-2e728ce88125",
      "value": "OSRS SecTool: ARDvark (Forensics)"
    },
	{
      "description": "A not so very intelligent fuzzer. ",
      "meta": {
	  "kill_chain": [
          "osrs-sec-tool:SecTool A thru P"
        ],
        "refs": [
          "https://github.com/oxagast/ansvif"
        ]
      },
      "uuid": "6d475172-3f7a-11ea-b77f-2e728ce88125",
      "value": "OSRS SecTool: Ansvif"
    },
	{
      "description": "Apple Inc. RDP application for connecting to iOS devices remotely.",
      "meta": {
	  "kill_chain": [
          "osrs-sec-tool:SecTool A thru P"
        ],
        "refs": [
          "https://support.apple.com/remote-desktop"
        ]
      },
      "uuid": "6d4752c6-3f7a-11ea-b77f-2e728ce88125",
      "value": "OSRS SecTool: Apple Remote Desktop (ARD) - RDP Tool"
    },
	{
      "description": "Bing-ip2hosts is a Bing.com web scraper to discover hostnames by IP address.",
      "meta": {
	  "kill_chain": [
          "osrs-sec-tool:SecTool A thru P"
        ],
        "refs": [
          "https://github.com/urbanadventurer/bing-ip2hosts"
        ]
      },
      "uuid": "6d4753fc-3f7a-11ea-b77f-2e728ce88125",
      "value": "OSRS SecTool: Bing-ip2hosts"
    },
	{
      "description": "BlackArch Linux is an Arch Linux-based penetration testing distribution for penetration testers and security researchers. The repository contains 2325 tools. You can install tools individually or in groups. BlackArch Linux is compatible with existing Arch installs.",
      "meta": {
	  "kill_chain": [
          "osrs-sec-tool:SecTool A thru P"
        ],
        "refs": [
          "https://www.blackarch.org"
        ]
      },
      "uuid": "6d475744-3f7a-11ea-b77f-2e728ce88125",
      "value": "OSRS SecTool: BlackArch Linux"
    },
	{
      "description": "DNS Analysis Tool.",
      "meta": {
	  "kill_chain": [
          "osrs-sec-tool:SecTool A thru P"
        ],
        "refs": [
          "https://n0where.net/dns-analysis-tool-bluto",
		  "https://github.com/darryllane/Bluto"
        ]
      },
      "uuid": "6d47587a-3f7a-11ea-b77f-2e728ce88125",
      "value": "OSRS SecTool: Bluto"
    },
	{
      "description": "CERTrating is a tool for assessing the Maturity Level of CERTs and their services.",
      "meta": {
	  "kill_chain": [
          "osrs-sec-tool:SecTool A thru P"
        ],
        "refs": [
          "https://certrating.it/"
        ]
      },
      "uuid": "6d47599c-3f7a-11ea-b77f-2e728ce88125",
      "value": "OSRS SecTool: CERTrating"
    },
	{
      "description": "Cyber threat hunting guide that can be used for academic purposes or to improve current cyber threat hunting operations.",
      "meta": {
	  "kill_chain": [
          "osrs-sec-tool:SecTool A thru P"
        ],
        "refs": [
          "https://www.slideshare.net/HuyKha2/cthow-v20-cyber-threat-hunting-on-windows?from_action=save"
        ]
      },
      "uuid": "6d475b5e-3f7a-11ea-b77f-2e728ce88125",
      "value": "OSRS SecTool: CTHoW v2.0 - Cyber Threat Hunting on Windows"
    },
	{
      "description": "A tool for taking Raw SS Tables (not snappy compressed) and obfuscating text fields. Works for Cassandra 2.1 SS tables. I will add support for other versions if requested.",
      "meta": {
	  "kill_chain": [
          "osrs-sec-tool:SecTool A thru P"
        ],
        "refs": [
          "https://github.com/chbatey/cassandra-sstable-obfuscator"
        ],
        "synonyms": [
        "SSTable Obfuscator"
        ]
      },
      "uuid": "6d475ca8-3f7a-11ea-b77f-2e728ce88125",
      "value": "OSRS SecTool: Cassandra (CyaX)"
    },
	{
      "description": "Certutil.exe is a command-line program that is installed as part of Certificate Services. You can use Certutil.exe to dump and display certification authority (CA) configuration information, configure Certificate Services, backup and restore CA components, and verify certificates, key pairs, and certificate chains.",
      "meta": {
	  "kill_chain": [
          "osrs-sec-tool:SecTool A thru P"
        ],
        "refs": [
          "https://docs.microsoft.com/en-us/windows-server/administration/windows-commands/certutil"
        ]
      },
      "uuid": "6d475dca-3f7a-11ea-b77f-2e728ce88125",
      "value": "OSRS SecTool: Certutil.exe (certutil)"
    },
	{
      "description": "Babel Obfuscator is a powerful protection tool for the Microsoft .NET Framework. Programs written in .NET languages, like C# and Visual Basic .NET, are normally easy to reverse engineer because they compile to MSIL (Microsoft Intermediate Language), a CPU-independent instruction set that is embedded into .NET assemblies, along with metadata allowing the reconstruction of original source code. Babel Obfuscator is able to transform assemblies in order to conceal the code, so that reversing is extremely difficult. This transformation process is called obfuscation.",
      "meta": {
	  "kill_chain": [
          "osrs-sec-tool:SecTool A thru P"
        ],
        "refs": [
          "http://www.babelfor.net/products#Obfuscator"
        ]
      },
      "uuid": "bedd21b4-42c3-11ea-b77f-2e728ce88125",
      "value": "OSRS SecTool: babelfor.NET Obfuscator"
    },
	{
      "description": "Decompile binary MOF file (BMF) from WMI buffer.",
      "meta": {
	  "kill_chain": [
          "osrs-sec-tool:SecTool A thru P"
        ],
        "refs": [
          "https://github.com/pali/bmfdec"
        ]
      },
      "uuid": "bedd2466-42c3-11ea-b77f-2e728ce88125",
      "value": "OSRS SecTool: bmfdec"
    },
	{
      "description": "checkra1n is a community project to provide a high-quality semi-tethered jailbreak to all, based on the checkm8 bootrom exploit.",
      "meta": {
	  "kill_chain": [
          "osrs-sec-tool:SecTool A thru P"
        ],
        "refs": [
          "https://checkra.in/"
        ]
      },
      "uuid": "bedd25ba-42c3-11ea-b77f-2e728ce88125",
      "value": "OSRS SecTool: checkra1n"
    },
	{
      "description": "Clam AntiVirus (ClamAV) is a free software, cross-platform and open-source antivirus software toolkit able to detect many types of malicious software, including viruses. One of its main uses is on mail servers as a server-side email virus scanner. The application was developed for Unix and has third party versions available for AIX, BSD, HP-UX, Linux, macOS, OpenVMS, OSF (Tru64) and Solaris. As of version 0.97.5, ClamAV builds and runs on Microsoft Windows. Both ClamAV and its updates are made available free of charge.",
      "meta": {
	  "kill_chain": [
          "osrs-sec-tool:SecTool A thru P"
        ],
        "refs": [
          "https://en.wikipedia.org/wiki/Clam_AntiVirus",
		  "https://packetstormsecurity.com/files/154185/clamav-0.101.4.tar.gz"
        ]
      },
      "uuid": "bedd26fa-42c3-11ea-b77f-2e728ce88125",
      "value": "OSRS SecTool: Clam AntiVirus"
    },
	{
      "description": "With CodeVeil you can encrypt your .NET applications and DLLs. CodeVeil adds native code to the assembly to decrypt the assembly just before the .NET runtime needs access to the data. The decoder includes anti-debugging, anti-tracing, modification tracking, and various other advanced techniques to prevent unauthorized access and modification of your assemblies. And, veiled assemblies can be used just like any other assembly. No third party dll is required with your distribution.",
      "meta": {
	  "kill_chain": [
          "osrs-sec-tool:SecTool A thru P"
        ],
        "refs": [
          "https://download.cnet.com/CodeVeil/3000-10250_4-10729770.html"
        ]
      },
      "uuid": "bedd2c40-42c3-11ea-b77f-2e728ce88125",
      "value": "OSRS SecTool: CodeVeil"
    },
	{
      "description": "ConfuserEx is an free, open-source protector for .NET applications. It is the successor of Confuser project.",
      "meta": {
	  "kill_chain": [
          "osrs-sec-tool:SecTool A thru P"
        ],
        "refs": [
          "https://yck1509.github.io/ConfuserEx/"
        ]
      },
      "uuid": "bedd2da8-42c3-11ea-b77f-2e728ce88125",
      "value": "OSRS SecTool: ConfuserEx"
    },
	{
      "description": "Easily integrate Content-Security-Policy headers into your web application, either from a JSON configuration file, or programatically. CSP Builder was created by Paragon Initiative Enterprises as part of our effort to encourage better application security practices.",
      "meta": {
	  "kill_chain": [
          "osrs-sec-tool:SecTool A thru P"
        ],
        "refs": [
          "https://github.com/paragonie/csp-builder"
        ]
      },
      "uuid": "bedd2ee8-42c3-11ea-b77f-2e728ce88125",
      "value": "OSRS SecTool: Content Security Policy Builder (CSPB)"
    },
	{
      "description": "Python 3 REST API & JS GUI for managing hashcat crack jobs in a queuing system.",
      "meta": {
	  "kill_chain": [
          "osrs-sec-tool:SecTool A thru P"
        ],
        "refs": [
          "https://github.com/f0cker/crackq"
        ]
      },
      "uuid": "bedd300a-42c3-11ea-b77f-2e728ce88125",
      "value": "OSRS SecTool: CrackQ"
    },
	{
      "description": "CyberChef is a simple, intuitive web app for carrying out all manner of cyber operations within a web browser. These operations include simple encoding like XOR or Base64, more complex encryption like AES, DES and Blowfish, creating binary and hexdumps, compression and decompression of data, calculating hashes and checksums, IPv6 and X.509 parsing, changing character encodings, and much more. The tool is designed to enable both technical and non-technical analysts to manipulate data in complex ways without having to deal with complex tools or algorithms. It was conceived, designed, built and incrementally improved by an analyst in their 10% innovation time over several years.",
      "meta": {
	  "kill_chain": [
          "osrs-sec-tool:SecTool A thru P"
        ],
        "refs": [
          "https://gchq.github.io/CyberChef/",
		  "https://github.com/gchq/CyberChef"
        ]
      },
      "uuid": "bedd3334-42c3-11ea-b77f-2e728ce88125",
      "value": "OSRS SecTool: CyberChef"
    },
	{
      "description": "Small plugin to detect mobile browser.",
      "meta": {
	  "kill_chain": [
          "osrs-sec-tool:SecTool A thru P"
        ],
        "refs": [
          "https://github.com/smali-kazmi/detect-mobile-browser"
        ]
      },
      "uuid": "bedd347e-42c3-11ea-b77f-2e728ce88125",
      "value": "OSRS SecTool: Detect Mobile Browser"
    },
	{
      "description": "This CLI framework is based on sploitkit and is an attempt to gather hacking techniques and exploits especially focused on drone hacking. For the ease of use, the interface has a layout that looks like Metasploit.",
      "meta": {
	  "kill_chain": [
          "osrs-sec-tool:SecTool A thru P"
        ],
        "refs": [
          "https://github.com/dhondta/dronesploit"
        ]
      },
      "uuid": "ef866e2e-42c3-11ea-b77f-2e728ce88125",
      "value": "OSRS SecTool: DroneSploit"
    },
	{
      "description": "Shellcode runner for all application whitelisting bypasses.",
      "meta": {
	  "kill_chain": [
          "osrs-sec-tool:SecTool A thru P"
        ],
        "refs": [
          "https://github.com/fireeye/DueDLLigence"
        ]
      },
      "uuid": "ef8672fc-42c3-11ea-b77f-2e728ce88125",
      "value": "OSRS SecTool: DueDLLigence"
    },
	{
      "description": "RawDisk is a legitimate commercial driver from the EldoS Corporation that is used for interacting with files, disks, and partitions. The driver allows for direct modification of data on a local computer's hard drive. In some cases, the tool can enact these raw disk modifications from user-mode processes, circumventing Windows operating system security features.",
      "meta": {
	  "kill_chain": [
          "osrs-sec-tool:SecTool A thru P"
        ],
        "refs": [
          "https://attack.mitre.org/software/S0364/"
        ]
      },
      "uuid": "ef867464-42c3-11ea-b77f-2e728ce88125",
      "value": "OSRS SecTool: EldoS RawDisk"
    },
	{
      "description": "Version 1.0.0. This tool is a PoC to demonstrate the ability of an attacker to perform an SMB or HTTP based NTLM relay attack to the EWS endpoint on an on-premise Microsoft Exchange server to compromise the mailbox of the victim. This tool provides the attacker with an OWA looking interface, with access to the user mailbox and contacts.",
      "meta": {
	  "kill_chain": [
          "osrs-sec-tool:SecTool A thru P"
        ],
        "refs": [
          "https://github.com/quickbreach/ExchangeRelayX"
        ]
      },
      "uuid": "ef8675a4-42c3-11ea-b77f-2e728ce88125",
      "value": "OSRS SecTool: ExchangeRelayX"
    },
	{
      "description": "This is a set of utilities wrapping the decompiler API into something sane. This code focus on vulnerability research and bug hunting, however most of the functionality is generic enough to be used for broader reverse engineering purposes.",
      "meta": {
	  "kill_chain": [
          "osrs-sec-tool:SecTool A thru P"
        ],
        "refs": [
          "https://github.com/fireeye/FIDL"
        ]
      },
      "uuid": "ef8676d0-42c3-11ea-b77f-2e728ce88125",
      "value": "OSRS SecTool: FLARE IDA Decompiler Library (FIDL)"
    },
	{
      "description": "Falco is a behavioral activity monitor designed to detect anomalous activity in your applications. Powered by sysdig’s system call capture infrastructure, Falco lets you continuously monitor and detect container, application, host, and network activity—all in one place—from one source of data, with one set of rules. Falco is hosted by the Cloud Native Computing Foundation (CNCF) as a sandbox level project. If you are an organization that wants to help shape the evolution of technologies that are container-packaged, dynamically-scheduled and microservices-oriented, consider joining the CNCF. For details read the Falco CNCF project proposal.",
      "meta": {
	  "kill_chain": [
          "osrs-sec-tool:SecTool A thru P"
        ],
        "refs": [
          "https://github.com/falcosecurity/falco"
        ]
      },
      "uuid": "ef867806-42c3-11ea-b77f-2e728ce88125",
      "value": "OSRS SecTool: Falco"
    },
	{
      "description": "Faraday introduces a new concept - IPE (Integrated Penetration-Test Environment) a multiuser Penetration test IDE. Designed for distributing, indexing, and analyzing the data generated during a security audit. Faraday was made to let you take advantage of the available tools in the community in a truly multiuser way. Designed for simplicity, users should notice no difference between their own terminal application and the one included in Faraday. Developed with a specialized set of functionalities, users improve their own work. Do you remember the last time you programmed without an IDE? What IDEs are to programming, Faraday is to pentesting.",
      "meta": {
	  "kill_chain": [
          "osrs-sec-tool:SecTool A thru P"
        ],
        "refs": [
          "https://github.com/infobyte/faraday"
        ]
      },
      "uuid": "ef867bc6-42c3-11ea-b77f-2e728ce88125",
      "value": "OSRS SecTool: Faraday"
    },
	{
      "description": "Redline, FireEye premier free endpoint security tool, provides host investigative capabilities to users to find signs of malicious activity through memory and file analysis and the development of a threat assessment profile. Use Redline to collect, analyze and filter endpoint data and perform IOC analysis and hit review. In addition, users of FireEye Endpoint Security (HX) can open triage collections directly in Redline for in-depth analysis, allowing the user to establish the timeline and scope of an incident.",
      "meta": {
	  "kill_chain": [
          "osrs-sec-tool:SecTool A thru P"
        ],
        "refs": [
          "https://fireeye.market/apps/211364"
        ]
      },
      "uuid": "ef867d06-42c3-11ea-b77f-2e728ce88125",
      "value": "OSRS SecTool: FireEye Redline"
    },
	{
      "description": "Foxit Software, Inc. develops Portable Document Format software and tools used to create, edit, sign, and secure files and digital documents. It is a software company headquartered in Fremont, California, with offices in Berlin, Beijing, Fuzhou, South Yarra, Australia and other locations.",
      "meta": {
	  "kill_chain": [
          "osrs-sec-tool:SecTool A thru P"
        ],
        "refs": [
          "https://www.foxitsoftware.com"
        ]
      },
      "uuid": "ef867e32-42c3-11ea-b77f-2e728ce88125",
      "value": "OSRS SecTool: Foxit"
    },
	{
      "description": "FreeRDP is a free implementation of the Remote Desktop Protocol (RDP), released under the Apache license. Enjoy the freedom of using your software wherever you want, the way you want it, in a world where interoperability can finally liberate your computing experience.",
      "meta": {
	  "kill_chain": [
          "osrs-sec-tool:SecTool A thru P"
        ],
        "refs": [
          "https://github.com/FreeRDP/FreeRDP",
		  "https://www.freerdp.com/",
		  "https://github.com/FreeRDP/FreeRDP/issues",
		  "https://pub.freerdp.com/releases/",
		  "https://pub.freerdp.com/api/"
        ]
      },
      "uuid": "ef867fea-42c3-11ea-b77f-2e728ce88125",
      "value": "OSRS SecTool: FreeRDP"
    },
	{
      "description": "GnuPG is a complete and free implementation of the OpenPGP standard as defined by RFC4880 (also known as PGP). GnuPG allows you to encrypt and sign your data and communications; it features a versatile key management system, along with access modules for all kinds of public key directories. GnuPG, also known as GPG, is a command line tool with features for easy integration with other applications. A wealth of frontend applications and libraries are available. GnuPG also provides support for S MIME and Secure Shell (ssh). Since its introduction in 1997, GnuPG is Free Software (meaning that it respects your freedom). It can be freely used, modified and distributed under the terms of the GNU General Public License.",
      "meta": {
	  "kill_chain": [
          "osrs-sec-tool:SecTool A thru P"
        ],
        "refs": [
          "https://gnupg.org/"
        ]
      },
      "uuid": "24a99446-42c4-11ea-b77f-2e728ce88125",
      "value": "OSRS SecTool: GNU Privacy Guard"
    },
	{
      "description": "GRR Rapid Response is an incident response framework focused on remote live forensics. GRR is a python client (agent) that is installed on target systems, and python server infrastructure that can manage and talk to clients.",
      "meta": {
	  "kill_chain": [
          "osrs-sec-tool:SecTool A thru P"
        ],
        "refs": [
          "https://github.com/google/grr"
        ]
      },
      "uuid": "24a996f8-42c4-11ea-b77f-2e728ce88125",
      "value": "OSRS SecTool: GRR Rapid Response"
    },
	{
      "description": "Open source time provider.",
      "meta": {
	  "kill_chain": [
          "osrs-sec-tool:SecTool A thru P"
        ],
        "refs": [
          "https://github.com/scottlundgren/w32time"
        ]
      },
      "uuid": "24a99842-42c4-11ea-b77f-2e728ce88125",
      "value": "OSRS SecTool: GameTime"
    },
	{
      "description": "Gephi is an interactive visualization and exploration platform for all kinds of networks and complex systems, dynamic and hierarchical graphs. Gephi is a tool for people that have to explore and understand graphs. Like Photoshop but for graphs, the user interacts with the representation, manipulate the structures, shapes and colors to reveal hidden properties. The goal is to help data analysts to make hypothesis, intuitively discover patterns, isolate structure singularities or faults during data sourcing. It is a complementary tool to traditional statistics, as visual thinking with interactive interfaces is now recognized to facilitate reasoning. This is a software for Exploratory Data Analysis, a paradigm appeared in the Visual Analytics field of research.",
      "meta": {
	  "kill_chain": [
          "osrs-sec-tool:SecTool A thru P"
        ],
        "refs": [
          "https://gephi.org",
		  "https://github.com/gephi/gephi/wiki"
        ]
      },
      "uuid": "24a999f0-42c4-11ea-b77f-2e728ce88125",
      "value": "OSRS SecTool: Gephi"
    },
	{
      "description": "GhIDA is an IDA Pro plugin that integrates the Ghidra decompiler in IDA.",
      "meta": {
	  "kill_chain": [
          "osrs-sec-tool:SecTool A thru P"
        ],
        "refs": [
          "https://github.com/Cisco-Talos/GhIDA"
        ]
      },
      "uuid": "24a99e46-42c4-11ea-b77f-2e728ce88125",
      "value": "OSRS SecTool: GhIDA"
    },
	{
      "description": "THE MAIN CHARACTERISTICS OF Goliath .NET Obfuscator. 100 percent VB.NET & CLSCompliant. Support FW 1.x & 2.0. Support Compilers: C#, VB.NET, Delphi.NET. GUI Wizard Style. Manual Parsing of .NET Assembly. New Renaming Printable or Unprintable Chars. Choose Symbols Overloads. Choose Obfuscation Renaming or Polymorphic. Automatic Renaming Class Resources. Choose Renaming Namespaces. Choose Encryption Code for Strings Static or Polymorphic. Choose Encryption Text by Selection Table. Signing .NET Assembly with a Strong Name. Automatic Support Multi-Language.",
      "meta": {
	  "kill_chain": [
          "osrs-sec-tool:SecTool A thru P"
        ],
        "refs": [
          "https://goliath-net-obfuscator.apponic.com"
        ]
      },
      "uuid": "24a99f90-42c4-11ea-b77f-2e728ce88125",
      "value": "OSRS SecTool: Goliath.NET Obfuscator"
    },
	{
      "description": "HTTrack is a free (GPL, libre free software) and easy-to-use offline browser utility. It allows you to download a World Wide Web site from the Internet to a local directory, building recursively all directories, getting HTML, images, and other files from the server to your computer. HTTrack arranges the original site's relative link-structure. Simply open a page of the mirrored website in your browser, and you can browse the site from link to link, as if you were viewing it online. HTTrack can also update an existing mirrored site, and resume interrupted downloads. HTTrack is fully configurable, and has an integrated help system.",
      "meta": {
	  "kill_chain": [
          "osrs-sec-tool:SecTool A thru P"
        ],
        "refs": [
          "https://www.httrack.com/"
        ]
      },
      "uuid": "24a9a0c6-42c4-11ea-b77f-2e728ce88125",
      "value": "OSRS SecTool: HTTrack Website Copier"
    },
	{
      "description": "Hashcat is the world's fastest and most advanced password recovery utility, supporting five unique modes of attack for over 200 highly-optimized hashing algorithms. hashcat currently supports CPUs, GPUs, and other hardware accelerators on Linux, Windows, and macOS, and has facilities to help enable distributed password cracking.",
      "meta": {
	  "kill_chain": [
          "osrs-sec-tool:SecTool A thru P"
        ],
        "refs": [
          "https://github.com/hashcat/hashcat"
        ]
      },
      "uuid": "24a9a21a-42c4-11ea-b77f-2e728ce88125",
      "value": "OSRS SecTool: HashCat"
    },
	{
      "description": "Haveged is a daemon that feeds the /dev/random pool on Linux using an adaptation of the HArdware Volatile Entropy Gathering and Expansion algorithm invented at IRISA. The algorithm is self-tuning on machines with cpuid support, and has been tested in both 32-bit and 64-bit environments. The tarball uses the GNU build mechanism, and includes self test targets and a spec file for those who want to build an RPM.",
      "meta": {
	  "kill_chain": [
          "osrs-sec-tool:SecTool A thru P"
        ],
        "refs": [
          "https://wiki.archlinux.org/index.php/Haveged",
		  "https://packetstormsecurity.com/files/154166/haveged-1.9.5-alpha.tar.gz"
        ]
      },
      "uuid": "24a9a346-42c4-11ea-b77f-2e728ce88125",
      "value": "OSRS SecTool: Haveged"
    },
	{
      "description": "I2P is an anonymous network built on top of the internet. It allows netizens to create and access content and build online communities on a network that is both distributed and dynamic. It is intended to protect communication and resist monitoring by third parties such as ISPs.",
      "meta": {
	  "kill_chain": [
          "osrs-sec-tool:SecTool A thru P"
        ],
        "refs": [
          "https://geti2p.net/en/",
		  "https://packetstormsecurity.com/files/154241/i2psource_0.9.42.tar.bz2"
        ]
      },
      "uuid": "24a9a558-42c4-11ea-b77f-2e728ce88125",
      "value": "OSRS SecTool: I2P"
    },
	{
      "description": "The Interactive Disassembler is a disassembler for computer software which generates assembly language source code from machine-executable code. It supports a variety of executable formats for different processors and operating systems.",
      "meta": {
	  "kill_chain": [
          "osrs-sec-tool:SecTool A thru P"
        ],
        "refs": [
          "https://www.hex-rays.com/products/ida/"
        ],
        "synonyms": [
        "Interactive Disassembler"
        ]
      },
      "uuid": "0aea25da-42c8-11ea-b77f-2e728ce88125",
      "value": "OSRS SecTool: IDA Pro"
    },
	{
      "description": "Impacket is a collection of Python classes for working with network protocols. Impacket is focused on providing low-level programmatic access to the packets and for some protocols (e.g. SMB1-3 and MSRPC) the protocol implementation itself. Packets can be constructed from scratch, as well as parsed from raw data, and the object oriented API makes it simple to work with deep hierarchies of protocols. The library provides a set of tools as examples of what can be done within the context of this library.",
      "meta": {
	  "kill_chain": [
          "osrs-sec-tool:SecTool A thru P"
        ],
        "refs": [
          "https://en.wikipedia.org/wiki/Penetration_test"
        ]
      },
      "uuid": "0aea2846-42c8-11ea-b77f-2e728ce88125",
      "value": "OSRS SecTool: Impacket"
    },
	{
      "description": "Invoke-ACLpwn is a tool that automates the discovery and pwnage of ACLs in Active Directory that are unsafe configured. Invoke-ACLpwn is designed to run with integrated credentials as well as with specified network credentials. The script works by creating an export of all ACLs in the domain with SharpHound as well as the group membership of the user account that the tool is running under. If the user does not already have writeDACL permissions on the domain object, the tool will enumerate all ACEs of the ACL of the domain. Every identity in an ACE has an ACL of its own, which is added to the enumeration queue. If the identity is a group and the group has members, every group member is added to the enumeration queue as well.",
      "meta": {
	  "kill_chain": [
          "osrs-sec-tool:SecTool A thru P"
        ],
        "refs": [
          "https://github.com/fox-it/Invoke-ACLPwn"
        ]
      },
      "uuid": "0aea299a-42c8-11ea-b77f-2e728ce88125",
      "value": "OSRS SecTool: Invoke-ACLpwn"
    },
	{
      "description": "Kali Linux is an Advanced Penetration Testing Linux distribution used for Penetration Testing, Ethical Hacking and network security assessments.",
      "meta": {
	  "kill_chain": [
          "osrs-sec-tool:SecTool A thru P"
        ],
        "refs": [
          "https://www.kali.org/"
        ]
      },
      "uuid": "0aea2e2c-42c8-11ea-b77f-2e728ce88125",
      "value": "OSRS SecTool: Kali Linux"
    },
	{
      "description": "Build interactive map of cameras, printers, tweets and photos. The script creates a map of cameras, printers, tweets and photos based on your coordinates. Everything is clearly presented in form of interactive map with icons and popups.",
      "meta": {
	  "kill_chain": [
          "osrs-sec-tool:SecTool A thru P"
        ],
        "refs": [
          "https://github.com/woj-ciech/kamerka"
        ],
        "synonyms": [
        "FIST (Flickr, Instagram, Shodan, Twitter)"
        ]
      },
      "uuid": "0aea2f76-42c8-11ea-b77f-2e728ce88125",
      "value": "OSRS SecTool: Kamerka"
    },
	{
      "description": "This tool will allow you to generate LNK payloads. Upon rendering or being run, they will exfiltrate data.",
      "meta": {
	  "kill_chain": [
          "osrs-sec-tool:SecTool A thru P"
        ],
        "refs": [
          "https://github.com/Plazmaz/LNKUp"
        ]
      },
      "uuid": "0aea30b6-42c8-11ea-b77f-2e728ce88125",
      "value": "OSRS SecTool: LNKUp"
    },
	{
      "description": "Living Off The Land Binaries and Scripts collection.",
      "meta": {
	  "kill_chain": [
          "osrs-sec-tool:SecTool A thru P"
        ],
        "refs": [
          "https://github.com/LOLBAS-Project/LOLBAS",
		  "https://lolbas-project.github.io/"
        ]
      },
      "uuid": "0aea31f6-42c8-11ea-b77f-2e728ce88125",
      "value": "OSRS SecTool: Living Off The Land Binaries and Scripts (LOLBAS)"
    },
	{
      "description": "The Microsoft Macro Assembler (MASM) is an x86 assembler that uses the Intel syntax for MS-DOS and Microsoft Windows. Beginning with MASM 8.0, there are two versions of the assembler - One for 16-bit & 32-bit assembly sources, and another (ML64) for 64-bit sources only. MASM is maintained by Microsoft, but since version 6.12 it has not been sold as a separate product. It is instead supplied with various Microsoft SDKs and C compilers. Recent versions of MASM are included with Microsoft Visual Studio.",
      "meta": {
	  "kill_chain": [
          "osrs-sec-tool:SecTool A thru P"
        ],
        "refs": [
          "https://en.wikipedia.org/wiki/Microsoft_Macro_Assembler"
        ]
      },
      "uuid": "0aea3340-42c8-11ea-b77f-2e728ce88125",
      "value": "OSRS SecTool: MASM (Microsoft Macro Assembler)"
    },
	{
      "description": "MASSCAN is an Internet-scale port scanner. It can scan the entire Internet in under 6 minutes, transmitting 10 million packets per second, from a single machine. It's input/output is similar to nmap. Internally, it uses asynchronous tranmissions, similar to port scanners like scanrand, unicornscan, and ZMap. It's more flexible, allowing arbitrary port and address ranges. MASSCAN uses a its own custom TCP/IP stack.",
      "meta": {
	  "kill_chain": [
          "osrs-sec-tool:SecTool A thru P"
        ],
        "refs": [
          "https://github.com/robertdavidgraham/masscan"
        ]
      },
      "uuid": "0aea346c-42c8-11ea-b77f-2e728ce88125",
      "value": "OSRS SecTool: MASSCAN"
    },
	{
      "description": "MailSniper is a penetration testing tool for searching through email in a Microsoft Exchange environment for specific terms (passwords, insider intel, network architecture information, etc.). It can be used as a non-administrative user to search their own email, or by an Exchange administrator to search the mailboxes of every user in a domain. MailSniper also includes additional modules for password spraying, enumerating users/domains, gathering the Global Address List from OWA and EWS, and checking mailbox permissions for every Exchange user at an organization.",
      "meta": {
	  "kill_chain": [
          "osrs-sec-tool:SecTool A thru P"
        ],
        "refs": [
          "https://github.com/dafthack/MailSniper"
        ]
      },
      "uuid": "0aea3886-42c8-11ea-b77f-2e728ce88125",
      "value": "OSRS SecTool: MailSniper"
    },
	{
      "description": "The Mandos system allows computers to have encrypted root file systems and at the same time be capable of remote or unattended reboots. The computers run a small client program in the initial RAM disk environment which will communicate with a server over a network. All network communication is encrypted using TLS. The clients are identified by the server using an OpenPGP key that is unique to each client. The server sends the clients an encrypted password. The encrypted password is decrypted by the clients using the same OpenPGP key, and the password is then used to unlock the root file system.",
      "meta": {
	  "kill_chain": [
          "osrs-sec-tool:SecTool A thru P"
        ],
        "refs": [
          "https://packetstormsecurity.com/files/154148/mandos_1.8.8.orig.tar.gz",
		  "https://www.recompile.se/mandos"
        ]
      },
      "uuid": "37ef7526-42c8-11ea-b77f-2e728ce88125",
      "value": "OSRS SecTool: Mandos Encrypted File System Unattended Reboot Utility"
    },
	{
      "description": "The Metasploit Framework is a Ruby-based, modular penetration testing platform that enables you to write, test, and execute exploit code. The Metasploit Framework contains a suite of tools that you can use to test security vulnerabilities, enumerate networks, execute attacks, and evade detection. At its core, the Metasploit Framework is a collection of commonly used tools that provide a complete environment for penetration testing and exploit development.",
      "meta": {
	  "kill_chain": [
          "osrs-sec-tool:SecTool A thru P"
        ],
        "refs": [
          "https://www.metasploit.com/",
		  "https://metasploit.help.rapid7.com/v1/docs/about-metasploit-framework"
        ]
      },
      "uuid": "37ef77e2-42c8-11ea-b77f-2e728ce88125",
      "value": "OSRS SecTool: Metasploit"
    },
	{
      "description": "Mussels is a cross-platform and general-purpose dependency build automation tool. Mussels helps automate the building of applications and their versioned dependency chains using the original build systems intended by the software authors.",
      "meta": {
	  "kill_chain": [
          "osrs-sec-tool:SecTool A thru P"
        ],
        "refs": [
          "https://github.com/Cisco-Talos/Mussels"
        ]
      },
      "uuid": "37ef792c-42c8-11ea-b77f-2e728ce88125",
      "value": "OSRS SecTool: Mussels"
    },
	{
      "description": "NebulousAD is a tool for auditing Active Directory user passwords against a database of compromised passwords found in data breaches. The tool was made to help Windows system administrators find and, optionally, remediate the use of compromised passwords. This approach is recommended by NIST 800-63B, and can help protect against credential spraying and stuffing attacks. The Nebulous database current holds over 2.5 billion unique hashes of breached passwords. NebulousAD uses the k-anonymity model by default to preserve the privacy and security of passwords checked against the API. Only the first five characters of a SHA-2 hash are sent to the API. The tool was originally released at BSides Las Vegas 2019.",
      "meta": {
	  "kill_chain": [
          "osrs-sec-tool:SecTool A thru P"
        ],
        "refs": [
          "https://github.com/NuID/nebulousAD"
        ]
      },
      "uuid": "37ef7a62-42c8-11ea-b77f-2e728ce88125",
      "value": "OSRS SecTool: NebulousAD"
    },
	{
      "description": "Nishang is a framework and collection of scripts and payloads which enables usage of PowerShell for offensive security, penetration testing and red teaming. Nishang is useful during all phases of penetration testing.",
      "meta": {
	  "kill_chain": [
          "osrs-sec-tool:SecTool A thru P"
        ],
        "refs": [
          "https://github.com/samratashok/nishang"
        ]
      },
      "uuid": "37ef7b8e-42c8-11ea-b77f-2e728ce88125",
      "value": "OSRS SecTool: Ninshang Framework"
    },
	{
      "description": "Nmap (Network Mapper) is a free and open-source network scanner created by Gordon Lyon (also known by his pseudonym Fyodor Vaskovich). Nmap is used to discover hosts and services on a computer network by sending packets and analyzing the responses. Nmap provides a number of features for probing computer networks, including host discovery and service and operating system detection. These features are extensible by scripts that provide more advanced service detection, vulnerability detection, and other features. Nmap can adapt to network conditions including latency and congestion during a scan. Nmap started as a Linux utility and was ported to other systems including Windows, macOS, and BSD. Linux is the most popular platform, followed by Windows.",
      "meta": {
	  "kill_chain": [
          "osrs-sec-tool:SecTool A thru P"
        ],
        "refs": [
          "https://en.wikipedia.org/wiki/Nmap",
		  "https://packetstormsecurity.com/files/154000/nmap-7.80.tgz"
        ]
      },
      "uuid": "37ef7cba-42c8-11ea-b77f-2e728ce88125",
      "value": "OSRS SecTool: Nmap Port Scanner"
    },
	{
      "description": "Windows File Enumeration Intel Gathering. Standard users can prove existence of privileged user artifacts. Typically, the Windows commands DIR or TYPE hand out a default Access Denied error message, when a file exists or doesn't exist, when restricted access is attempted by another user. However, accessing files directly by attempting to open them from cmd.exe shell, we can determine existence by compare inconsistent Windows error messages.",
      "meta": {
	  "kill_chain": [
          "osrs-sec-tool:SecTool A thru P"
        ],
        "refs": [
          "https://seclists.org/bugtraq/2019/Sep/16"
        ],
        "synonyms": [
        "Windows File Enumeration Intel Gathering Tool"
        ]
      },
      "uuid": "37ef7ddc-42c8-11ea-b77f-2e728ce88125",
      "value": "OSRS SecTool: NtFileSins"
    },
	{
      "description": "ntlmRelayToEWS is a tool for performing ntlm relay attacks on Exchange Web Services (EWS). It spawns an SMBListener on port 445 and an HTTPListener on port 80, waiting for incoming connection from the victim. Once the victim connects to one of the listeners, an NTLM negociation occurs and is relayed to the target EWS server.",
      "meta": {
	  "kill_chain": [
          "osrs-sec-tool:SecTool A thru P"
        ],
        "refs": [
          "https://github.com/Arno0x/NtlmRelayToEWS"
        ]
      },
      "uuid": "37ef81a6-42c8-11ea-b77f-2e728ce88125",
      "value": "OSRS SecTool: NtlmRelayToEWS"
    },
	{
      "description": "The native Microsoft command-line utility NetShell has the ability to load custom helper DLLs to extend its functionality. An attacker may leverage this built-in functionality to maintain persistence by crafting a malicious helper DLL. The helper will only execute when netsh.exe is started. Some VPN software runs netsh in the background by default, which may allow an attacker to target remote users who primarily use VPN in their day-to-day tasks. The PoC will need to be built as a dll (x64), then added as a helper to netsh. The PoC spawns a new thread, so netsh will still be usable while a payload is running. However, when netsh ends so will your shell.",
      "meta": {
	  "kill_chain": [
          "osrs-sec-tool:SecTool A thru P"
        ],
        "refs": [
          "https://github.com/rtcrowley/Offensive-Netsh-Helper"
        ]
      },
      "uuid": "37ef8318-42c8-11ea-b77f-2e728ce88125",
      "value": "OSRS SecTool: Offensive Netsh Helper"
    },
	{
      "description": "OnionShare is an open source tool that lets you securely and anonymously share a file of any size.",
      "meta": {
	  "kill_chain": [
          "osrs-sec-tool:SecTool A thru P"
        ],
        "refs": [
          "https://onionshare.org/"
        ]
      },
      "uuid": "37ef8444-42c8-11ea-b77f-2e728ce88125",
      "value": "OSRS SecTool: OnionShare"
    },
	{
      "description": "OpenSSL is a robust, commercial-grade, and full-featured toolkit for the Transport Layer Security (TLS) and Secure Sockets Layer (SSL) protocols. It is also a general-purpose cryptography library.",
      "meta": {
	  "kill_chain": [
          "osrs-sec-tool:SecTool A thru P"
        ],
        "refs": [
          "https://www.openssl.org/"
        ]
      },
      "uuid": "7857f16a-42c8-11ea-b77f-2e728ce88125",
      "value": "OSRS SecTool: OpenSSL Toolkit"
    },
	{
      "description": "This is a reborn tool, used during the epoche dinosaurs were traipsing the earth. Basically it analyses PDF files for Metadata. You can direct it to a file or directory with pdfs. You can show it the url of a pdf or use the integrated googlesearch (thanx to mario vilas class) to search for pdfs at target site, download and analyse them.",
      "meta": {
	  "kill_chain": [
          "osrs-sec-tool:SecTool A thru P"
        ],
        "refs": [
          "https://github.com/c0decave/pdfgrab"
        ]
      },
      "uuid": "7857f642-42c8-11ea-b77f-2e728ce88125",
      "value": "OSRS SecTool: PDFgrab"
    },
	{
      "description": "PacketFence is a fully supported, trusted, Free and Open Source network access control (NAC) solution. Boasting an impressive feature set including a captive-portal for registration and remediation, centralized wired and wireless management, powerful BYOD management options, 802.1X support, layer-2 isolation of problematic devices; PacketFence can be used to effectively secure networks small to very large heterogeneous networks.",
      "meta": {
	  "kill_chain": [
          "osrs-sec-tool:SecTool A thru P"
        ],
        "refs": [
          "https://packetfence.org/"
        ]
      },
      "uuid": "7857f7c8-42c8-11ea-b77f-2e728ce88125",
      "value": "OSRS SecTool: PacketFence"
    },
	{
      "description": "Ping Castle is a tool designed to assess quickly the Active Directory security level with a methodology based on risk assessment and a maturity framework. It does not aim at a perfect evaluation but rather as an efficiency compromise.",
      "meta": {
	  "kill_chain": [
          "osrs-sec-tool:SecTool A thru P"
        ],
        "refs": [
          "https://github.com/vletoux/pingcastle",
		  "https://www.pingcastle.com"
        ]
      },
      "uuid": "7857f930-42c8-11ea-b77f-2e728ce88125",
      "value": "OSRS SecTool: PingCastle"
    },
	{
      "description": "Penetration testing analysis tool.",
      "meta": {
	  "kill_chain": [
          "osrs-sec-tool:SecTool A thru P"
        ],
        "refs": [
          "https://github.com/chrchang/plink-ng"
        ]
      },
      "uuid": "7857fa66-42c8-11ea-b77f-2e728ce88125",
      "value": "OSRS SecTool: Plink-ng"
    },
	{
      "description": "Power Dump takes a 64 bit Windows 10 powershell process dump made using procdump and retrieves powershell blocks and variables from memory. Basically its strings on steroids with a little extra logic built-in for finding powershell. Only tested and built out right now for or on Windows 10 64 bit Intel.",
      "meta": {
	  "kill_chain": [
          "osrs-sec-tool:SecTool A thru P"
        ],
        "refs": [
          "https://github.com/chrisjd20/power_dump",
		  "https://docs.microsoft.com/en-us/sysinternals/downloads/procdump"
        ]
      },
      "uuid": "7857fb9c-42c8-11ea-b77f-2e728ce88125",
      "value": "OSRS SecTool: PowerDump"
    },
	{
      "description": "Open-source jailbreaking tool for many iOS devices.",
      "meta": {
	  "kill_chain": [
          "osrs-sec-tool:SecTool A thru P"
        ],
        "refs": [
          "https://github.com/axi0mX/ipwndfu"
        ]
      },
      "uuid": "7857fcc8-42c8-11ea-b77f-2e728ce88125",
      "value": "OSRS SecTool: ipwndfu"
    },
	{
      "description": "The jtool utility started as a companion utility to the 1st edition of MacOS internals, because I wanted to demonstrate Mach-O format intrinstics, and was annoyed with XCode's otool. Along the way, jtool absorbed additional Mach-O commands such as atos, dyldinfo, nm, segedit, pagestuff, strings, and even codesign; and, the informal ldid. Most importantly, it can be run on a variety of platforms - OS X, iOS, and even Linux, where Apple's tools don't exist. jtool provides many many novel features - in-binary search functionality, symbol injection built-in disassembler functionality with (limited but constantly improving) emulation capabilities, which already outdo fancy commercial GUI disassemblers.",
      "meta": {
	  "kill_chain": [
          "osrs-sec-tool:SecTool A thru P"
        ],
        "refs": [
          "http://www.newosxbook.com/tools/jtool.html"
        ]
      },
      "uuid": "7857fdf4-42c8-11ea-b77f-2e728ce88125",
      "value": "OSRS SecTool: jtool"
    },
	{
      "description": "lnk2pwn is a gui tool that automates the process of generating malicious .lnk(Windows shortcut) files.",
      "meta": {
	  "kill_chain": [
          "osrs-sec-tool:SecTool A thru P"
        ],
        "refs": [
          "https://github.com/tommelo/lnk2pwn",
		  "https://github.com/it-gorillaz/lnk2pwn"
        ]
      },
      "uuid": "785800a6-42c8-11ea-b77f-2e728ce88125",
      "value": "OSRS SecTool: lnk2pwn"
    },
	{
      "description": "Binary encryption tool.",
      "meta": {
	  "kill_chain": [
          "osrs-sec-tool:SecTool A thru P"
        ],
        "refs": [
          "https://github.com/redtimmy/golden-frieza",
		  "https://www.redtimmy.com/red-teaming/blue-team-vs-red-team-how-to-run-your-encrypted-binary-in-memory-and-go-undetected/"
        ],
		"synonyms": [
		"golden-frieza"
		]
      },
      "uuid": "bc7c4028-652b-11ea-bc55-0242ac130003",
      "value": "OSRS SecTool: Golden Friez"
    },
	{
      "description": "The Microsoft Distributed Transaction Coordinator (MSDTC) service is a component of modern versions of Microsoft Windows that is responsible for coordinating transactions that span multiple resource managers, such as databases, message queues, and file systems. MSDTC is included in Windows 2000 and later operating systems, and is also available for Windows NT 4.0. MSDTC performs the transaction coordination role for components, usually with COM and .NET architectures. In MSDTC terminology, the director is called the transaction manager. By default, the Microsoft Distributed Transaction Coordinator (MSDTC) service is installed with Windows 2000. It cannot be uninstalled through Add(Remove) Programs.",
      "meta": {
	  "kill_chain": [
          "osrs-sec-tool:SecTool A thru P"
        ],
        "refs": [
          "https://en.wikipedia.org/wiki/Microsoft_Distributed_Transaction_Coordinator"
        ],
		"synonyms": [
		"msdtc.exe"
		]
      },
      "uuid": "bc7c424e-652b-11ea-bc55-0242ac130003",
      "value": "OSRS SecTool: Microsoft Distributed Transaction Coordinator"
    },
	{
      "description": "MPRESS makes programs and libraries smaller, and decrease start time when the application loaded from a slow removable media or from the network. It uses in-place decompression technique, which allows to decompress the executable without memory overhead or other drawbacks. It also protects programs against reverse engineering by non-professional hackers. Programs compressed with MPRESS run exactly as before, with no runtime performance penalties.",
      "meta": {
	  "kill_chain": [
          "osrs-sec-tool:SecTool A thru P"
        ],
        "refs": [
          "http://www.matcode.com/mpress.htm"
        ]
      },
      "uuid": "bc7c4348-652b-11ea-bc55-0242ac130003",
      "value": "OSRS SecTool: MPRESS packer"
    },
	{
      "description": "Crescendo is a real time event viewer for macOS that uses the ESF to show process executions and forks, file events, share mounting events, kernel extension loads, and IPC event data.",
      "meta": {
	  "kill_chain": [
          "osrs-sec-tool:SecTool A thru P"
        ],
        "refs": [
          "https://www.fireeye.com/blog/threat-research/2020/03/crescendo-real-time-event-viewer-for-macos.html"
        ]
      },
      "uuid": "2f79062c-6876-11ea-bc55-0242ac130003",
      "value": "OSRS SecTool: Crescendo"
    },
	{
      "description": "Koadic, or COM Command & Control, is a Windows post-exploitation rootkit similar to other penetration testing tools such as Meterpreter and Powershell Empire. The major difference is that Koadic does most of its operations using Windows Script Host (a.k.a. JScript or VBScript), with compatibility in the core to support a default installation of Windows 2000 with no service packs (and potentially even versions of NT4) all the way through Windows 10.",
      "meta": {
	  "kill_chain": [
          "osrs-sec-tool:SecTool A thru P"
        ],
        "refs": [
          "https://github.com/zerosum0x0/koadic"
        ]
      },
      "uuid": "2f790834-6876-11ea-bc55-0242ac130003",
      "value": "OSRS SecTool: Kodiak Post-Exploitation Rootkit"
    },
	{
      "description": "A very fast and smart web-dir (or file) enumeration tool written in C for the lulz.",
      "meta": {
	  "kill_chain": [
          "osrs-sec-tool:SecTool A thru P"
        ],
        "refs": [
          "https://github.com/nullsecuritynet/tools/tree/master/scanner/lulzbuster"
        ]
      },
      "uuid": "75e4b4e4-6961-11ea-bc55-0242ac130003",
      "value": "OSRS SecTool: Lulzbuster"
    },
	{
      "description": "Hyperion is a runtime encrypter for 32 or 64 bit portable executables. It is a reference implementation and bases on the paper Hyperion - Implementation of a PE-Crypter.",
      "meta": {
	  "kill_chain": [
          "osrs-sec-tool:SecTool A thru P"
        ],
        "refs": [
          "https://github.com/nullsecuritynet/tools/tree/master/binary/hyperion"
        ]
      },
      "uuid": "30312726-6ded-11ea-bc55-0242ac130003",
      "value": "OSRS SecTool: Hyperion Runtime Encrypter"
    },
	{
      "description": "A modular framework designed to chain and automate security tests. It parses target definitions from the command line and runs corresponding modules and their nullscan-tools afterwards. It can also take hosts and start nmap first in order to perform a basic portscan and run the modules afterwards. Also, nullscan can parse a given nmap logfile for open tcp and udp ports and again run the modules afterwards. All results will be logged in specified directories with a clean structure and a HTML report can subsequently be generated.",
      "meta": {
	  "kill_chain": [
          "osrs-sec-tool:SecTool A thru P"
        ],
        "refs": [
          "https://nullsecurity.net/tools/automation.html"
        ]
      },
      "uuid": "baf9899e-7206-11ea-bc55-0242ac130003",
      "value": "OSRS SecTool: NullScan"
    },
	{
      "description": "Octopus is an open source, pre-operation C2 server based on python which can control an Octopus powershell agent through HTTP or HTTPS. The main purpose of creating Octopus is for use before any red team operation, where rather than starting the engagement with your full operational arsenal and infrastructure, you can use Octopus first to attack the target and gather information before you start your actual red team operation. Octopus works in a very simple way to execute commands and exchange information with the C2 over a well encrypted channel, which makes it inconspicuous and undetectable from almost every AV, endpoint protection, and network monitoring solution. One cool feature in Octopus is called ESA, which stands for Endpoint Situational Awareness, which will gather some important information about the target that will help you to gain better understanding of the target network endpoints that you will face during your operation, thus giving you a shot to customize your real operation based on this information. Octopus is designed to be stealthy and covert while communicating with the C2, as it uses AES-256 by default for its encrypted channel between the powershell agent and the C2 server. You can also opt for using SSL (or TLS) by providing a valid certficate for your domain and configuring the Octopus C2 server to use it.",
      "meta": {
	  "kill_chain": [
          "osrs-sec-tool:SecTool A thru P"
        ],
        "refs": [
          "https://github.com/mhaskar/Octopus"
        ]
      },
      "uuid": "172c2576-72a4-11ea-bc55-0242ac130003",
      "value": "OSRS SecTool: Octopus"
    },
	{
      "description": "Very low footprint JSON parser written in portable ANSI C.",
      "meta": {
	  "kill_chain": [
          "osrs-sec-tool:SecTool A thru P"
        ],
        "refs": [
          "https://github.com/udp/json-parser"
        ]
      },
      "uuid": "f67c56e0-74e0-11ea-bc55-0242ac130003",
      "value": "OSRS SecTool: json-parser"
    },
	{
      "description": "Open source file encryption application.",
      "meta": {
	  "kill_chain": [
          "osrs-sec-tool:SecTool A thru P"
        ],
        "refs": [
          "https://github.com/vstakhov/opt-cryptobox/tree/master/curve25519"
        ]
      },
      "uuid": "f67c5938-74e0-11ea-bc55-0242ac130003",
      "value": "OSRS SecTool: Curve25519"
    },
	{
      "description": "JupyterLab is a web-based interactive development environment for Jupyter notebooks, code, and data. JupyterLab is flexible. Configure and arrange the user interface to support a wide range of workflows in data science, scientific computing, and machine learning. JupyterLab is extensible and modular. Write plugins that add new components and integrate with existing ones.",
      "meta": {
	  "kill_chain": [
          "osrs-sec-tool:SecTool A thru P"
        ],
        "refs": [
          "https://jupyter.org/"
        ]
      },
      "uuid": "b5856d9e-7750-11ea-bc55-0242ac130003",
      "value": "OSRS SecTool: JupyterLab"
    },
	{
      "description": "Python is an interpreted, high-level, general-purpose programming language. Created by Guido van Rossum and first released in 1991, Python's design philosophy emphasizes code readability with its notable use of significant whitespace.",
      "meta": {
	  "kill_chain": [
          "osrs-sec-tool:SecTool A thru P"
        ],
        "refs": [
          "https://www.python.org/",
		  "https://en.wikipedia.org/wiki/Python_(programming_language)"
        ]
      },
      "uuid": "b5857014-7750-11ea-bc55-0242ac130003",
      "value": "OSRS SecTool: Python"
    },
	{
      "description": "GitHub, Inc. is a US-based global company that provides hosting for software development version control using Git. It is a subsidiary of Microsoft, which acquired the company in 2018 for US$7.5 billion. It offers the distributed version control and source code management functionality of Git, plus its own features.",
      "meta": {
	  "kill_chain": [
          "osrs-sec-tool:SecTool A thru P"
        ],
        "refs": [
          "https://github.com/",
		  "https://en.wikipedia.org/wiki/GitHub"
        ]
      },
      "uuid": "b5857118-7750-11ea-bc55-0242ac130003",
      "value": "OSRS SecTool: GitHub"
    },
	{
      "description": "Google Drive is a file storage and synchronization service developed by Google. Launched on April 24, 2012, Google Drive allows users to store files on their servers, synchronize files across devices, and share files.",
      "meta": {
	  "kill_chain": [
          "osrs-sec-tool:SecTool A thru P"
        ],
        "refs": [
          "https://www.google.com/drive/",
		  "https://en.wikipedia.org/wiki/Google_Drive"
        ]
      },
      "uuid": "b58571fe-7750-11ea-bc55-0242ac130003",
      "value": "OSRS SecTool: Google Drive"
    },
	{
      "description": "Go is a statically typed, compiled programming language designed at Google by Robert Griesemer, Rob Pike, and Ken Thompson. Go is syntactically similar to C, but with memory safety, garbage collection, structural typing, and CSP-style concurrency.",
      "meta": {
	  "kill_chain": [
          "osrs-sec-tool:SecTool A thru P"
        ],
        "refs": [
          "https://golang.org/",
		  "https://en.wikipedia.org/wiki/Go_(programming_language)"
        ]
      },
      "uuid": "b58572c6-7750-11ea-bc55-0242ac130003",
      "value": "OSRS SecTool: Go (Programming Language)"
    },
	{
      "description": "Baidu Maps is a desktop and mobile web mapping service application and technology provided by Baidu, offering satellite imagery, street maps, street view and indoor view perspectives, as well as functions such as a route planner for traveling by foot, car, or with public transportation.",
      "meta": {
	  "kill_chain": [
          "osrs-sec-tool:SecTool A thru P"
        ],
        "refs": [
          "https://en.wikipedia.org/wiki/Baidu_Maps"
        ]
      },
      "uuid": "b58574ec-7750-11ea-bc55-0242ac130003",
      "value": "OSRS SecTool: Baidu Maps"
    },
	{
      "description": "Manalyzer is a free service which performs static analysis on PE executables to detect undesirable behavior.",
      "meta": {
	  "kill_chain": [
          "osrs-sec-tool:SecTool A thru P"
        ],
        "refs": [
          "https://www.manalyzer.org/"
        ]
      },
      "uuid": "b58575d2-7750-11ea-bc55-0242ac130003",
      "value": "OSRS SecTool: Manalyzer"
    },
	{
      "description": "Network emulation tool developed by the cybersecurity company FireEye. Used to emulate networks during malware analysis.",
      "meta": {
	  "kill_chain": [
          "osrs-sec-tool:SecTool A thru P"
        ],
        "refs": [
          "https://github.com/fireeye/flare-fakenet-ng/releases",
		  "https://www.fireeye.com/blog/threat-research/2016/08/fakenet-ng_next_gen.html",
		  "https://www.fireeye.com/blog/threat-research/2020/04/improving-dynamic-malware-analysis-with-cheat-codes-for-fakenet-ng.html"
        ]
      },
      "uuid": "7738303e-7823-11ea-bc55-0242ac130003",
      "value": "OSRS SecTool: FakeNet-NG"
    },
	{
      "description": "For statitic analysis of applications that may abuse device attributes.",
      "meta": {
	  "kill_chain": [
          "osrs-sec-tool:SecTool A thru P"
        ],
        "refs": [
          "https://securityaffairs.co/wordpress/101094/malware/android-apps-hidden-backdoors.html",
		  "https://github.com/OSUSecLab/InputScope",
		  "https://web.cse.ohio-state.edu/~lin.3021/file/SP20.pdf"
        ]
      },
      "uuid": "77383138-7823-11ea-bc55-0242ac130003",
      "value": "OSRS SecTool: InputScope"
    },
	{
      "description": "UPX is a free, portable, extendable, high-performance executable packer for several executable formats.",
      "meta": {
	  "kill_chain": [
          "osrs-sec-tool:SecTool A thru P"
        ],
        "refs": [
          "https://upx.github.io/"
        ]
      },
      "uuid": "09098b8e-79b4-11ea-bc55-0242ac130003",
      "value": "OSRS SecTool: UPX Packer"
    },
	{
      "description": "netABuse is a scanner that identifies systems susceptible to a Microsoft Windows insufficient authentication logic flaw.",
      "meta": {
	  "kill_chain": [
          "osrs-sec-tool:SecTool A thru P"
        ],
        "refs": [
          "https://packetstormsecurity.com/files/157180/netABuse.txt"
        ]
      },
      "uuid": "90fba0ea-7d8d-11ea-bc55-0242ac130003",
      "value": "OSRS SecTool: netABuse"
    },
	{
      "description": "nfstream is a Python package providing fast, flexible, and expressive data structures designed to make working with online or offline network data both easy and intuitive. It aims to be the fundamental high-level building block for doing practical, real world network data analysis in Python. Additionally, it has the broader goal of becoming a common network data processing framework for researchers providing data reproducibility across experiments.",
      "meta": {
	  "kill_chain": [
          "osrs-sec-tool:SecTool A thru P"
        ],
        "refs": [
          "https://github.com/aouinizied/nfstream"
        ]
      },
      "uuid": "d9e0434a-83d9-11ea-bc55-0242ac130003",
      "value": "OSRS SecTool: nfstream"
    },
	{
      "description": "This is a piece of software that lets you tunnel IPv4 data through a DNS server. This can be usable in different situations where internet access is firewalled, but DNS queries are allowed.",
      "meta": {
	  "kill_chain": [
          "osrs-sec-tool:SecTool A thru P"
        ],
        "refs": [
          "https://github.com/yarrick/iodine"
        ]
      },
      "uuid": "b0c65068-8af9-11ea-bc55-0242ac130003",
      "value": "OSRS SecTool: iodine"
    },
	{
      "description": "Keystone is a lightweight multi-platform, multi-architecture assembler framework.",
      "meta": {
	  "kill_chain": [
          "osrs-sec-tool:SecTool A thru P"
        ],
        "refs": [
          "http://www.keystone-engine.org/"
        ]
      },
      "uuid": "b0c6528e-8af9-11ea-bc55-0242ac130003",
      "value": "OSRS SecTool: Keystone Engine"
    },
	{
      "description": "Keypatch is the award winning plugin of IDA Pro for Keystone Assembler Engine. See this introduction for the motivation behind Keypatch, and this slides for how it is implemented. A quick tutorial is also available.",
      "meta": {
	  "kill_chain": [
          "osrs-sec-tool:SecTool A thru P"
        ],
        "refs": [
          "http://www.keystone-engine.org/keypatch/"
        ]
      },
      "uuid": "b0c6539c-8af9-11ea-bc55-0242ac130003",
      "value": "OSRS SecTool: Keypatch"
    },
	{
      "description": "Bochs is a highly portable open source IA-32 (x86) PC emulator written in C++, that runs on most popular platforms. It includes emulation of the Intel x86 CPU, common I/O devices, and a custom BIOS. Bochs can be compiled to emulate many different x86 CPUs, from early 386 to the most recent x86-64 Intel and AMD processors which may even not reached the market yet. Bochs is capable of running most Operating Systems inside the emulation including Linux, DOS or Microsoft Windows. Bochs was originally written by Kevin Lawton and is currently maintained by this project. Bochs can be compiled and used in a variety of modes, some which are still in development. The typical use of bochs is to provide complete x86 PC emulation, including the x86 processor, hardware devices, and memory. This allows you to run OS's and software within the emulator on your workstation, much like you have a machine inside of a machine. For instance, let's say your workstation is a Unix/X11 workstation, but you want to run Win'95 applications. Bochs will allow you to run Win 95 and associated software on your Unix/X11 workstation, displaying a window on your workstation, simulating a monitor on a PC.",
      "meta": {
	  "kill_chain": [
          "osrs-sec-tool:SecTool A thru P"
        ],
        "refs": [
          "http://bochs.sourceforge.net/"
        ]
      },
      "uuid": "b0c655c2-8af9-11ea-bc55-0242ac130003",
      "value": "OSRS SecTool: Bochs IDB"
    },
	{
      "description": "PhantomJS is a headless web browser scriptable with JavaScript. It runs on Windows, macOS, Linux, and FreeBSD. Using QtWebKit as the back-end, it offers fast and native support for various web standards: DOM handling, CSS selector, JSON, Canvas, and SVG.",
      "meta": {
	  "kill_chain": [
          "osrs-sec-tool:SecTool A thru P"
        ],
        "refs": [
          "https://phantomjs.org/"
        ]
      },
      "uuid": "57e0e420-9546-11ea-bb37-0242ac130002",
      "value": "OSRS SecTool: PhantomJS - Scriptable Headless Browser"
    },
	{
      "description": "AIEngine is a next generation interactive programmable Python, Ruby, Java, Lua packet inspection engine with capabilities of learning without any human intervention, NIDS(Network Intrusion Detection System) functionality, DNS domain classification, network collector, network forensics and many others.",
      "meta": {
	  "kill_chain": [
          "osrs-sec-tool:SecTool A thru P"
        ],
        "refs": [
          "https://github.com/camp0/aiengine",
		  "https://bitbucket.org/camp0/aiengine"
        ]
      },
      "uuid": "ecdf82f2-3f79-11ea-b77f-2e728ce88125",
      "value": "OSRS SecTool: AIEngine"
    }
	  ],
	"version": 23
}
