{
	"category": "BLS-NAICS-52",
	"description": "The Finance and Insurance sector comprises establishments primarily engaged in financial transactions (transactions involving the creation, liquidation, or change in ownership of financial assets) and/or in facilitating financial transactions. Three principal types of activities are identified: 1. Raising funds by taking deposits and/or issuing securities and, in the process, incurring liabilities. Establishments engaged in this activity use raised funds to acquire financial assets by making loans and/or purchasing securities. Putting themselves at risk, they channel funds from lenders to borrowers and transform or repackage the funds with respect to maturity, scale, and risk. This activity is known as financial intermediation. 2. Pooling of risk by underwriting insurance and annuities. Establishments engaged in this activity collect fees, insurance premiums, or annuity considerations; build up reserves; invest those reserves; and make contractual payments. Fees are based on the expected incidence of the insured risk and the expected return on investment. 3. Providing specialized services facilitating or supporting financial intermediation, insurance, and employee benefit programs. In addition, monetary authorities charged with monetary control are included in this sector.",
	"name": "BLS-NAICS-52",
	"source": "BLS Industries at a Glance",
	"type": "BLS-NAICS-52",
	"uuid": "ed40c9ee-47ff-11e9-b210-d663bd873d93",
	"values": [{
			"description": "Test place holder",
			"meta": {
				"refs": [
					"https://www.bls.gov/iag/tgs/iag52.htm"
				]
			},
			"uuid": "8467c15a-48c4-11e9-8646-d663bd873d93",
			"value": "Test Finance and Insurance Value"
		},
		{
			"description": "The ING Group is a Dutch multinational banking and financial services corporation headquartered in Amsterdam. Its primary businesses are retail banking, direct banking, commercial banking, investment banking, asset management, and insurance services. ING is an abbreviation for Internationale Nederlanden Groep.",
			"meta": {
				"refs": [
					"https://www.ing.com/Home.htm"
				]
			},
			"uuid": "7879b744-4b22-11e9-8646-d663bd873d93",
			"value": "ING Bank"
		},
		{
			"description": "FirstBank, sometimes referred to as 1STBank, is a Colorado-based and privately held bank and financial services company that owns over 115 FirstBank locations in three states in the Southwestern U.S. - Colorado, Arizona, and California.",
			"meta": {
				"refs": [
					"https://www.efirstbank.com/"
				]
			},
			"uuid": "26396d9c-7bd5-11e9-8f9e-2a86e4085a59",
			"value": "FirstBank Holding Co"
		},
		{
			"description": "First American Financial Corporation is a United States financial services company and is a leading provider of title insurance and settlement services to the real estate and mortgage industries.",
			"meta": {
				"refs": [
					"http://www.firstam.com/index.html"
				]
			},
			"uuid": "5d2fff78-8224-11e9-bc42-526af7764f64",
			"value": "First American Financial Corporation"
		},
		{
			"description": "GateHub is a platform for the Internet of Value, built on XRP Ledger protocol. It allows everyone to send, receive, trade and manage any type of assets.",
			"meta": {
				"refs": [
					"https://gatehub.net/"
				]
			},
			"uuid": "2bcac306-8d40-11e9-bc42-526af7764f64",
			"value": "GateHub"
		},
		{
			"description": "Westpac Banking Corporation, commonly known as Westpac, is an Australian bank and financial-services provider headquartered at Westpac Place in Sydney. ",
			"meta": {
				"refs": [
					"https://www.westpac.com.au/"
				]
			},
			"uuid": "2bcac734-8d40-11e9-bc42-526af7764f64",
			"value": "Westpac Banking Corporation"
		},
		{
			"description": "The Desjardins Group is a Canadian cooperative that is the largest federation of credit unions in North America, and is counted among the Worlds Strongest Banks according to the Banker magazine. It was founded in 1900 in Levis, Quebec by Alphonse Desjardins.",
			"meta": {
				"refs": [
					"https://www.desjardins.com/ca/index.jsp"
				]
			},
			"uuid": "30dc2162-95ee-11e9-bc42-526af7764f64",
			"value": "Desjardins Group"
		},
		{
			"description": "Dominion National offers Select dental plans (same as a DHMO), PPO plans, ePPO plans and dual-choice coverage. In addition, Dominion National also provides full administrative support for strategic partnerships, health plans and Third Party Administrators (TPAs). Dominion National selection of vision plans offers coverage for a wide range of budgets.",
			"meta": {
				"refs": [
					"https://www.dominionnational.com/"
				]
			},
			"uuid": "30dc23f6-95ee-11e9-bc42-526af7764f64",
			"value": "Dominion National"
		},
		{
			"description": "Philadelphia Federal Credit Union is a credit union headquartered in Philadelphia. It is chartered and regulated under the National Credit Union Administration. PFCU is the sixth largest credit union in Philadelphia. PFCU has more than $900 million USD in assets, and over 112,000 members.",
			"meta": {
				"refs": [
					"https://www.pfcu.com/"
				]
			},
			"uuid": "b6e41c86-a5cc-11e9-a2a3-2a2ae2dbcce4",
			"value": "Philadelphia Federal Credit Union"
		},
		{
			"description": "National Australia Bank is one of the four largest financial institutions in Australia in terms of market capitalisation, earnings and customers.",
			"meta": {
				"refs": [
					"https://www.nab.com.au/"
				]
			},
			"uuid": "f6113f3c-b617-11e9-a2a3-2a2ae2dbcce4",
			"value": "National Australia Bank Ltd."
		},
		{
			"description": "Banco Pan, is a Brazilian midsize commercial bank headquartered in São Paulo. The bank main focus is granting consumer loans to individuals of lower to medium income brackets, such as consumer loans, payroll deduction loans, credit cards branded as Visa or MasterCard, insurance products, leasing, and group financial activities.",
			"meta": {
				"refs": [
					"https://www.bancopan.com.br/"
				]
			},
			"uuid": "f6114202-b617-11e9-a2a3-2a2ae2dbcce4",
			"value": "Banco Pan"
		},
		{
			"description": "The Single lending platform where you can get crypto credits, convert or buy crypto. Leverage crypto assets without selling them!",
			"meta": {
				"refs": [
					"https://www.youhodler.com/"
				]
			},
			"uuid": "f611436a-b617-11e9-a2a3-2a2ae2dbcce4",
			"value": "YouHodler"
		},
		{
			"description": "Capital One Financial Corporation is a bank holding company specializing in credit cards, auto loans, banking and savings accounts headquartered in McLean, Virginia. Capital One is ranked 10th on the list of largest banks in the United States by assets.",
			"meta": {
				"refs": [
					"https://www.capitalone.com/"
				]
			},
			"uuid": "f61144aa-b617-11e9-a2a3-2a2ae2dbcce4",
			"value": "Capital One Financial Corporation"
		},
		{
			"description": "Aegon Life Insurance Company is an Indian life insurance provider founded in 2008 with headquarters in Mumbai, offering individual and group insurance online and offline.",
			"meta": {
				"refs": [
					"https://www.aegonlife.com/"
				]
			},
			"uuid": "f6114874-b617-11e9-a2a3-2a2ae2dbcce4",
			"value": "Aegon Life Insurance Company"
		},
		{
			"description": "Monzo Bank Ltd, is a digital, mobile-only bank based in the United Kingdom. Originally operating through a mobile app and a prepaid debit card, in April 2017 their UK banking licence restrictions were lifted, enabling them to offer a current account.",
			"meta": {
				"refs": [
					"https://monzo.com/"
				]
			},
			"uuid": "328bf01a-bf82-11e9-9cb5-2a2ae2dbcce4",
			"value": "Monzo Bank Ltd"
		},
		{
			"description": "State Farm is a large group of insurance and financial services companies throughout the United States with corporate headquarters in Bloomington, Illinois.",
			"meta": {
				"refs": [
					"https://www.statefarm.com/"
				]
			},
			"uuid": "328bf29a-bf82-11e9-9cb5-2a2ae2dbcce4",
			"value": "State Farm"
		},
		{
			"description": "The European Central Bank is the central bank for the euro and administers monetary policy within the Eurozone, which comprises 19 member states of the European Union and is one of the largest monetary areas in the world.",
			"meta": {
				"refs": [
					"https://www.ecb.europa.eu/"
				]
			},
			"uuid": "b0f18ee2-c676-11e9-aa8c-2a2ae2dbcce4",
			"value": "European Central Bank"
		},
		{
			"description": "Mastercard Incorporated is an American multinational financial services corporation headquartered in the Mastercard International Global Headquarters in Purchase, New York, United States. The Global Operations Headquarters is located in O'Fallon, Missouri, United States, a municipality of St. Charles County, Missouri.",
			"meta": {
				"refs": [
					"https://www.mastercard.us/en-us.html"
				]
			},
			"uuid": "b0f19162-c676-11e9-aa8c-2a2ae2dbcce4",
			"value": "Mastercard "
		},
		{
			"description": "Invest in stocks, ETFs, options, and cryptocurrencies, all commission-free, right from your phone or desktop.",
			"meta": {
				"refs": [
					"https://robinhood.com/"
				]
			},
			"uuid": "e87f39be-cb2f-11e9-a1ac-2a2ae2dbcce4",
			"value": "Robinhood Financial LLC"
		},
		{
			"description": "Welcome to Providence Health Plan, a part of the integrated delivery system of Providence Health & Services. We provide or administer health coverage to more than 650,000 members nationwide. We continue to respond to the needs of the community by offering insurance for commercial groups, Medicare, Medicaid, individuals and families. We work with your physicians, hospitals and pharmacies to keep you healthy, and we strive to make your health care affordable.",
			"meta": {
				"refs": [
					"https://healthplans.providence.org/landing/"
				]
			},
			"uuid": "06a6b380-cdb6-11e9-a32f-2a2ae2dbcce4",
			"value": "Providence Health Plan"
		},
		{
			"description": "The American Express Company, also known as Amex, is an American multinational financial services corporation headquartered in Three World Financial Center in New York City. The company was founded in 1850 and is one of the 30 components of the Dow Jones Industrial Average.",
			"meta": {
				"refs": [
					"https://www.americanexpress.com/"
				]
			},
			"uuid": "3d0edb86-e86f-11e9-81b4-2a2ae2dbcce4",
			"value": "American Express"
		},
		{
			"description": "Humana Inc. is a for-profit American health insurance company based in Louisville, Kentucky. As of 2014 Humana had over 13 million customers in the U.S., reported a 2013 revenue of US 41.3 billion, and had 51,600 employees.",
			"meta": {
				"refs": [
					"https://www.humana.com/"
				]
			},
			"uuid": "3d0edf1e-e86f-11e9-81b4-2a2ae2dbcce4",
			"value": "Humana Inc."
		},
		{
			"description": "PJSC Sberbank is a state-owned Russian banking and financial services company headquartered in Moscow. The company was known as Sberbank of Russia until 2015. Sberbank has operations in several European and post-Soviet countries.",
			"meta": {
				"refs": [
					"https://www.sberbank.ru/"
				]
			},
			"uuid": "e472ead8-eea6-11e9-81b4-2a2ae2dbcce4",
			"value": "Sberbank of Russia"
		},
		{
			"description": "Geisinger Health Plan offers a variety of health insurance plans that meet your needs.",
			"meta": {
				"refs": [
					"https://www.geisinger.org/health-plan"
				]
			},
			"uuid": "7f87840a-f818-11e9-8f0b-362b9e155667",
			"value": "Geisinger Health Plan"
		},
		{
			"description": "Wells Fargo & Company is an American multinational financial services company headquartered in San Francisco, California, with central offices throughout the United States. It is the worlds fourth-largest bank by market capitalization and the fourth largest bank in the US by total assets.",
			"meta": {
				"refs": [
					"https://www.wellsfargo.com/"
				]
			},
			"uuid": "7f8786d0-f818-11e9-8f0b-362b9e155667",
			"value": "Wells Fargo & Company"
		},
		{
			"description": "UniCredit S.p.A. is an Italian global banking and financial services company. Its network spans 50 markets in 17 countries, with more than 8,500 branches and over 147,000 employees. Its strategic position in Western and Eastern Europe gives the group one of the region's highest market shares.",
			"meta": {
				"refs": [
					"https://www.unicreditgroup.eu/en.html"
				]
			},
			"uuid": "0845e94c-0333-11ea-8d71-362b9e155667",
			"value": "UniCredit S.p.A."
		},
		{
			"description": "Delta Dental covers 892,000 smiles in Arizona—more than any other dental benefits carrier in the state. With the largest network of dentists locally and nationally, we offer a full-range of plans to fit any budget and any size company. We're part of the Delta Dental Plans Association, the largest dental benefits carrier in the U.S.",
			"meta": {
				"refs": [
					"https://www.deltadentalaz.com/"
				]
			},
			"uuid": "162ac458-096c-11ea-8d71-362b9e155667",
			"value": "Delta Dental of Arizona"
		},
		{
			"description": "Part of the Blue Cross and Blue Shield Association, Florida Blue offers affordable health insurance to Individuals, Businesses, and Medicare.",
			"meta": {
				"refs": [
					"https://www.floridablue.com/"
				]
			},
			"uuid": "162ac7e6-096c-11ea-8d71-362b9e155667",
			"value": "Blue Cross and Blue Shield of Florida"
		},
		{
			"description": "Cayman National Corporation has been providing financial services in the Cayman Islands, locally and internationally to our clients for over thirty years.",
			"meta": {
				"refs": [
					"https://www.caymannational.com/"
				]
			},
			"uuid": "0af2eaf4-1144-11ea-9a9f-362b9e155667",
			"value": "Cayman National Corporation"
		},
		{
			"description": "Upbit is a South Korean cryptocurrency exchange.",
			"meta": {
				"refs": [
					"https://sg.upbit.com/"
				]
			},
			"uuid": "483dfa18-1534-11ea-8d71-362b9e155667",
			"value": "UPbit"
		},
		{
			"description": "Trident Crypto Fund is a crypto investment index fund. Trident Investment strategy is based on well researched Index Strategy and invests exclusively into top 10 underlying crypto assets with the highest market capitalization. Trident Investment strategy has been tested on historical data. With this strategy Trident index got more than 1400% returns in 2017 in comparison of bitcoin's return of near about 800%.",
			"meta": {
				"refs": [
					"https://tridentcryptofund.com/"
				]
			},
			"uuid": "60098318-6315-11ea-bc55-0242ac130003",
			"value": "Trident Crypto Fund"
		},
		{
			"description": "Efficient, dedicated and interactive enrollment. Submit an application to receive the best deals for your merchants. Fast approvals and same day funding. We value our partnerships and offer an unmatched level of professionalism. Contact us today for investment opportunities. Advantage experts work around the clock to bring you the best funding solutions.",
			"meta": {
				"refs": [
					"http://www.advantagecapitalfunding.com/about-us/"
				]
			},
			"uuid": "f9251e0c-691b-11ea-bc55-0242ac130003",
			"value": "Advantage Capital Funding"
		},
		{
			"description": "At Argus Capital Funding, our number one priority is to provide fast working capital to businesses without the hassle and delays of dealing with a traditional bank. We provide solutions for business owners who require capital for their business’ day-to-day operations and expansion opportunities. We help our clients get approved for financing. Many business owners have been denied traditional loans by their banks and other lending institutions. When reviewing your application, we concentrate on your business’s present revenue, future potential and growth, not your personal credit score. We are located in Lower Manhattan, NY. Contact us today to learn more about receiving a Merchant Cash Advance from Argus Capital Funding. With no collateral required, our approval rates for applicants is over 90% and most businesses are funded within 24-72 hours or less.",
			"meta": {
				"refs": [
					"http://www.arguscapitalfunding.com/#aboutus"
				]
			},
			"uuid": "f9252078-691b-11ea-bc55-0242ac130003",
			"value": "Argus Capital Funding"
		},
		{
			"description": "The Jamaica National Group Limited represents one of Jamaica’s pre-eminent and most recognizable brands, with over 14 decades of history in Jamaica and overseas. The Group is comprised of several world-leading entities which provide a wide array of financial, technology, creative and fleet management services, among others. On February 1, 2017, the 142-year old Jamaica National Building Society (JNBS) was restructured and The Jamaica National Group established.  The deposit-taking arm of the Society was converted to JN Bank, the third largest commercial bank in Jamaica. With membership as the ethos of its operations, The Jamaica National Group will, as its predecessor, JNBS, ensure that the Group remains as a leading performer among mixed conglomerates in the region, and that its performance directly benefits the people and communities that its subsidiaries serve. The Jamaica National Group is committed to the success and growth of its members while using business as a force for good so that, together, we can improve the outcome of Jamaicans wherever they may reside.",
			"meta": {
				"refs": [
					"https://www.jngroup.com/about-us/",
					"https://www.jngroup.com/"
				]
			},
			"uuid": "e5c7c284-6eab-11ea-bc55-0242ac130003",
			"value": "Jamaica National Group Ltd."
		},
		{
			"description": "Chubb Limited, incorporated in Zurich, Switzerland, is the parent company of Chubb, a global provider of insurance products covering property and casualty, accident and health, reinsurance, and life insurance and the largest publicly traded property and casualty company in the world.",
			"meta": {
				"refs": [
					"https://www.chubb.com/us-en/"
				]
			},
			"uuid": "5d32d30c-729b-11ea-bc55-0242ac130003",
			"value": "Chubb Limited"
		},
		{
			"description": "Banca Monte dei Paschi di Siena S.p.A., known as BMPS or just MPS, is an Italian bank. Tracing its history to a mount of piety founded in 1472 (548 years ago) and founded in its present form in 1624 (396 years ago), it is the world's oldest or second oldest bank, depending on the definition, and the fourth largest Italian commercial and retail bank. In 1995 the bank, then known as Monte dei Paschi di Siena, was transformed from a statutory corporation to a limited company called Banca Monte dei Paschi di Siena (Banca MPS). The Fondazione Monte dei Paschi di Siena was created to continue the charitable functions of the bank and to be, until the bailout in 2013, its largest single shareholder. Today Banca MPS has approximately 2,000 branches, 26,000 employees and 5.1 million customers in Italy, as well as branches and businesses abroad. A subsidiary, MPS Capital Services, handles corporate and investment banking.",
			"meta": {
				"refs": [
					"https://en.wikipedia.org/wiki/Banca_Monte_dei_Paschi_di_Siena"
				]
			},
			"uuid": "9ff9380e-7d84-11ea-bc55-0242ac130003",
			"value": "Banca Monte dei Paschi di Siena S.p.A."
		},
		{
			"description": "Banco de Costa Rica is a state-owned commercial bank that operates in Costa Rica. With an equity of $806,606,710 and assets of $7,607,483,881, the bank has established itself as one of the strongest banking companies in both Costa Rica and Central America.",
			"meta": {
				"refs": [
					"https://www.bancobcr.com/"
				]
			},
			"uuid": "af5a99f0-8fcc-11ea-bc55-0242ac130003",
			"value": "Banco de Costa Rica"
		},
		{
			"description": "BlockFi provides the wealth management products cryptoinvestors need, all powered by blockchain technology.",
			"meta": {
				"refs": [
					"https://blockfi.com/"
				]
			},
			"uuid": "aaeb242a-9acb-11ea-bb37-0242ac130002",
			"value": "Blockfi Lending LLC"
		},
		{
			"description": "The Bank of America Corporation is an American multinational investment bank and financial services company headquartered in Charlotte, with central hubs in New York City, London, Hong Kong, Dallas, and Toronto.",
			"meta": {
				"refs": [
					"https://www.bankofamerica.com/"
				]
			},
			"uuid": "17c89e48-a043-11ea-bb37-0242ac130002",
			"value": "The Bank of America Corporation"
		},
		{
			"description": "Santander Bank, N. A., formerly Sovereign Bank, is a wholly owned subsidiary of Spanish Santander Group. It is based in Boston and its principal market is the northeastern United States.",
			"meta": {
				"refs": [
					"https://myaccount.santanderconsumerusa.com/"
				]
			},
			"uuid": "17c8a082-a043-11ea-bb37-0242ac130002",
			"value": "Santander Bank, N. A."
		},
		{
			"description": "The Desjardins Group is a Canadian financial services cooperative and the largest federation of credit unions in North America. It was founded in 1900 in Levis, Quebec by Alphonse Desjardins. While its legal headquarters remains in Levis, most of the executive management, including the CEO, is based in Montreal.",
			"meta": {
				"refs": [
					"https://www.desjardins.com/ca/index.jsp"
				]
			},
			"uuid": "17c8a1e0-a043-11ea-bb37-0242ac130002",
			"value": "The Desjardins Group"
		},
		{
			"description": "MyBudget is an Australian financial services company based in Adelaide, Australia, which provides spending management services including through an app.",
			"meta": {
				"refs": [
					"https://www.mybudget.com.au/"
				]
			},
			"uuid": "c555df08-a5ca-11ea-bb37-0242ac130002",
			"value": "MyBudget"
		},
		{
			"description": "With the student loan crisis becoming an out of control epidemic for individuals and families across the United States, Student Advocates seeks to relieve some of the stress and burden of this growing problem. Student Advocates is a privately owned company that helps consumers identify programs that may be suitable to each of their unique situation, gather the relevant application documents, and then prepare those documents for our clients review and submission.  Our services are reasonably priced and our goal is to take the frustration out of the process.",
			"meta": {
				"refs": [
					"https://www.linkedin.com/company/student-advocates/about/"
				]
			},
			"uuid": "52bd25ac-ab45-11ea-bb37-0242ac130002",
			"value": "Student Advocates LLC"
		},
		{
			"description": "Toss is a Korea-based mobile finance platform.",
			"meta": {
				"refs": [
					"https://www.crunchbase.com/organization/toss"
				]
			},
			"uuid": "52bd27d2-ab45-11ea-bb37-0242ac130002",
			"value": "Viva Republica (Toss)"
		},
		{
			"description": "Coinsquare is Canada’s premier cryptocurrency trading platform for trading Bitcoin, Ethereum, XRP, and other digital currencies.",
			"meta": {
				"refs": [
					"https://www.crunchbase.com/organization/coinsquare"
				]
			},
			"uuid": "e2c2cc28-b09b-11ea-b3de-0242ac130004",
			"value": "Coinsquare Ltd."
		},
		{
			"description": "About us. Founded in 1997, eHealth is the nation's leading private health insurance marketplace. Millions of individuals, families and small businesses use our top-rated tools to compare and purchase health insurance from leading insurers like Aetna, Humana, Kaiser Permanente and Wellpoint.",
			"meta": {
				"refs": [
					"https://www.ehealthinsurance.com/"
				]
			},
			"uuid": "e2c2ce4e-b09b-11ea-b3de-0242ac130004",
			"value": "eHealth, Inc."
		},
		{
			"description": "Genworth Financial is an S&P 400 insurance company. The firm was founded as The Life Insurance Company of Virginia in 1871. In 1986, Life of Virginia was acquired by Combined Insurance, which became Aon plc in 1987. In 1996, Life of Virginia was sold to GE Capital.",
			"meta": {
				"refs": [
					"https://www.genworth.com/"
				]
			},
			"uuid": "e2c2cf48-b09b-11ea-b3de-0242ac130004",
			"value": "Genworth Financial"
		},
		{
			"description": "Postbank is a bank by South Africans for South Africans. And as South Africans we all have dreams. Whether you are saving for your dream house or growing your business, at Postbank we want to help make all those dreams come true. Whatever your needs, you can count on Postbank to have a simple solution designed for easy understanding. Besides, our aim is to ensure that whatever you sign up for, you are able to see the transparent benefits we offer. As a state owned institution, our mandate is to help uplift you from whatever position you find yourself. So don’t be surprised if you walk into any one of our branches and find a friendly face that greats you with a smile that makes you feel at home. If your first language is not English, rest assured that you will find someone within any of our branches that can communicate with you in your mother tongue. Besides, you are a customer to us, and we strive to make you feel special, in whatever way possible.",
			"meta": {
				"refs": [
					"https://www.postbank.co.za/aboutus.html"
				]
			},
			"uuid": "e2c2d18c-b09b-11ea-b3de-0242ac130004",
			"value": "Postbank (South Africa)"
		},
		{
			"description": "The Indiabulls Group is an Indian conglomerate headquartered in Gurgaon, India. Its primary businesses are housing finance, consumer finance, and wealth management. The Group also has a presence in real estate and pharmaceuticals.",
			"meta": {
				"refs": [
					"https://en.wikipedia.org/wiki/Indiabulls#:~:text=The%20Indiabulls%20Group%20is%20an,in%20real%20estate%20and%20pharmaceuticals."
				]
			},
			"uuid": "323660e8-b6e7-11ea-b3de-0242ac130004",
			"value": "Indiabulls Group"
		},
		{
			"description": "On January 1, 2016 Heartland Farm Mutual Inc. became a legal entity, formed from the merger of North Waterloo Farmers Mutual and Oxford Mutual. These two parent companies bring together a combined total of more than 250 years of experience serving rural Ontario's insurance needs. Heartland Farm Mutual is in your community. Whether you're a farmer, homeowner, or business owner, today, more than ever, people like you appreciate the value of the mutual insurance alternative.",
			"meta": {
				"refs": [
					"https://www.linkedin.com/company/heartland-farm-mutual/about/"
				]
			},
			"uuid": "3714a2c8-c1e6-11ea-b3de-0242ac130004",
			"value": "Heartland Farm Mutual"
		},
		{
			"description": "With 3.8 million beneficiaries, Hapvida's superlative figures show the success of a strategy based on the direct management of the operation and constant investments. ",
			"meta": {
				"refs": [
					"https://www.linkedin.com/company/hapvida/about/"
				]
			},
			"uuid": "3714a502-c1e6-11ea-b3de-0242ac130004",
			"value": "Hapvida Health"
		},
		{
			"description": "As the third largest not-for-profit health system in the United States, we are committed to providing for the needs of our communities – especially for those who are poor and vulnerable –  across Alaska, California, Montana, Oregon and Washington.",
			"meta": {
				"refs": [
					"https://healthplans.providence.org/",
					"https://www.linkedin.com/company/providence-health-and-services/about/"
				]
			},
			"uuid": "f53ea4d8-cce0-11ea-87d0-0242ac130003",
			"value": "Providence Health Plan"
		},
		{
			"description": "eToro is a social trading and multi-asset brokerage company that focuses on providing financial and copy trading services. It has registered offices in Cyprus, Israel, the United Kingdom, the United States, and Australia. In 2018, the company’s value was $800 million.",
			"meta": {
				"refs": [
					"https://www.etoro.com/en-us/"
				]
			},
			"uuid": "f53ea6ea-cce0-11ea-87d0-0242ac130003",
			"value": "eToro"
		},
		{
			"description": "Dave helps the 4 in 5 Americans who live paycheck to paycheck thrive, not just survive. The company is a financial ecosystem that empowers all Americans with the tools they need to live stable financial lives. Three million users engage with Dave to budget and avoid the $30B+ in overdraft fees that the country’s biggest banks collect each year.",
			"meta": {
				"refs": [
					"https://www.linkedin.com/company/dave.com/about/"
				]
			},
			"uuid": "8706951e-d336-11ea-87d0-0242ac130003",
			"value": "Dave (Financial Application)"
		},
		{
			"description": "Created in 2009 by entrepreneurs from Rio Grande do Sul, Vakinha is the first Brazilian crowdfunding fintech and, currently, the largest online kitten platform in Brazil. There are more than 40 thousand cows raised every month and a few million reais in donations for all kinds of purposes: health, solidarity, education, culture, sports, animals, products, weddings, trips, parties, gifts and many others. We are proud to be making a positive impact on hundreds of thousands of people. We were identified as one of the crowdfunding companies to have on the radar of investors in Latin America by the Fintech Enterprise in Latin America study, done by the Inter-American Development Bank (IDB) and Finnovista, an organization that promotes the development of fintechs. We are proud of the work we have done and we always want to be able to make the donation process even easier.",
			"meta": {
				"refs": [
					"https://www.linkedin.com/company/vakinha-internet-ltda./about/"
				]
			},
			"uuid": "2409e1d8-d7ea-11ea-87d0-0242ac130003",
			"value": "Vakinha"
		},
		{
			"description": "Kiwibank Limited is a subsidiary of the state-owned enterprise New Zealand Post Limited, New Zealand Superannuation and the Accident Compensation Corporation. Kiwibank provides some of its banking services through its PostShops and more recently through financial services only branches as well.",
			"meta": {
				"refs": [
					"https://www.kiwibank.co.nz/"
				]
			},
			"uuid": "2409e3ea-d7ea-11ea-87d0-0242ac130003",
			"value": "Kiwibank Limited"
		},
		{
			"description": "PT Finansia Multi Finance was founded in 1994 by a consortium of local banking executives – including the current President Director. FMF received its multifinance licence in 1994 and is fully licenced to conduct a full range of multifinance activities including consumer finance, leasing, factoring and credit cards. Today, FMF and its kreditplus  brand are established as leading players within the multifinance sector with a focus on the used motorcycle financing, used car financing and white goods financing segments. As at 30 June 2014, FMF finances 772,234 customers through a proprietary distribution network of 313 branches (or) POS outlets and supported by a workforce of 13,682 employees.",
			"meta": {
				"refs": [
					"https://www.linkedin.com/company/kreditplus/about/"
				]
			},
			"uuid": "2409e502-d7ea-11ea-87d0-0242ac130003",
			"value": "PT. Finansia Multi Finance (Kreditplus)"
		},
		{
			"description": "2gether is a collaborative financial platform that accelerate the world's transition to decentralized finance.",
			"meta": {
				"refs": [
					"https://www.crunchbase.com/organization/2gether"
				]
			},
			"uuid": "9eb1be66-e090-11ea-87d0-0242ac130003",
			"value": "2gether"
		},
		{
			"description": "Hampshire Hospitals NHS Foundation Trust is an NHS Foundation Trust providing services in Hampshire and parts of west Berkshire. It was established in January 2012 as the result of the integration of Basingstoke and North Hampshire NHS Foundation Trust and Winchester and Eastleigh Healthcare Trust.",
			"meta": {
				"refs": [
					"https://www.hampshirehospitals.nhs.uk/"
				]
			},
			"uuid": "9eb1c10e-e090-11ea-87d0-0242ac130003",
			"value": "Hampshire Hospitals NHS Foundation Trust"
		},
		{
			"description": "Pepperstone is a broker specialising in financial markets access. The company is headquartered in Melbourne, Australia. It provides access to more than 150 instruments including Forex, index, share, commodities, cryptocurrencies and currency index CFDs.",
			"meta": {
				"refs": [
					"https://pepperstone.com/"
				]
			},
			"uuid": "9eb1c2a8-e090-11ea-87d0-0242ac130003",
			"value": "Pepperstone"
		},
		{
			"description": "Banco del Estado de Chile, commercially operating under the brand BancoEstado, is the only Public Bank in Chile and was created by government decree in 1953.",
			"meta": {
				"refs": [
					"https://www.bancoestado.cl/"
				]
			},
			"uuid": "95142342-f820-11ea-adc1-0242ac120002",
			"value": "Banco del Estado de Chile"
		},
		{
			"description": "Fully compliant with existing financial regulations, ETERBASE is Europe’s premier digital assets exchange. Unique for its customer-centric, regulation-compliant trading platform, which offers ultra-fast trading and a powerful interface, ETERBASE is setting the gold standard in the digital assets exchange landscape.",
			"meta": {
				"refs": [
					"https://www.linkedin.com/company/eterbase/about/"
				]
			},
			"uuid": "95142572-f820-11ea-adc1-0242ac120002",
			"value": "ETERBASE a.s."
		},
		{
			"description": "SegurCaixa Adeslas is the leading Non-Life company in Spain in health insurance. Integrated in the Mutua Madrileña Group and owned by Caixabank, the company also operates in other lines such as Home, Auto or Accidents, among others.",
			"meta": {
				"refs": [
					"https://www.linkedin.com/company/segurcaixa-adeslas/about/"
				]
			},
			"uuid": "9514266c-f820-11ea-adc1-0242ac120002",
			"value": "SegurCaixa Adeslas"
		},
		{
			"description": "CU Recovery, a PSCU company, is a full-service collection agency managing non-performing and charged-off loans with a comprehensive menu of third-party collection services. Since 1990, CU Recovery has worked with over 2700 credit unions nationwide, and is a leading industry expert for credit union collections of all loan types.  The Loan Service Center provides first-party collection services to minimize loan loss by managing early stage delinquency.",
			"meta": {
				"refs": [
					"https://www.linkedin.com/company/cu-recovery-inc-/about/"
				]
			},
			"uuid": "9514273e-f820-11ea-adc1-0242ac120002",
			"value": "CU Recovery, Inc."
		},
		{
			"description": "The Trade and Development Bank (TDB), formerly the PTA Bank, is a trade and development financial institution operating in eastern and southern Africa. TDB is the financial arm of the Common Market for Eastern and Southern Africa (COMESA), although membership is open to non-COMESA states and other institutional shareholders.",
			"meta": {
				"refs": [
					"https://en.wikipedia.org/wiki/Trade_and_Development_Bank"
				]
			},
			"uuid": "95142806-f820-11ea-adc1-0242ac120002",
			"value": "The Trade and Development Bank (Seychelles)"
		},
		{
			"description": "KuCoin is one of the fastest growing cryptocurrency exchanges in the world.  As The People's Exchange,​ KuCoin is easy to use for novice investors and in depth enough for crypto enthusiasts. They have a wide range of altcoins on the exchange and are adding new ones regularly. The exchange is quick to identify up and coming coins with the best blockchain technology applications. Their ability to choose tokens that users are interested in has shot them to Unicorn Status faster than any other company in history at just 3 1/2 months as a startup reaching 1 billion in value.",
			"meta": {
				"refs": [
					"https://www.linkedin.com/company/kucoin/"
				]
			},
			"uuid": "f1bf2be4-0321-11eb-adc1-0242ac120002",
			"value": "KuCoin Exchange"
		},
		{
			"description": "Arthur J. Gallagher & Co. is a US-based global insurance brokerage and risk management services firm headquartered in Rolling Meadows, Illinois. The firm was established in 1927 and is one of the largest insurance brokers in the world.",
			"meta": {
				"refs": [
					"https://www.ajg.com/"
				]
			},
			"uuid": "dabf918e-08a0-11eb-adc1-0242ac120002",
			"value": "Arthur J. Gallagher & Co."
		},
		{
			"description": "The Ardonagh Group is the UK's largest independent insurance broker with global reach. We are a network of over 100 office locations and a workforce of nearly 7,000 people.",
			"meta": {
				"refs": [
					"https://www.linkedin.com/company/the-ardonagh-group/about/"
				]
			},
			"uuid": "b2e6c2e6-0e17-11eb-adc1-0242ac120002",
			"value": "The Ardonagh Group"
		},
		{
			"description": "Scalable Capital was founded in 2014 with the mission to use modern technology to provide a broad group of investors with access to a form of investment that was previously reserved for very wealthy investors. In 2020, Scalable Capital expanded its offering. In addition to digital wealth management, it now also includes a newly developed neo-broker, through which clients can trade shares, ETFs and funds conveniently and affordably.",
			"meta": {
				"refs": [
					"https://www.linkedin.com/company/scalable-capital/about/"
				]
			},
			"uuid": "86c79d30-1929-11eb-adc1-0242ac120002",
			"value": "Scalable Capital"
		},
		{
			"description": "Harvest Small Business Finance, LLC is a commercial real estate finance lender based in Laguna Hills, CA.  Through a strategic partnership between Medalist Partners, LP (Medalist​) and Harvest’s Senior Management Team, the company acquired a Small Business Lending Company license that allows it to originate and service loans pursuant to the Small Business Administration’s 7(a) loan program.  Through an affiliate, we are also in the process of developing a proprietary Small Balance Commercial Loan product along with unprecedented access to the secondary markets which will further our objective of becoming the country’s premier non-bank commercial real estate lender to small business. It is our mission is to help our customers achieve financial freedom while bringing employment opportunities to their surrounding communities.",
			"meta": {
				"refs": [
					"https://www.linkedin.com/company/harvest-small-business-finance-llc/about/"
				]
			},
			"uuid": "b26a50ec-1e9f-11eb-adc1-0242ac120002",
			"value": "Harvest Small Business Finance, LLC"
		},
		{
			"description": "IberiaBank Corporation, stylized as IBERIABANK, is an American financial holding company headquartered in Lafayette, Louisiana, and is the largest bank based in the state.",
			"meta": {
				"refs": [
					"https://www.iberiabank.com/personal/"
				]
			},
			"uuid": "b26a5308-1e9f-11eb-adc1-0242ac120002",
			"value": "IberiaBank Corporation"
		},
		{
			"description": "Folksam is one of the largest insurance companies in Sweden. The company headquarters are located in Stockholm. Folksam consists of the two mutual insurance companies Folksam sak and Folksam liv. Folksam is today a Swedish insurance company only, after the sale in 2001 of the English subsidiary Folksam International.",
			"meta": {
				"refs": [
					"https://www.folksam.se/"
				]
			},
			"uuid": "51e6159e-243a-11eb-adc1-0242ac120002",
			"value": "Folksam"
		},
		{
			"description": "55 million members are experiencing our vision of how benefits should be. From the moment you get to know EyeMed Vision Care, you’ll notice something different. By providing more of what’s best in vision benefits, not more of the same, we've become  America’s fastest growing vision benefits company.",
			"meta": {
				"refs": [
					"https://www.linkedin.com/company/eyemed-vision-care/about/"
				]
			},
			"uuid": "51e61670-243a-11eb-adc1-0242ac120002",
			"value": "EyeMed Vision Care"
		},
		{
			"description": "Trillium Community Health Plan is a leader in providing the most responsive customer service, outstanding coordination of care, and innovative health care through an extensive group of providers. Trillium has coordinated the health care of our members with physicians in the community to allow for improved care and access to services.",
			"meta": {
				"refs": [
					"https://www.trilliumohp.com/about-us.html"
				]
			},
			"uuid": "f90b2f6c-833f-11eb-8dcd-0242ac130003",
			"value": "Trillium Community Health Plan"
		},
		{
			"description": "The Nova Scotia Health Employees' Pension Plan(NSHEPP) is jointly sponsored by Health Association Nova Scotia and four unions, CUPE, Unifor, NSGEU and NSNU. Established on January 1, 1961, the Plan is a comprehensive and competitive.",
			"meta": {
				"refs": [
					"https://www.nshepp.ca/index.aspx",
					"https://www.nshepp.ca/aboutPlan.aspx"
				]
			},
			"uuid": "f90b3246-833f-11eb-8dcd-0242ac130003",
			"value": "Nova Scotia Health Employees’ Pension Plan"
		},
		{
			"description": "Flagstar Bank is a bank headquartered in Michigan. It is the primary subsidiary of Flagstar Bancorp, Inc., a bank holding company. It is one of the largest residential mortgage servicers and is on the list of largest banks in the United States.",
			"meta": {
				"refs": [
					"https://www.flagstar.com/"
				]
			},
			"uuid": "e65b00be-872b-11eb-8dcd-0242ac130003",
			"value": "Flagstar Bank"
		},
		{
			"description": "K.L.S CAPITAL LTD is located in TIRAT CARMEL, Israel and is part of the Lending Industry. K.L.S CAPITAL LTD has 25 employees at this location and generates 8.02 million in sales (USD). There are 2 companies in the K.L.S CAPITAL LTD corporate family.",
			"meta": {
				"refs": [
					"https://www.dnb.com/business-directory/company-profiles.kls_capital_ltd.d3be4a000f78726b8b00e935f8ad2753.html"
				]
			},
			"uuid": "e65b01a4-872b-11eb-8dcd-0242ac130003",
			"value": "K.L.S. Capital Ltd"
		},
		{
			"description": "PPS offers tailor-made insurance, investment and healthcare solutions exclusively for graduate professionals with an honours level equivalent or higher qualification, from a public institution or certain listed private institutions.",
			"meta": {
				"refs": [
					"https://www.pps.co.za/our-story"
				]
			},
			"uuid": "e65b02e4-872b-11eb-8dcd-0242ac130003",
			"value": "PPS, South Africa"
		},
		{
			"description": "Arizona Complete Health offers health insurance plans that fit the unique needs of our members. AzCH proudly serves Arizonans through Medicare, Marketplace & Medicaid health plans.",
			"meta": {
				"refs": [
					"https://www.linkedin.com/company/arizonacompletehealth/about/"
				]
			},
			"uuid": "7d82cf92-8b11-11eb-8dcd-0242ac130003",
			"value": "Arizona Complete Health"
		},
		{
			"description": "FBS is a one-stop source of online trading solutions for investors all over the world. It has been around since 2009, ending up with 14 million clients and a whopping range of brokerage services - because there are all sorts of Forex knights out there, and each one needs the armor to fit.",
			"meta": {
				"refs": [
					"https://www.linkedin.com/company/fbs-inc-/about/",
					"https://fbs.com/about"
				]
			},
			"uuid": "ff543f2c-8f32-11eb-8dcd-0242ac130003",
			"value": "FBS Inc."
		},
		{
			"description": "CNA Financial Corporation is a financial corporation based in Chicago, Illinois, United States. Its principal subsidiary, Continental Casualty Company, was founded in 1897. CNA, the current parent company, was incorporated in 1967. CNA is the seventh largest commercial insurer in the United States as of 2018.",
			"meta": {
				"refs": [
					"https://www.cna.com/"
				]
			},
			"uuid": "ff5441e8-8f32-11eb-8dcd-0242ac130003",
			"value": "CNA Financial"
		},
		{
			"description": "MobiKwik is an Indian company founded in 2009 that provides a mobile phone based payment system and digital wallet. Customers add money to an online wallet that can be used for payments.",
			"meta": {
				"refs": [
					"https://www.mobikwik.com/"
				]
			},
			"uuid": "d9beb50c-962c-11eb-a8b3-0242ac130003",
			"value": "MobiKwik"
		},
		{
			"description": "Cardpool is a gift card exchange service for individuals to buy, sell and trade their new or pre-owned gift cards.",
			"meta": {
				"refs": [
					"https://www.crunchbase.com/organization/cardpool"
				]
			},
			"uuid": "8730eb6e-a2a9-11eb-bcbc-0242ac130002",
			"value": "Cardpool"
		},
		{
			"description": "CareFirst BlueCross BlueShield Community Health Plan District of Columbia (CareFirst CHPDC) is a for-profit healthcare company which offers a comprehensive portfolio of health insurance benefits and services to over 66,000 enrollees in the District of Columbia. Since 2013, our team has provided comprehensive managed care services to Medicaid recipients in the District of Columbia through a consumer-centric, high-touch health plan focused on personal enrollee engagement. CareFirst CHPDC is committed to providing care to the region's most vulnerable and diverse populations including children, the elderly and people living with disabilities.",
			"meta": {
				"refs": [
					"https://www.carefirstchpdc.com/why-carefirst-chpdc.html"
				]
			},
			"uuid": "8730edee-a2a9-11eb-bcbc-0242ac130002",
			"value": "CareFirst BlueCross BlueShield Community Health Plan District of Columbia (CareFirst CHPDC)"
		},
		{
			"description": "Upstox was founded with the vision of making financial investing easy, equitable, and affordable to all Indian investors. It offers online investments in stocks, derivatives, commodities, currencies, mutual funds and ETFs for both professional traders and investors. It has also ensured full transparency in pricing by offering zero brokerage on equity delivery trades and up to Rs. 20 per order for intraday, F&O, commodities, and currencies.",
			"meta": {
				"refs": [
					"https://www.linkedin.com/company/upstox/about/"
				]
			},
			"uuid": "8730eefc-a2a9-11eb-bcbc-0242ac130002",
			"value": "Upstox"
		},
		{
			"description": "Cryptocurrency exchange provider.",
			"meta": {
				"refs": [
					"https://celsius.network/"
				]
			},
			"uuid": "4903b440-a69e-11eb-bcbc-0242ac130002",
			"value": "Celsius Network"
		},
		{
			"description": "Nissan Century Securities Co.,Ltd. was founded in 2006. The Company's line of business includes the purchase, sale, and brokerage of securities.",
			"meta": {
				"refs": [
					"https://www.bloomberg.com/profile/company/NSSEZ:JP"
				]
			},
			"uuid": "180a7882-a9d8-11eb-bcbc-0242ac130002",
			"value": "Nissan Securities Co., Ltd."
		},
		{
			"description": "First Horizon Bank, formerly First Tennessee Bank, is a financial services company based in Memphis, Tennessee. The leading subsidiary of First Horizon National Corporation, it provides financial services through more than 180 locations in and around Tennessee. The company was founded during the Civil War in 1864.",
			"meta": {
				"refs": [
					"https://www.firsthorizon.com/"
				]
			},
			"uuid": "180a7a8a-a9d8-11eb-bcbc-0242ac130002",
			"value": "First Horizon Bank"
		},
		{
			"description": "Italian cooperative bank based in Rome.",
			"meta": {
				"refs": [
					"https://m.wikidata.org/wiki/Q25060394"
				]
			},
			"uuid": "180a7b70-a9d8-11eb-bcbc-0242ac130002",
			"value": "Banca di Credito Cooperativo di Roma (BCC)"
		},
		{
			"description": "Our goal is to be the lender of choice for the professional real estate agent and their clients in each market we enter, as measured by all industry service level surveys reported. We will succeed by meeting the needs of our borrowers through exceptional communication and transparency throughout the loan process and conducting our business with absolute integrity. AmeriFirst Financial's people will be the source of our competitive advantage. We will distinguish ourselves by creating an environment that fosters teamwork and innovation. We will utilize our team’s abilities to the fullest while at the same time treating each other with dignity and respect.",
			"meta": {
				"refs": [
					"https://www.linkedin.com/company/amerifirst-financial-inc./about/"
				]
			},
			"uuid": "1815aa34-ae71-11eb-8529-0242ac130003",
			"value": "AmeriFirst Financial, Inc."
		},
		{
			"description": "A cryptocurrency trading platform.",
			"meta": {
				"refs": [
					"https://www.linkedin.com/company/hotbitexchange/about/"
				]
			},
			"uuid": "1815adcc-ae71-11eb-8529-0242ac130003",
			"value": "Hotbit"
		},
		{
			"description": "Noblr wants to create friendlier, safer roads for everyone by building a community of responsible drivers, or as we like to call them, Noblr members. By rewarding our members'​ good driving habits, we believe that Noblr can help smart people make even smarter decisions when it comes to getting around – wherever, however, and whenever. Noblr is a new kind of car insurance company that uses the latest technology to provide a seamless quote-to-claim experience, getting drivers safely and economically from point a to point b.",
			"meta": {
				"refs": [
					"https://www.linkedin.com/company/noblr/about/"
				]
			},
			"uuid": "a847587a-b707-11eb-8529-0242ac130003",
			"value": "Noblr Car Insurance"
		},
		{
			"description": "United Overseas Bank Limited is a Singaporean multinational banking organisation headquartered in Singapore, with branches mostly found in most Southeast Asian countries.",
			"meta": {
				"refs": [
					"https://www.uobgroup.com/uobgroup/index.page"
				]
			},
			"uuid": "a8475942-b707-11eb-8529-0242ac130003",
			"value": "United Overseas Bank Limited"
		},
		{
			"description": "SEIU 775 Benefits Group is the nation’s leading organization dedicated to improving the skills, health and sustainability of the home care workforce. Leading with innovation and technology, SEIU 775 Benefits Group partners with government, labor and private industry ensuring that Washington home care workers have access to the skills and benefits they need to thrive. It serves 50,000 caregivers through health and wellness programs and provides 18,000 caregivers with affordable, high-quality medical, prescription and dental plans. Based on enrollment, SEIU 775 Benefits Group is Washington’s second-largest educational institution, providing an estimated 2.1 million hours of essential home care training since 2010. By caring for those who care for others, SEIU 775 Benefits Group is leading the transformation of home care into a thriving career and helping prevent the looming care crisis.",
			"meta": {
				"refs": [
					"https://www.linkedin.com/company/seiu-775-benefits-group/about/"
				]
			},
			"uuid": "a8475a00-b707-11eb-8529-0242ac130003",
			"value": "SEIU 775 Benefits Group"
		},
		{
			"description": "Axa S.A. is a French multinational insurance firm. The head office is in the 8th arrondissement of Paris. It also provides investment management and other financial services.",
			"meta": {
				"refs": [
					"https://www.axa.com/"
				]
			},
			"uuid": "f607466e-bc99-11eb-8529-0242ac130003",
			"value": "Axa S.A."
		},
		{
			"description": "Meezan Bank is the first and largest Islamic commercial Bank of Pakistan. The Bank is headquartered in Meezan House - Karachi, Pakistan. It has a network of over 660 branches in more than 159 cities of Pakistan.",
			"meta": {
				"refs": [
					"https://www.meezanbank.com/"
				]
			},
			"uuid": "913656ca-4b22-11e9-8646-d663bd873d93",
			"value": "Meezan Bank"
		}
	],
	"version": 32
}
