{
	"category": "BLS-NAICS-622",
	"description": "Industries in the Hospitals subsector provide medical, diagnostic, and treatment services that include physician, nursing, and other health services to inpatients and the specialized accommodation services required by inpatients. Hospitals may also provide outpatient services as a secondary activity. Establishments in the Hospitals subsector provide inpatient health services, many of which can only be provided using the specialized facilities and equipment that form a significant and integral part of the production process.",
	"name": "BLS-NAICS-622",
	"source": "BLS Industries at a Glance",
	"type": "BLS-NAICS-622",
	"uuid": "712b51f4-4826-11e9-8646-d663bd873d93",
	"values": [{
			"description": "Test place holder",
			"meta": {
				"refs": [
					"https://www.bls.gov/iag/tgs/iag622.htm"
				]
			},
			"uuid": "f56c4312-48ec-11e9-8646-d663bd873d93",
			"value": "Test Hospitals Value"
		},
		{
			"description": "Rush University Medical Center is an academic medical center located in Chicago, Illinois, with a patient capacity of 664. It includes hospital facilities for adults and children. The hospital also includes the Johnston R. Bowman Health Center. It is affiliated with Rush University.",
			"meta": {
				"refs": [
					"https://www.rush.edu/"
				]
			},
			"uuid": "effb6954-4b2f-11e9-8646-d663bd873d93",
			"value": "Rush University Hospital"
		},
		{
			"description": "Sparrow Hospital is a 733-bed teaching hospital located in Lansing, Michigan that provides care for the greater Mid-Michigan region. The hospital is a subsidiary of Sparrow Health System, and is affiliated with the Colleges of Human Medicine and Osteopathic Medicine at nearby Michigan State University.",
			"meta": {
				"refs": [
					"http://www.sparrow.org/"
				]
			},
			"uuid": "21ab220a-4b30-11e9-8646-d663bd873d93",
			"value": "Sparrow Hospital"
		},
		{
			"description": "Mary Free Bed Rehabilitation Hospital is a 167-bed acute care inpatient rehabilitation hospital for children and adults who have experienced a brain injury, spinal cord injury, stroke, amputation, or other injury or illness requiring physical rehabilitation.",
			"meta": {
				"refs": [
					"https://www.maryfreebed.com/"
				]
			},
			"uuid": "46f5a076-4b30-11e9-8646-d663bd873d93",
			"value": "Mary Free Bed Rehabilitation Hospital"
		},
		{
			"description": "Northwestern Memorial Hospital is a nationally ranked academic medical center hospital located in downtown Chicago, Illinois. It is the primary teaching hospital for Northwestern University's Feinberg School of Medicine.",
			"meta": {
				"refs": [
					"https://www.nm.org/"
				]
			},
			"uuid": "b0e4b0d0-4b30-11e9-8646-d663bd873d93",
			"value": "Northwestern Memorial Hospital"
		},
		{
			"description": "The Oklahoma Heart Hospital is an all-digital heart hospital specializing in cardiovascular, pulmonary and pain management healthcare.",
			"meta": {
				"refs": [
					"https://www.okheart.com/"
				]
			},
			"uuid": "d68e01ce-4b30-11e9-8646-d663bd873d93",
			"value": "Oklahoma Heart Hospital"
		},
		{
			"description": "Located in Concord Massachusetts, Emerson is a full-service, non-profit community hospital.",
			"meta": {
				"refs": [
					"https://www.emersonhospital.org/"
				]
			},
			"uuid": "3ecca6b4-4b31-11e9-8646-d663bd873d93",
			"value": "Emerson Hospital"
		},
		{
			"description": "Navicent Health, a part of Central Georgia Health System, is the second-largest hospital in Georgia and the only designated Level I Trauma Center in the region.",
			"meta": {
				"refs": [
					"https://www.navicenthealth.org/"
				]
			},
			"uuid": "f9a40154-50d0-11e9-8647-d663bd873d93",
			"value": "Navicent Health"
		},
		{
			"description": "British Columbia, Canada",
			"meta": {
				"refs": [
					"https://www.islandhealth.ca/our-locations/hospitals-health-centre-locations/nanaimo-regional-general-hospital"
				]
			},
			"uuid": "46c8190a-5240-11e9-8647-d663bd873d93",
			"value": "Nanaimo Regional General Hospital"
		},
		{
			"description": "Hospital located in Kentucky.",
			"meta": {
				"refs": [
					"https://www.hmh.net/patient-visitor/hardin-memorial-hospital-location/"
				]
			},
			"uuid": "3e486dc4-5bfb-11e9-8647-d663bd873d93",
			"value": "Hardin Memorial Hospital"
		},
		{
			"description": "Services the Cleavland Ohio region.",
			"meta": {
				"refs": [
					"https://www.uhhospitals.org/rainbow"
				]
			},
			"uuid": "3e487076-5bfb-11e9-8647-d663bd873d93",
			"value": "University Hospitals Rainbow Babies & Children’s Hospital"
		},
		{
			"description": "At Weslaco Regional Rehabilitation Hospital, we provide intensive rehabilitation services to people recovering from disabling diseases or injuries.",
			"meta": {
				"refs": [
					"https://www.ernesthealth.com/gallery-item/weslaco-regional-rehabilitation-hospital/"
				]
			},
			"uuid": "3e487242-5bfb-11e9-8647-d663bd873d93",
			"value": "Weslaco Regional Rehabilitation Hospital"
		},
		{
			"description": "North Ottawa Community Hospital NOCH is an 81-bed acute care hospital located in Grand Haven, Michigan. Like other progressive institutions, our profile changes to meet the needs of our patients and the challenges of our industry. We are a community health care system with a variety of inpatient, outpatient and support services. Affiliate organizations strengthen our seamless delivery of care, by transforming us into a health care delivery system.",
			"meta": {
				"refs": [
					"http://www.noch.org/main.aspx?id=104"
				]
			},
			"uuid": "55ee5f8e-63cf-11e9-a923-1681be663d3e",
			"value": "North Ottawa Community Health System"
		},
		{
			"description": "Northern Light Acadia Hospital is a psychiatric hospital in Bangor, Maine. We provide inpatient and outpatient behavioral care for children, teens, and adults while specializing in the treatment of mental illness and substance abuse.",
			"meta": {
				"refs": [
					"https://northernlighthealth.org/Acadia-Hospital"
				]
			},
			"uuid": "c1332f4e-65e7-11e9-a923-1681be663d3e",
			"value": "Northern Light Acadia Hospital"
		},
		{
			"description": "Saint Boniface Hospital is Manitoba's second-largest hospital, located in the Saint Boniface neighbourhood of Winnipeg. It was founded by the Sisters of Charity of Montreal in 1871, and was the first hospital in Western Canada. The hospital was incorporated in 1960, and as of 2003 has 554 beds and 78 bassinets.",
			"meta": {
				"refs": [
					"http://www.sbgh.mb.ca/"
				]
			},
			"uuid": "b0b13734-681b-11e9-a923-1681be663d3e",
			"value": "St. Boniface Hospital"
		},
		{
			"description": "Madison Parish Hospital is a small rural health care provider in Northeast Louisiana, just west of the Mississippi River.",
			"meta": {
				"refs": [
					"https://www.madisonparishhospital.com/"
				]
			},
			"uuid": "bf130382-7105-11e9-a923-1681be663d3e",
			"value": "Madison Parish Hospital"
		},
		{
			"description": "Cork University Hospital, abbreviated as CUH, is a university teaching hospital in Ireland. It is operated by the Health Service Executive. The hospital is located in Wilton in the south-western suburbs of Cork. CUH officially opened in November 1978, and was known then as Cork Regional Hospital.",
			"meta": {
				"refs": [
					"http://www.cuh.hse.ie/"
				]
			},
			"uuid": "bf130652-7105-11e9-a923-1681be663d3e",
			"value": "Cork University Hospital"
		},
		{
			"description": "Sparta Community Hospital is a full-service acute care facility, Medicare and Medicaid licensed and certified, providing quality health care close to home.",
			"meta": {
				"refs": [
					"https://www.spartahospital.com/"
				]
			},
			"uuid": "10197914-7bd8-11e9-8f9e-2a86e4085a59",
			"value": "Sparta Community Hospital"
		},
		{
			"description": "General hospital located in Ellwood City, PA 16117",
			"meta": {
				"refs": [
					"https://www.facebook.com/ellwoodcitymedicalcenter/"
				]
			},
			"uuid": "6452ff44-8d41-11e9-bc42-526af7764f64",
			"value": "Ellwood City Medical Center"
		},
		{
			"description": "Letterkenny University Hospital is a general hospital at Letterkenny, County Donegal in Ireland. One of Ireland's busiest, the campus is divided by a main road heading on towards the North/West of Donegal on the N56 road. A teaching hospital, it maintains links with NUI Galway, LYIT and the Royal College of Surgeons.",
			"meta": {
				"refs": [
					"https://www.hse.ie/eng/services/list/3/acutehospitals/hospitals/luh/"
				]
			},
			"uuid": "967fe192-95ef-11e9-bc42-526af7764f64",
			"value": "Letterkenny General Hospital"
		},
		{
			"description": "Red Deer Regional Hospital Centre is a medical facility located in Red Deer, Alberta. Alberta Health Services is responsible for the operations of the hospital.",
			"meta": {
				"refs": [
					"https://en.wikipedia.org/wiki/Red_Deer_Regional_Hospital"
				]
			},
			"uuid": "967fe426-95ef-11e9-bc42-526af7764f64",
			"value": "Red Deer Regional Hospital Centre"
		},
		{
			"description": "Estes Park Health is an independent, community hospital that provides services from the beginning of life to the end of life.",
			"meta": {
				"refs": [
					"https://eph.org/"
				]
			},
			"uuid": "967fe570-95ef-11e9-bc42-526af7764f64",
			"value": "Estes Park Health"
		},
		{
			"description": "The Royal Brisbane and Women’s Hospital (RBWH) is Queensland’s largest hospital and provides a wide range of clinical services in the heart of Brisbane. RBWH employs more than 6,000 multidisciplinary staff that together provides life-saving treatment to over half a million people each year.",
			"meta": {
				"refs": [
					"https://metronorth.health.qld.gov.au/rbwh/"
				]
			},
			"uuid": "abf2cac0-a5d1-11e9-a2a3-2a2ae2dbcce4",
			"value": "The Royal Brisbane and Women’s Hospital (RBWH)"
		},
		{
			"description": "St. Conal's Hospital was a psychiatric hospital located in Letterkenny, County Donegal, Ireland.",
			"meta": {
				"refs": [
					"https://en.wikipedia.org/wiki/St._Conal%27s_Hospital"
				]
			},
			"uuid": "abf2cd22-a5d1-11e9-a2a3-2a2ae2dbcce4",
			"value": "St. Conal's Hospital"
		},
		{
			"description": "Springhill Medical Center is a 263-bed acute care hospital located in the U.S. city of Mobile, Alabama. It is accredited by The Joint Commission.",
			"meta": {
				"refs": [
					"https://www.springhillmedicalcenter.com/Find-a-Doctor.aspx"
				]
			},
			"uuid": "cdee58d6-b618-11e9-a2a3-2a2ae2dbcce4",
			"value": "Springhill Medical Center"
		},
		{
			"description": "Hospital located in Bayamon, PR.",
			"meta": {
				"refs": [
					"http://www.bayamon-medical.com/"
				]
			},
			"uuid": "cdee5d18-b618-11e9-a2a3-2a2ae2dbcce4",
			"value": "Bayamón Medical Center"
		},
		{
			"description": "Puerto Rico Women And Childrens Hospital is a General Acute Care Hospital - Children in Bayamon, Puerto Rico.",
			"meta": {
				"refs": [
					"https://puertoricochildrenshospital.com/"
				]
			},
			"uuid": "cdee5e8a-b618-11e9-a2a3-2a2ae2dbcce4",
			"value": "Puerto Rico Women And Children’s Hospital"
		},
		{
			"description": "Grays Harbor Community Hospital's healthcare team consists of physicians, nurses, other healthcare professionals, and students of the health sciences. These professionals provide needed diagnostic treatment and patient care services of the highest standards. Each patient at Grays Harbor Community Hospital has an attending physician who has primary responsibility for the patient's medical care.",
			"meta": {
				"refs": [
					"https://www.ghcares.org/"
				]
			},
			"uuid": "859d5d3c-bf84-11e9-9cb5-2a2ae2dbcce4",
			"value": "Grays Harbor Community Hospital"
		},
		{
			"description": "Virginia Gay Hospital was named after our founder and benefactor, Virginia Gay, who bequeathed a generous gift of $50,000 to the City of Vinton in 1914 to establish a community hospital.  This important gift, valued at more than $1,000,000 today, provided the necessary foundation for what was to become the Virginia Gay Hospital in 1923.",
			"meta": {
				"refs": [
					"https://myvgh.org/"
				]
			},
			"uuid": "8c0219fc-c677-11e9-aa8c-2a2ae2dbcce4",
			"value": "Virginia Gay Hospital"
		},
		{
			"description": "In 1980 a group of concerned nurses and social workers came together to review the need for hospice services in San Joaquin County. Their Proposal for Hospice in the Stockton Community was published in August 1980.  And on November 5, 1980 Hospice of San Joaquin was incorporated as a California Nonprofit Benefit Corporation. Our first office was a single phone on a folding table in Delta Blood Bank storage room.",
			"meta": {
				"refs": [
					"https://www.hospicesj.org/"
				]
			},
			"uuid": "8c021c4a-c677-11e9-aa8c-2a2ae2dbcce4",
			"value": "Hospice of San Joaquin"
		},
		{
			"description": "Sonoma Valley Hospital is a hospital located in Sonoma, California, United States. The hospital, which has 75 beds, provides surgical and general medical procedures.",
			"meta": {
				"refs": [
					"https://www.facebook.com/SVHospital/"
				]
			},
			"uuid": "8c021d94-c677-11e9-aa8c-2a2ae2dbcce4",
			"value": "Sonoma Valley Hospital"
		},
		{
			"description": "Massachusetts General Hospital is the original and largest teaching hospital of Harvard Medical School and a biomedical research facility located in the West End neighborhood of Boston, Massachusetts. It is the third oldest general hospital in the United States, and has a capacity of 999 beds.",
			"meta": {
				"refs": [
					"https://www.massgeneral.org/"
				]
			},
			"uuid": "8c021ec0-c677-11e9-aa8c-2a2ae2dbcce4",
			"value": "Massachusetts General Hospital"
		},
		{
			"description": "The Listowel Memorial Hospital has been providing acute care and complex continuing care services to the residents of North Perth and the hospital’s catchment area since 1919.",
			"meta": {
				"refs": [
					"https://www.southwesthealthline.ca/displayservice.aspx?id=11369"
				]
			},
			"uuid": "7def6ef6-e17e-11e9-81b4-2a2ae2dbcce4",
			"value": "Listowel Memorial Hospital"
		},
		{
			"description": "The Wingham and District Hospital is a modern, progressive acute care facility providing medical, surgical, paediatric, chronic and rehabilitation beds and other services, including 24-hour emergency coverage.",
			"meta": {
				"refs": [
					"https://www.southwesthealthline.ca/displayservice.aspx?id=11725"
				]
			},
			"uuid": "7def716c-e17e-11e9-81b4-2a2ae2dbcce4",
			"value": "Wingham and District Hospital"
		},
		{
			"description": "DCH Regional Medical Center, originally known as Druid City Hospital and generally referred to as DCH, is a public, not-for-profit hospital and medical complex located in Tuscaloosa, Alabama that serves the West Alabama region.",
			"meta": {
				"refs": [
					"https://www.dchsystem.com/"
				]
			},
			"uuid": "ea963e60-e870-11e9-81b4-2a2ae2dbcce4",
			"value": "DCH Regional Medical Center"
		},
		{
			"description": "Northport Medical Center has been a part of the DCH Health System since 1992. The facility houses several important specialty services, in addition to the full range of inpatient and outpatient services you expect from a community hospital.",
			"meta": {
				"refs": [
					"https://www.dchsystem.com/our_facilities/northport_medical_center.aspx"
				]
			},
			"uuid": "ea9640b8-e870-11e9-81b4-2a2ae2dbcce4",
			"value": "Northport Medical Center"
		},
		{
			"description": "A sense of duty and responsibility for the health care of the people of Fayette County and the surrounding area prompted Dr. B.W. McNease to build a hospital in 1936. The commitment made by Dr. McNease has been honored by those who have followed him. Today Fayette Medical Center continues to serve Fayette County with a wide range of health services. Fayette Medical Center consists of a 61-bed hospital and a 122-bed nursing home. Fayette Medical Center, located in Fayette, Ala., has been under a lease agreement with DCH Health System since 1984.",
			"meta": {
				"refs": [
					"http://www.dchsystem.com/our_facilities/fayette_medical_center.aspx"
				]
			},
			"uuid": "ea964202-e870-11e9-81b4-2a2ae2dbcce4",
			"value": "Fayette Medical Center, AL"
		},
		{
			"description": "Hospital that is a part of the Advocate Health Care, a faith-based nonprofit, is the largest health system in Illinois and a leader in the medical field that is dedicated to changing patient expectations by giving them easy access to all that they need to stay well, live well and achieve outstanding treatment outcomes.",
			"meta": {
				"refs": [
					"https://www.advocatehealth.com/cmc/"
				]
			},
			"uuid": "04d04be4-eea8-11e9-81b4-2a2ae2dbcce4",
			"value": "Advocate Christ Medical Center"
		},
		{
			"description": "CHI Health Clinic Orthopedics (Lakeside) a member of CHI Health.",
			"meta": {
				"refs": [
					"https://www.chihealth.com/en/location-search/location-details.location.b067eab9-9071-4546-957b-c9a99d720a31.html"
				]
			},
			"uuid": "04d04e32-eea8-11e9-81b4-2a2ae2dbcce4",
			"value": "CHI Health Orthopedics (Lakeside)"
		},
		{
			"description": "Hosipital system located within the state of Indiana.",
			"meta": {
				"refs": [
					"https://www.methodisthospitals.org"
				]
			},
			"uuid": "04d04f86-eea8-11e9-81b4-2a2ae2dbcce4",
			"value": "Methodist Hospitals, IN"
		},
		{
			"description": "The Norfolk and Norwich University Hospital is a National Health Service academic teaching hospital in the Norwich Research Park on the western outskirts of Norwich, England. The university hospital replaced the former, Norfolk and Norwich Hospital, which was founded in 1771, and the West Norwich Hospital.",
			"meta": {
				"refs": [
					"http://www.nnuh.nhs.uk/"
				]
			},
			"uuid": "04d050bc-eea8-11e9-81b4-2a2ae2dbcce4",
			"value": "The Norfolk and Norwich University Hospital"
		},
		{
			"description": "At Monterey Health Center our primary care practitioners specialize in Womens Health, Family, and Osteopathic Medicine.",
			"meta": {
				"refs": [
					"https://www.montereyhealthcenter.org/"
				]
			},
			"uuid": "04d051e8-eea8-11e9-81b4-2a2ae2dbcce4",
			"value": "Monterey Health Center"
		},
		{
			"description": "Central Valley Regional Center mission is to help individuals with developmental disabilities, and children at risk, to reach their goals.",
			"meta": {
				"refs": [
					"https://www.cvrc.org/"
				]
			},
			"uuid": "37e5e9f2-eea9-11e9-81b4-2a2ae2dbcce4",
			"value": "Central Valley Regional Center"
		},
		{
			"description": "At Magnolia Pediatrics, we know parenting is a 24 by 7 job, so we are available when you need us most. We offer same-day appointments to help your child feel better in no time. We strive to help your child feel comfortable and safe in our friendly environment.",
			"meta": {
				"refs": [
					"https://magnoliapediatrics.com/"
				]
			},
			"uuid": "37e5ec54-eea9-11e9-81b4-2a2ae2dbcce4",
			"value": "Magnolia Pediatrics"
		},
		{
			"description": "The Children's Hospital of Winnipeg is a children's hospital in Winnipeg, Manitoba. It is located on the campus of the Health Sciences Centre near downtown Winnipeg and is expressly devoted to the health care of children.",
			"meta": {
				"refs": [
					"https://en.wikipedia.org/wiki/The_Children%27s_Hospital_of_Winnipeg"
				]
			},
			"uuid": "82a4875a-0335-11ea-9a9f-362b9e155667",
			"value": "The Children's Hospital of Winnipeg"
		},
		{
			"description": "The Brooklyn Hospital Center is a 464-licensed-bed, full-service community teaching hospital located in Downtown Brooklyn, New York City. The hospital was founded in 1845. It is affiliated with the Mount Sinai Health System, and serves a diverse population from a wide range of ethnic backgrounds.",
			"meta": {
				"refs": [
					"https://www.tbh.org/"
				]
			},
			"uuid": "82a48bba-0335-11ea-9a9f-362b9e155667",
			"value": "The Brooklyn Hospital Center"
		},
		{
			"description": "The Rouen University hospital provides clinical education and training to future and current physicians, nurses, and other health professionals, in addition to delivering medical care to patients. They are generally affiliated with medical schools or universities (hence the alternative term university hospital or clinical school), and may be owned by a university or may form part of a wider regional or national health system. The University Rouen Hospital also has a commitment to research and is centres for experimental, innovative and technically sophisticated services. The Public Hospital University of Rouen is one of the 32 public hospital universities in France.",
			"meta": {
				"refs": [
					"https://caregiversprommd-project.eu/team/university-rouen-hospital/"
				]
			},
			"uuid": "c1fcd00c-0d5c-11ea-8d71-362b9e155667",
			"value": "The Rouen University Hospital-Charles Nicolle"
		},
		{
			"description": "A part of Nebraska Medicine. Nebraska Medical Center is a 718 acute-care bed facility that provides care to some of the sickest and most complex patients from a team of experts that represents more than 1,000 physicians in all major specialties and services. As the teaching hospital for the University of Nebraska Medical Center (UNMC), our patients also benefit from one of the nation’s leaders in and cutting edge research and education.",
			"meta": {
				"refs": [
					"https://www.nebraskamed.com/nebraska-medical-center"
				]
			},
			"uuid": "eec7e73a-16c0-11ea-8d71-362b9e155667",
			"value": "Nebraska Medical Center"
		},
		{
			"description": "Hospital in the UK. West Suffolk NHS Foundation Trust is managed by the Trust Board which consists of executive directors, including the chief executive and non-executive directors, and is led by the chair. We achieved foundation trust status in 2011 which enables us to have greater local accountability and financial freedoms.",
			"meta": {
				"refs": [
					"https://www.wsh.nhs.uk/Home.aspx"
				]
			},
			"uuid": "d06926ea-6315-11ea-bc55-0242ac130003",
			"value": "West Suffolk Hospital"
		},
		{
			"description": "Henry Mayo Newhall Hospital is a 357-bed not-for-profit community hospital and trauma center in Valencia, California, in the Santa Clarita Valley. It was founded in 1975.",
			"meta": {
				"refs": [
					"https://www.henrymayo.com/"
				]
			},
			"uuid": "ba720c74-6d21-11ea-bc55-0242ac130003",
			"value": "Henry Mayo Newhall Hospital"
		},
		{
			"description": "The Rand Memorial Hospital is located in Freeport, Grand Bahama and has a staff population of 696 with 85 beds that allow it to deliver critical services to the local community.",
			"meta": {
				"refs": [
					"https://www.linkedin.com/company/rand-memorial-hospital/"
				]
			},
			"uuid": "4ff29648-7825-11ea-bc55-0242ac130003",
			"value": "Rand Memorial Hospital"
		},
		{
			"description": "communities. We see patients who often are recovering from disabilities caused by injuries, illnesses, or chronic medical conditions. Our hospital is located in Lafayette, Indiana. We are a member of a larger network of rehabilitation and long-term acute care hospitals through Ernest Health, but are managed locally to best meet the needs of our own community. By being a member of Ernest Health, we are able to share information, knowledge, and resources with all our hospitals so we can continually evaluate and improve the delivery of care to our patients. These efforts have earned us national recognition as a healthcare leader five years in a row (2014-2018), allowing us to provide the highest level of available care to our patients in our own community. We consider it a privilege to be able to offer this high-level care and are honored to be a vital part of Lafayette and the surrounding communities that we serve.",
			"meta": {
				"refs": [
					"https://lrrh.ernesthealth.com/"
				]
			},
			"uuid": "ce386302-7d84-11ea-bc55-0242ac130003",
			"value": "Lafayette Regional Rehabilitation Hospital"
		},
		{
			"description": "Since it all began in 1923, Parkview Medical Center has provided millions of dollars in charity care to our community and in fiscal 2019, this important work continued. With the state's expansion of Medicaid, our region, in particular, has seen tremendous growth in the number of Medicaid recipients and the latest county numbers indicate there are more than 71,000 Medicaid recipients which equates to 45% of Pueblo County's population Parkview's business volume with Medicaid is 28% of our total gross revenue.",
			"meta": {
				"refs": [
					"https://www.parkviewmc.com/about/"
				]
			},
			"uuid": "65f2da08-8aee-11ea-bc55-0242ac130003",
			"value": "Parkview Medical Center"
		},
		{
			"description": "Ashtabula County Medical Center is owned by Cleveland Clinic and is a run for-profit, community-oriented multi-specialty hospital, located in Ashtabula County, Ohio. It serves the people of Ashtabula County and the surrounding areas in Northeastern Ohio and Northwestern Pennsylvania.",
			"meta": {
				"refs": [
					"https://www.acmchealth.org/"
				]
			},
			"uuid": "bce664c8-953a-11ea-bb37-0242ac130002",
			"value": "Cleveland Clinic Ashtabula County Medical Center"
		},
		{
			"description": "Geisinger Wyoming Valley Medical Center (GWV) has been a part of the Geisinger family since opening as the NPW Medical Center in 1981. The professionals at GWV provide high-quality, coordinated, patient-centered care for residents of northeastern Pennsylvania and beyond. Located just outside of Wilkes-Barre, GWV is home to a Level II trauma center to provide care for the most seriously ill and injured patients, as well as services in more than 50 specialty and subspecialty areas. The GWV campus includes the Richard and Marion Pearsall Heart Hospital, the Frank M. and Dorothea Henry Cancer Center, the Tambur Family Neonatal Intensive Care Unit and the Critical Care Building, all providing top-rated specialty care.",
			"meta": {
				"refs": [
					"https://www.geisinger.org/patient-care/find-a-location/geisinger-wyoming-valley-medical-center"
				]
			},
			"uuid": "24dd7c74-9acc-11ea-bb37-0242ac130002",
			"value": "Geisinger Wyoming Valley Medical Center"
		},
		{
			"description": "The San Raffaele Hospital (also Istituto scientifico universitario San Raffaele or ospedale San Raffaele, HSR or OSR) is a university hospital situated in Segrate, the Province of Milan, Italy. It was founded in 1969 by don Luigi Maria Verze, president of the San Raffaele del Monte Tabor Foundation. The hospital is affiliated with the School of Medicine and the School of Nursing of the Vita-Salute San Raffaele University.",
			"meta": {
				"refs": [
					"https://en.wikipedia.org/wiki/San_Raffaele_Hospital"
				]
			},
			"uuid": "0c6e9a7e-a044-11ea-bb37-0242ac130002",
			"value": "The San Raffaele Hospital"
		},
		{
			"description": "Govt. Thiruvarur Medical College was started in 1st April 2010 in Thiruvarur District at the Master Plan Complex, Vilamal Village, Thiruvarur. This Medical College was established to meet the rising demand for medical care amongst our rural public aroun Thiruvarur. The college was approved by MCI for hundred students and it is affiliated to Tamilnadu Dr. MGR Medical University, Chennai.",
			"meta": {
				"refs": [
					"http://www.tmctvr.ac.in/tmctvr/content_page.jsp?sqf=10&sq1=aboutus"
				]
			},
			"uuid": "59d68f4e-ab46-11ea-bb37-0242ac130002",
			"value": "Thiruvarur Medical College and Hospital"
		},
		{
			"description": "The Rangely Hospital District has served Northwestern Colorado since 1959.",
			"meta": {
				"refs": [
					"http://www.rangelyhospital.com/getpage.php?name=index#?sub=About+Us"
				]
			},
			"uuid": "6fe27434-b09f-11ea-b3de-0242ac130004",
			"value": "Rangely District Hospital (RDH)"
		},
		{
			"description": "Chatham-Kent Health Alliance (CKHA) is a 200 bed community hospital, serving the residents of Chatham and rural Kent including Walpole Island and Delaware First Nations. Formed in 2018, CKHA is committed to delivering quality and safe care at its two sites in Chatham and Wallaceburg.",
			"meta": {
				"refs": [
					"http://www.ckha.on.ca/about"
				]
			},
			"uuid": "0986bd40-b6e8-11ea-b3de-0242ac130004",
			"value": "Chatham-Kent Health Alliance (CKHA)"
		},
		{
			"description": "Critical care hospital located in Athens, GA.",
			"meta": {
				"refs": [
					"https://www.landmarkhospitals.com/athens/"
				]
			},
			"uuid": "0986c1fa-b6e8-11ea-b3de-0242ac130004",
			"value": "Landmark Hospital of Athens"
		},
		{
			"description": "Regis Aged Care is one of Australia’s leading private providers of aged care with 65 facilities nationally. Regis operates in all states and territories except the ACT, and has over 9000 employees. Visit regis.com.au to find out more about our services such as aged care, home care and retirement living.",
			"meta": {
				"refs": [
					"https://www.linkedin.com/company/regis-agedcare/"
				]
			},
			"uuid": "a9789ca6-d7ea-11ea-87d0-0242ac130003",
			"value": "Regis Aged Care"
		},
		{
			"description": "Founded in 2008, MVHC serves as a best-in-class health care resource to ensure all members of the communities we serve have access to high-quality, affordable health care. As your community of care, we are dedicated to serving the primary care needs of the residents in each of our convenient locations in Muskingum, Morgan, Coshocton and Guernsey counties. We are local, non-profit, and community owned.",
			"meta": {
				"refs": [
					"https://www.mvhccares.org/"
				]
			},
			"uuid": "ed99c9d2-e091-11ea-87d0-0242ac130003",
			"value": "Muskingum Valley Health Center"
		},
		{
			"description": "Recognized for its leading edge technology and best practices, Roper Hospital builds on a long legacy of excellence. Founded in 1829 as the first community hospital in the Carolinas, Roper Hospital today is one of the most trusted names in the Lowcountry. As the proud recipient of national awards for quality patient care, Roper enjoys an outstanding reputation for excellent outcomes and personal attention.",
			"meta": {
				"refs": [
					"https://www.rsfh.com/roper-hospital/"
				]
			},
			"uuid": "4d16c34e-f369-11ea-adc1-0242ac120002",
			"value": "Roper St. Francis Hospital"
		},
		{
			"description": "Saraburi Hospital is the main hospital of Saraburi Province, Thailand and is classified under the Ministry of Public Health as a regional hospital. It has a CPIRD Medical Education Center which trains doctors for the Faculty of Medicine of Thammasat University.",
			"meta": {
				"refs": [
					"https://en.wikipedia.org/wiki/Saraburi_Hospital"
				]
			},
			"uuid": "49c18d3e-f821-11ea-adc1-0242ac120002",
			"value": "Saraburi Hospital"
		},
		{
			"description": "Enloe Medical Center provides expert care for comprehensve medical services in Chico, CA.",
			"meta": {
				"refs": [
					"https://www.enloe.org/"
				]
			},
			"uuid": "49c18e06-f821-11ea-adc1-0242ac120002",
			"value": "Enloe Medical Center"
		},
		{
			"description": "HGH is a family and patient-centered bilingual community hospital with a regional focus. ",
			"meta": {
				"refs": [
					"https://hgh.ca/"
				]
			},
			"uuid": "604f113c-4b31-11e9-8646-d663bd873d93",
			"value": "Hawkesbury General Hospital"
		}
	],
	"version": 36
}
