{
	"category": "BLS-NAICS-813",
	"description": "Industries in the Religious, Grantmaking, Civic, Professional, and Similar Organizations subsector group establishments that organize and promote religious activities; support various causes through grantmaking; advocate various social and political causes; and promote and defend the interests of their members.",
	"name": "BLS-NAICS-813",
	"source": "BLS Industries at a Glance",
	"type": "BLS-NAICS-813",
	"uuid": "99cae6e4-4847-11e9-8646-d663bd873d93",
	"values": [{
			"description": "Test place holder",
			"meta": {
				"refs": [
					"https://www.bls.gov/iag/tgs/iag813.htm"
				]
			},
			"uuid": "a93dbac0-48fb-11e9-8646-d663bd873d93",
			"value": "Test Religious, Grantmaking, Civic, Professional, and Similar Organizations Value"
		},
		{
			"description": "Opportunity International is a 501 nonprofit organization that is working to end global poverty by creating and sustaining jobs. Through a network of 47 program and support partners, Opportunity provides small business loans, savings, insurance and training to more than 14 million people in the developing world.",
			"meta": {
				"refs": [
					"https://opportunity.org/"
				]
			},
			"uuid": "4f9be668-4b3f-11e9-8646-d663bd873d93",
			"value": "Opportunity International"
		},
		{
			"description": "Our direct basic cremation service without a ceremony includes transfer of deceased, transportation to the crematory and refrigeration no mileage charges or daily refrigeration fees. This service also includes the standard responsibilities of a funeral director and staff. Plus, if the bereaved live in Pennsylvania, we come to the home or any place of convenience of the next of kin, after death, to do any paperwork, so they do not have to travel to us.",
			"meta": {
				"refs": [
					"https://www.cremationsocietyofpa.com/"
				]
			},
			"uuid": "6ea34c14-5241-11e9-8647-d663bd873d93",
			"value": "Cremation Society of Pennsylvania, Inc."
		},
		{
			"description": "Housing provider that offers safe, affordable rental accommodations to families and individuals in a multi-cultural setting.",
			"meta": {
				"refs": [
					"https://easternontario.cioc.ca/record/OCR3954"
				],
				"synonyms": [
					"OCISO Hilda",
					"OCISO Presland",
					"OCISONPH",
					"Unity Hilda",
					"Unity Housing",
					"Unity Presland",
					"OCISO Non Profit Housing Corporation"
	       ]
			},
			"uuid": "c2987ed8-5bfc-11e9-8647-d663bd873d93",
			"value": "Unity Non Profit Housing Corporation Ottawa"
		},
		{
			"description": "Amnesty International is a London-based non-governmental organization focused on human rights. The organization says it has more than seven million members and supporters around the world.",
			"meta": {
				"refs": [
					"https://www.amnesty.org/en/"
				]
			},
			"uuid": "282dcc44-6cf1-11e9-a923-1681be663d3e",
			"value": "Amnesty International"
		},
		{
			"description": "Catholic Parish in Brunswick, Ohio.",
			"meta": {
				"refs": [
					"https://stambrose.us/"
				]
			},
			"uuid": "282dc974-6cf1-11e9-a923-1681be663d3e",
			"value": "Saint Ambrose Catholic Parish"
		},
		{
			"description": "People Inc. is a non-profit organization in Western New York. People Inc. provides a variety of services to seniors, families and individuals with developmental disabilities including residential, employment, community outreach, health care, and recreation programs.",
			"meta": {
				"refs": [
					"https://www.people-inc.org/"
				]
			},
			"uuid": "13e4c38c-8d44-11e9-bc42-526af7764f64",
			"value": "People Inc."
		},
		{
			"description": "Supported by United Way of King County, Washington. We provide relief to families and individuals living within the boundaries of the Auburn School District.",
			"meta": {
				"refs": [
					"http://www.theauburnfoodbank.org/"
				]
			},
			"uuid": "13e4c62a-8d44-11e9-bc42-526af7764f64",
			"value": "The Auburn Food Bank"
		},
		{
			"description": "Father Bill’s & MainSpring (FBMS), a registered 501(c)3 charitable organization, has been a leading innovator of ending homelessness. Our mission is to end and prevent homelessness in Southern Massachusetts with programs that provide emergency and permanent housing and help people obtain skills, jobs, housing, and services. We help people who are struggling with homelessness, or are at risk of homelessness, to achieve self-sufficiency.",
			"meta": {
				"refs": [
					"https://helpfbms.org/"
				]
			},
			"uuid": "81dc44bc-a5d3-11e9-a2a3-2a2ae2dbcce4",
			"value": "Father Bill's & MainSpring"
		},
		{
			"description": "St John Ambulance is the name of a number of affiliated organisations in different countries which teach and provide first aid and emergency medical services, and are primarily staffed by volunteers. The associations are overseen by the international Order of St John and its priories.",
			"meta": {
				"refs": [
					"https://www.sja.ca/"
				]
			},
			"uuid": "81dc4732-a5d3-11e9-a2a3-2a2ae2dbcce4",
			"value": "St John Ambulance"
		},
		{
			"description": "Independent Age is an older peoples charity based in the UK. It has offices in London, Newcastle and Glasgow, and staff and volunteers based in a number of other UK locations. It is a registered charity in England & Wales and in Scotland.",
			"meta": {
				"refs": [
					"https://www.independentage.org/"
				]
			},
			"uuid": "499e9750-abc1-11e9-a2a3-2a2ae2dbcce4",
			"value": "Independent Age"
		},
		{
			"description": "In the early 1960s, the residents of the Park DuValle Community Health Center began to voice their concern for the lack of medical services provided to this area. At that time, the only health care, other than private physicians, was General Hospital. It was located in the east end of town and public transportation was unavailable after 5 p.m. These primarily medically indigent residents began to work with several civic-minded groups to make their dreams a reality. A coalition of residents, led by the late Vernice Hunter, a community activist, along with the American Friends Service Committee (AFSC), approached the city government about its concerns. Due to these efforts, several buildings in the Cotter Homes subsidized housing area were designated by the city to house the new health care facility. Federal Office of Economic Opportunity funding was secured and in 1968, Dr. Harvey I. Sloane became the center’s first director and provided direction for this most important and sensitive endeavor.",
			"meta": {
				"refs": [
					"http://pdchc.org/pdchc-our-history-page/"
				]
			},
			"uuid": "11ca2690-b61c-11e9-a2a3-2a2ae2dbcce4",
			"value": "Park Duvalle Community Health Center Inc"
		},
		{
			"description": "The stated mission of the Boy Scouts of America is to prepare young people to make ethical and moral choices over their lifetimes by instilling in them the values of the Scout Oath and Law.",
			"meta": {
				"refs": [
					"https://www.scouting.org/"
				]
			},
			"uuid": "224463e4-d356-11e9-bb65-2a2ae2dbcce4",
			"value": "Boy Scouts of America"
		},
		{
			"description": "Likud, officially the Likud-National Liberal Movement, is a centre-right to right-wing political party in Israel. A secular party, it was founded in 1973 by Menachem Begin and Ariel Sharon in an alliance with several right-wing parties.",
			"meta": {
				"refs": [
					"https://en.wikipedia.org/wiki/Likud"
				]
			},
			"uuid": "22446650-d356-11e9-bb65-2a2ae2dbcce4",
			"value": "Likud"
		},
		{
			"description": "We Are The Largest Community and Family Based Agency in New Mexico. Youth Development Inc. currently offers services in early childhood education, mental and behavioral health, education, employment, and career training.",
			"meta": {
				"refs": [
					"http://www.ydinm.org/"
				]
			},
			"uuid": "950ef102-153a-11ea-8d71-362b9e155667",
			"value": "Youth Development, Inc."
		},
		{
			"description": "The Council of Licenced Firearms Owners represents the interests of firearms owners and is the largest voluntary shooting-related organisation in New Zealand. COLFO was set up in 1996 by a number of interested individuals and groups to combat firearms-related disinformation. COLFO takes a professional approach using sound research to dispel the inaccurate and emotive claims of self-proclaimed anti-gun experts. Membership is available to any society, association, organisation, or individual whose objects and practices are supportive of the Council's objectives. COLFO is a member of the Pacific Shooting Sports Forum and the World Forum for the Future of Shooting Sports.",
			"meta": {
				"refs": [
					"https://www.colfo.org.nz/"
				]
			},
			"uuid": "93e67862-16c1-11ea-8d71-362b9e155667",
			"value": "Council of Licenced Firearms Owners (COLFO)"
		},
		{
			"description": "Since 1945, Saint Francis Ministries has been dedicated to the needs of children and youth. We advocate for them and work to protect them. We do our best to ensure that every child we serve gets a chance at a happy and fulfilling life. As a non-profit, faith-based organization, we place great stock in the value of both traditional and non-traditional families. We believe strong families make children’s lives better. What began as a home for boys on the Kansas prairie is now a multi-faceted child and family services ministry serving over 31,000 people in Arkansas, Kansas, Mississippi, Nebraska, Oklahoma, Illinois, Texas, and Central America with a broad range of programs and services. We help strengthen and heal families while providing for the health and security of children. Though rooted in the Episcopal tradition, Saint Francis Ministries is an independent not-for-profit organization dedicated to the protection, nurturing, and healing of children and families in body, mind, and spirit. To that end, while partnering with government agencies in supporting children and families in crisis, Saint Francis Ministries honors religious freedom and is also committed to allowing children and families in its care to participate in religious activities on a voluntary basis.",
			"meta": {
				"refs": [
					"https://saintfrancisministries.org/"
				]
			},
			"uuid": "6683eae0-7d8b-11ea-bc55-0242ac130003",
			"value": "Saint Francis Ministries, KS"
		},
		{
			"description": "Indianblooddonors.com is an address which can save your life. From Adilabad to Yamuna Nagar, from the most common blood group to the rarest, the site has a huge database of blood donors. So if you need blood, it's a good place to turn to. It's simple. It's effective. It's Free. It can match you with a donor near you in minutes. And you can save the life of a loved one. You can also Sign up as a donor at the site and save the life of someone else's loved one.",
			"meta": {
				"refs": [
					"http://www.indianblooddonors.com/"
				]
			},
			"uuid": "935bf208-b0a1-11ea-b3de-0242ac130004",
			"value": "Indian Blood Donors"
		},
		{
			"description": "CNY Works is a not-for-profit organization governed by a Board of Directors. Employers seeking qualified and trained employees will benefit from our Business Services department. Above and beyond our comprehensive candidate database, we provide consulting services that will help your business navigate the intricacies of hiring and employment regulations in New York State.",
			"meta": {
				"refs": [
					"http://www.cnyworks.com/about/about-cny-works"
				]
			},
			"uuid": "282fb1ca-bbc5-11ea-b3de-0242ac130004",
			"value": "CNYWorks"
		},
		{
			"description": "Massachusetts College of Liberal Arts Foundation, Inc. is a private nonprofit organization dedicated to the growth, development and support of Massachusetts College of Liberal Arts and its faculty, staff and students, with special emphasis on academic quality and the assurance of access to higher education through the receipt, management, and disbursement of funds and other charitable contributions secured through private sources and grant funding.",
			"meta": {
				"refs": [
					"http://mcla.edu/About_MCLA/admin/institutionaladvancement/mclafoundationinc/index"
				]
			},
			"uuid": "388d80ea-e093-11ea-87d0-0242ac130003",
			"value": "Massachusetts College of Liberal Arts Foundation, Inc."
		},
		{
			"description": "Scholarship America is a Minnesota-based American philanthropic organization that assists communities, corporations, foundations and individuals with fundraising, managing and awarding scholarships to students.",
			"meta": {
				"refs": [
					"https://scholarshipamerica.org/"
				]
			},
			"uuid": "388d837e-e093-11ea-87d0-0242ac130003",
			"value": "Scholarship America "
		},
		{
			"description": "The Mines Advisory Group is a non-governmental organization that assists people affected by landmines, unexploded ordnance, and small arms and light weapons. MAG takes a humanitarian approach to landmine action. They focus on the impact of their work on local communities.",
			"meta": {
				"refs": [
					"https://www.maginternational.org/"
				]
			},
			"uuid": "fa53eb88-e2e1-11ea-87d0-0242ac130003",
			"value": "Mines Advisory Group (MAG)"
		},
		{
			"description": "The Jewish Federation of Greater Washington envisions an open, connected, and vibrant Jewish community that cares for each other, fosters Jewish learning and journeys, embraces Jewish peoplehood and Israel, and acts as a force for good in the world. Our mission is to inspire, build, and sustain vibrant Jewish life in a changing world by mobilizing our community in common purpose, intentional innovation, and effective action. Federation supports 58 local agencies, 14 national organizations, 18 overseas partners and programs, and more than 60 congregations that care for those in need, deepen engagement in Jewish life and connect Jews locally, in Israel, and around the world. Justice for the poor, honoring seniors, supporting those who are ill or in crisis, nurturing and educating our children, inclusion of all, and helping refugees find freedom and economic self-sufficiency are central to our values and the programs we support. We are equally committed to inspiring learning and experiences in order to shape our Jewish communal identity. Formal education opportunities and informal Jewish experiences like summer camps, youth groups and trips to Israel provide learning, recreational, cultural and social activities that nourish our bodies and our minds.",
			"meta": {
				"refs": [
					"https://www.linkedin.com/company/jewish-federation-of-greater-washington/about/"
				]
			},
			"uuid": "ddf1ae0a-f37e-11ea-adc1-0242ac120002",
			"value": "The Jewish Federation of Greater Washington"
		},
		{
			"description": "The BCH Foundation is a nonprofit organization that works to enhance the quality and availability of health care services offered by Boulder Community Health.",
			"meta": {
				"refs": [
					"https://www.bch.org/Foundation.aspx"
				]
			},
			"uuid": "62be5c4e-f822-11ea-adc1-0242ac120002",
			"value": "Boulder Community Health Foundation"
		},
		{
			"description": "Avalonia Group Homes, Inc. was founded in 1989 to serve the most severely emotionally disturbed adolescent males by a family-based small business. Avalonia became a corporation in 1991. The hallmark of its service population was children who were in the care of the State. Originally, it was an eight bed facility and was operated in a house-parent environment. Over the next seven years, it grew to 16 beds and remained committed to the recovery of the most behaviorally disturbed youth in South Carolina. The operating system evolved as the population disturbances became more aggressive. Many of the methods developed during this time by Dr. M.J. Short at the home were new to the field of adolescent recovery in group homes and have since become ubiquitous in the response to behaviorally disturbed children. During the late 1990’s two additional structures were added to the Avalonia campus. The growth of the facility originated in the recognition that South Carolina needed a recovery system for severely emotionally disturbed youth, who suffer with mental illness. The part of the development of South Carolina system created a hybrid facility called a high management group homed, which provided both treatment of mental illness and long term residential care. Avalonia’s place in the system was as a high management group home with a high staff ratio in a secure environment, which totaled 55 beds by 2000. In 2001 Excalibur Youth Services, LLC was formed to integrate severely emotionally disturbed males into the community. Using the high management group home concept of treatment combined with residential care, it developed an organization, focusing on educational and work success in a variety of secondary education environments and actual work experience, both in and out of the facility. It’s capacity was 42 beds and was composed of 4 distinct units within the facility. The transition of older youth into the community occurred by moving clients from on-site school to traditional public school. If public school was not a good fit, then various community based GED and Greenville Tech programs were offered, including job skills, such as welding and carpentry. Many of the clients worked in actual public jobs in the community, as well as on-site structure work settings. Because Avalonia Group Homes, Inc. and Excalibur Youth Services, LLC were organizations committed to treatment of mentally ill youth, they diversified their operations. Based upon an opportunity granted by the State of South Carolina, each organization established a Psychiatric Residential Treatment Facility. Also, the population served diversified in the group homes, which removed treatment elements from their operations, but retained the remaining parts of their core operations. In October 2008 a male PRTF was opened and on January 15th of 2009 a female facility was opened and both provide psychiatric treatment for ages 5-21.",
			"meta": {
				"refs": [
					"http://www.recoverouryouth.org/about-us/"
				]
			},
			"uuid": "d5353d16-08a2-11eb-adc1-0242ac120002",
			"value": "Recover Our Youth"
		},
		{
			"description": "UJIA is a registered charity, based in London, that works with young people in the United Kingdom and in the Galil region of Israel. It provides formal and informal educational programmes that aim to enhance young British Jews' sense of Jewish identity and their connection with Israel.",
			"meta": {
				"refs": [
					"https://en.wikipedia.org/wiki/UJIA"
				]
			},
			"uuid": "c43e1bee-0e1b-11eb-adc1-0242ac120002",
			"value": "UJIA (United Jewish Israel Appeal)"
		},
		{
			"description": "Protecting the land that protects the lake since 1988. The Lake George Land Conservancy is an accredited not-for-profit land trust dedicated to working with willing landowners and other partners to protect the world-renowned water quality of Lake George and to permanently preserve the natural, scenic, historical and recreational resources of the Lake George region.",
			"meta": {
				"refs": [
					"http://www.lglc.org/"
				]
			},
			"uuid": "eacdabe2-1476-11eb-adc1-0242ac120002",
			"value": "The Lake George Land Conservancy"
		},
		{
			"description": "We build homes, let, improve and maintain them for people in need.  We don’t simply want to make a difference to our customers and their communities – we want to solve the housing crisis too.",
			"meta": {
				"refs": [
					"https://www.linkedin.com/company/flagship-housing-group-ltd/about/"
				]
			},
			"uuid": "f9eef12e-243b-11eb-adc1-0242ac120002",
			"value": "Flagship_Group"
		},
		{
			"description": "American Armed Forces Mutual Aid Association is a Virginia-based not-for-profit, tax-exempt, member-owned association that provides diversified financial services, including life insurance, investing and trust services, mortgage services, and survivor services to the U.S. Armed Forces communities.",
			"meta": {
				"refs": [
					"https://www.aafmaa.com/"
				]
			},
			"uuid": "51225494-8342-11eb-8dcd-0242ac130003",
			"value": "The American Armed Forces Mutual Aid Association"
		},
		{
			"description": "Nuffic is the Dutch organisation for internationalisation in education. It is an independent, non-profit organisation based in The Hague, the Netherlands. Its most important contract partners are the Dutch Ministry of Education, Culture & Science and the Dutch Ministry of Foreign Affairs.",
			"meta": {
				"refs": [
					"https://www.nuffic.nl/en"
				]
			},
			"uuid": "512256ba-8342-11eb-8dcd-0242ac130003",
			"value": "Nuffic"
		},
		{
			"description": "Adim Adim is a non-profit organization. Adim Adim aims to raise funds for NGOs that are in need of support, via sports activities. Adim Adim is based in Istanbul, Turkey. It has a network of 300+ sports people. Adim Adim was founded in 2007.",
			"meta": {
				"refs": [
					"https://www.linkedin.com/company/adim-adim/?trk=public_profile_volunteering_position&originalSubdomain=fi"
				]
			},
			"uuid": "519e63ce-872d-11eb-8dcd-0242ac130003",
			"value": "Adim Adim"
		},
		{
			"description": "The Apperta Foundation is a clinician-led, not-for-profit company. Supported by NHS England, NHS Digital and others, we promote open systems and standards for digital health and social care. We show how the delivery of health and social care can be transformed when data, information and knowledge in IT systems is open, shareable and computable.",
			"meta": {
				"refs": [
					"https://www.linkedin.com/company/the-apperta-foundation-c.i.c./about/"
				]
			},
			"uuid": "9708c218-8f36-11eb-8dcd-0242ac130003",
			"value": "The Apperta Foundation CIC"
		},
		{
			"description": "UNITED TISSUE NETWORK IS A NONPROFIT 501C3, AATB ACCREDITED, WHOLE-BODY DONATION COMPANY.",
			"meta": {
				"refs": [
					"https://unitedtissue.org/"
				]
			},
			"uuid": "8b6c327e-4b3f-11e9-8646-d663bd873d93",
			"value": "United Tissue Network"
		}
	],
	"version": 14
}
