{
	"category": "BLS-NAICS-61",
	"description": "The Educational Services sector comprises establishments that provide instruction and training in a wide variety of subjects. This instruction and training is provided by specialized establishments, such as schools, colleges, universities, and training centers. These establishments may be privately owned and operated for profit or not for profit, or they may be publicly owned and operated. They may also offer food and/or accommodation services to their students. Educational services are usually delivered by teachers or instructors that explain, tell, demonstrate, supervise, and direct learning. Instruction is imparted in diverse settings, such as educational institutions, the workplace, or the home, and through diverse means, such as correspondence, television, the Internet, or other electronic and distance-learning methods. The training provided by these establishments may include the use of simulators and simulation methods. It can be adapted to the particular needs of the students, for example sign language can replace verbal language for teaching students with hearing impairments. All industries in the sector share this commonality of process, namely, labor inputs of instructors with the requisite subject matter expertise and teaching ability.",
	"name": "BLS-NAICS-61",
	"source": "BLS Industries at a Glance",
	"type": "BLS-NAICS-61",
	"uuid": "792ddae8-47fe-11e9-b210-d663bd873d93",
	"values": [{
			"description": "Test place holder",
			"meta": {
				"refs": [
					"https://www.bls.gov/iag/tgs/iag61.htm"
				]
			},
			"uuid": "ee6ac540-48c2-11e9-8646-d663bd873d93",
			"value": "Test Educational Services Value"
		},
		{
			"description": "Florida Keys Community College is a community college in Key West, Florida. Its main campus is on Stock Island, adjacent to what it purports to be the only living coral reef in North America. FKCC also operates two additional campuses in the Florida Keys; one in Marathon and another in Key Largo.",
			"meta": {
				"refs": [
					"https://www.fkcc.edu/"
				]
			},
			"uuid": "3203b118-4b20-11e9-8646-d663bd873d93",
			"value": "Florida Keys Community College"
		},
		{
			"description": "The University of Waterloo is a public research university with a main campus in Waterloo, Ontario, Canada. The main campus is on 404 hectares of land adjacent to Uptown Waterloo and Waterloo Park. The university offers academic programs administered by six faculties and ten faculty-based schools.",
			"meta": {
				"refs": [
					"https://uwaterloo.ca/"
				]
			},
			"uuid": "ae2e9dca-4b20-11e9-8646-d663bd873d93",
			"value": "University of Waterloo"
		},
		{
			"description": "Grinnell College is a private liberal arts college in Grinnell, Iowa. It was founded in 1846 when a group of New England Congregationalists established the Trustees of Iowa College. Grinnell is known for its rigorous academics, innovative pedagogy, and commitment to social justice.",
			"meta": {
				"refs": [
					"https://www.grinnell.edu/"
				]
			},
			"uuid": "f40209d6-4b20-11e9-8646-d663bd873d93",
			"value": "Grinnell College"
		},
		{
			"description": "Hamilton College is a private, nonsectarian liberal arts college in Clinton, New York. It was founded as Hamilton-Oneida Academy in 1793, and was chartered as Hamilton College in 1812 in honor of inaugural trustee Alexander Hamilton.",
			"meta": {
				"refs": [
					"https://www.hamilton.edu/"
				]
			},
			"uuid": "2e39549c-4b21-11e9-8646-d663bd873d93",
			"value": "Hamilton College"
		},
		{
			"description": "Oberlin is a place of intense energy and creativity, built on a foundation of academic, artistic, and musical excellence. With a top-ranking liberal arts college, a world-class conservatory, and a first-rate art museum all on a single campus, it is the ideal laboratory in which to study and design the world you want.",
			"meta": {
				"refs": [
					"https://www.oberlin.edu/about-oberlin"
				]
			},
			"uuid": "64237772-4b21-11e9-8646-d663bd873d93",
			"value": "Oberlin College"
		},
		{
			"description": "Atlantic School of Theology is a Canadian public ecumenical university that provides graduate level theological education and undertakes research to assist students to prepare for Christian ministries and other forms of public leadership.",
			"meta": {
				"refs": [
					"http://www.astheology.ns.ca/home/welcome.html"
				]
			},
			"uuid": "8899f63a-4b21-11e9-8646-d663bd873d93",
			"value": "Atlantic School of Theology"
		},
		{
			"description": "The Sir John Colfox Academy is a coeducational secondary school and sixth form located in Bridport in the English county of Dorset. Previously a community school administered by Dorset County Council, the Sir John Colfox School converted to academy status in May 2015 and was renamed the Sir John Colfox Academy.",
			"meta": {
				"refs": [
					"https://www.colfox.org/"
				]
			},
			"uuid": "b3d23d1e-4ff2-11e9-8647-d663bd873d93",
			"value": "The Sir John Colfox Academy"
		},
		{
			"description": "The Georgia Institute of Technology, commonly referred to as Georgia Tech, is a public research university and institute of technology in Atlanta, Georgia. It is part of the University System of Georgia and has satellite campuses in Savannah, Georgia; Metz, France; Athlone, Ireland; Shenzhen, China; and Singapore.",
			"meta": {
				"refs": [
					"https://www.gatech.edu/"
				]
			},
			"uuid": "1f1a8294-5bfa-11e9-8647-d663bd873d93",
			"value": "Georgia Institute of Technology"
		},
		{
			"description": "Berkeley High School is a public high school in the Berkeley Unified School District, and the only public high school in the city of Berkeley, California, United States.",
			"meta": {
				"refs": [
					"https://bhs.berkeleyschools.net/"
				]
			},
			"uuid": "88059bfa-6b53-11e9-a923-1681be663d3e",
			"value": "Berkeley High School, CA"
		},
		{
			"description": "The University of Toledo, commonly referred to as U of Toledo or UT, is a public research university located in Toledo, Ohio, United States.",
			"meta": {
				"refs": [
					"https://www.utoledo.edu/"
				]
			},
			"uuid": "88059fb0-6b53-11e9-a923-1681be663d3e",
			"value": "University of Toledo"
		},
		{
			"description": "Community College of Allegheny County is a community college in the Pittsburgh, Pennsylvania area. With four campuses and four centers, the college offers associate's degrees, certificate and diploma programs.",
			"meta": {
				"refs": [
					"https://www.bls.gov/iag/tgs/iag61.htm"
				]
			},
			"uuid": "8805a14a-6b53-11e9-a923-1681be663d3e",
			"value": "Community College of Allegheny County"
		},
		{
			"description": "The University of Alaska Fairbanks, also referred to as UAF or Alaska, is a public research university in College, Alaska. It is a flagship campus of the University of Alaska system and a land-grant, sea-grant, and space-grant institution. The University of Alaska Museum of the North is also on the Fairbanks campus.",
			"meta": {
				"refs": [
					"https://www.alaska.edu/"
				]
			},
			"uuid": "8805a28a-6b53-11e9-a923-1681be663d3e",
			"value": "University of Alaska"
		},
		{
			"description": "Seattle University is a private Jesuit university in Seattle, Washington. SU is the largest independent university in the Northwest US, with over 7,500 students enrolled in undergraduate and graduate.",
			"meta": {
				"refs": [
					"https://www.seattleu.edu/"
				]
			},
			"uuid": "17883088-6cf0-11e9-a923-1681be663d3e",
			"value": "Seattle University"
		},
		{
			"description": "Buena Vista Horace Mann K-8 Community School is a K–8th grade public elementary and middle school in the Mission District of San Francisco, California with the proud distinction of being San Francisco Unified School District’s first Two-Way Spanish Immersion School.",
			"meta": {
				"refs": [
					"http://www.wearebvhm.com/"
				]
			},
			"uuid": "5a7ac334-7104-11e9-a923-1681be663d3e",
			"value": "Buena Vista Horace Mann"
		},
		{
			"description": "Augustana College is a private liberal arts college in Rock Island, Illinois, United States. The college enrolls approximately 2,500 students. Covering 115 acres of hilly, wooded land, Augustana is adjacent to the Mississippi River.",
			"meta": {
				"refs": [
					"https://www.augustana.edu/"
				]
			},
			"uuid": "cca17450-7bd4-11e9-8f9e-2a86e4085a59",
			"value": "Augustana College"
		},
		{
			"description": "The Australian National University is a national research university located in Canberra, the capital of Australia. Its main campus in Acton encompasses seven teaching and research colleges, in addition to several national academies and institutes.",
			"meta": {
				"refs": [
					"https://www.anu.edu.au/"
				]
			},
			"uuid": "5b3d6b62-8d3f-11e9-bc42-526af7764f64",
			"value": "The Australian National University"
		},
		{
			"description": "The University of Chicago Medicine, with a history dating to 1927, is a not-for-profit academic medical health system based on the campus of the University of Chicago in Hyde Park, and with hospitals, outpatient clinics and physician practices throughout Chicago and its suburbs. UChicago Medicine unites five organizations to fulfill its tripartite mission of medical education, research and patient care; Pritzker School of Medicine, Biological Sciences Division, Medical Center, Community Health and Hospital Division, and UChicago Medicine Physicians.",
			"meta": {
				"refs": [
					"https://www.uchicagomedicine.org/"
				]
			},
			"uuid": "5b3d6dec-8d3f-11e9-bc42-526af7764f64",
			"value": "The University of Chicago Medicine"
		},
		{
			"description": "Shanghai Jiao Tong University is a major research university in Shanghai. Established in 1896 as Nanyang Public School by an imperial edict issued by the Guangxu Emperor, it has been referred to as The MIT of the East since the 1930s.",
			"meta": {
				"refs": [
					"https://en.wikipedia.org/wiki/Shanghai_Jiao_Tong_University"
				]
			},
			"uuid": "5b3d6fc2-8d3f-11e9-bc42-526af7764f64",
			"value": "Shanghai Jiao Tong University"
		},
		{
			"description": "Australian Catholic University is a public university in Australia. It has seven Australian campuses, and also maintains a campus in Rome. In 2016 it had 24,458 students. ACU is made up of four faculties, which offer bachelor, master and doctoral degrees.",
			"meta": {
				"refs": [
					"https://www.acu.edu.au/"
				]
			},
			"uuid": "1e83c638-95ed-11e9-bc42-526af7764f64",
			"value": "Australian Catholic University"
		},
		{
			"description": "Temple University is a state-related research university located in Philadelphia, Pennsylvania. It was founded in 1884 by the Baptist minister Russell Conwell.",
			"meta": {
				"refs": [
					"https://www.temple.edu/"
				]
			},
			"uuid": "1e83c8c2-95ed-11e9-bc42-526af7764f64",
			"value": "Temple University"
		},
		{
			"description": "Graceland University is a private liberal arts university with campuses in Lamoni, Iowa and Independence, Missouri. The university offers degree completion and master’s degree programs at satellite campuses in Centerville and Cedar Rapids, Iowa and Trenton, Missouri.",
			"meta": {
				"refs": [
					"https://www.graceland.edu/"
				]
			},
			"uuid": "1e83ca16-95ed-11e9-bc42-526af7764f64",
			"value": "Graceland University"
		},
		{
			"description": "Oregon State University is a public research university in Corvallis, Oregon. The university offers more than 200 undergraduate degree programs along with a variety of graduate and doctoral degrees. It is also the largest university in the state, with a total enrollment exceeding 28,000.",
			"meta": {
				"refs": [
					"https://oregonstate.edu/"
				]
			},
			"uuid": "1e83cb56-95ed-11e9-bc42-526af7764f64",
			"value": "Oregon State University"
		},
		{
			"description": "Missouri Southern State University is a public university in Joplin, Missouri. It was established in 1937 as Joplin Junior College.",
			"meta": {
				"refs": [
					"https://www.mssu.edu/"
				]
			},
			"uuid": "1e83cf0c-95ed-11e9-bc42-526af7764f64",
			"value": "Missouri Southern State University"
		},
		{
			"description": "Nagle Catholic College commonly known as Nagle or NCC, is an independent Roman Catholic co-educational secondary day school, located in the coastal town of Geraldton in the Mid West region of Western Australia, Australia.",
			"meta": {
				"refs": [
					"http://www.ncc.wa.edu.au/"
				]
			},
			"uuid": "1e83d04c-95ed-11e9-bc42-526af7764f64",
			"value": "Nagle Catholic College"
		},
		{
			"description": "K12 Inc. is a for-profit education company that sells online schooling and curricula. K12 is an education management organization that provides online education designed as alternatives alternative to traditional bricks and mortar education for public school students from kindergarten to 12th grade.",
			"meta": {
				"refs": [
					"https://www.k12.com/"
				]
			},
			"uuid": "2d95c98e-a5cc-11e9-a2a3-2a2ae2dbcce4",
			"value": "K12 Inc."
		},
		{
			"description": "Monroe College is a private for-profit college and graduate school based in New York City. The college was founded in 1933 and has campuses in the Bronx, New Rochelle, and Saint Lucia with an extension site in Manhattan. The college is named after James Monroe, the fifth President of the United States.",
			"meta": {
				"refs": [
					"https://www.monroecollege.edu/"
				]
			},
			"uuid": "2d95cc0e-a5cc-11e9-a2a3-2a2ae2dbcce4",
			"value": "Monroe College"
		},
		{
			"description": "Northwest Indian College is a public college in Bellingham, Washington. It was established by the Lummi Nation and is the only accredited Tribal College or University serving reservation communities of Washington, Oregon, and Idaho.",
			"meta": {
				"refs": [
					"https://www.nwic.edu/"
				]
			},
			"uuid": "638de678-abbe-11e9-a2a3-2a2ae2dbcce4",
			"value": "Northwest Indian College"
		},
		{
			"description": "The University of Nebraska–Lincoln, commonly referred to as Nebraska, UNL, or NU, is a public research university in Lincoln, Nebraska. It is the state's oldest university and the largest in the University of Nebraska system.",
			"meta": {
				"refs": [
					"https://www.unl.edu/"
				]
			},
			"uuid": "638de8c6-abbe-11e9-a2a3-2a2ae2dbcce4",
			"value": "University of Nebraska-Lincoln"
		},
		{
			"description": "The University of Alabama is a public research university in Tuscaloosa, Alabama. Established in 1820, the University of Alabama is the oldest and largest of the public universities in Alabama as well as the flagship of the University of Alabama System.",
			"meta": {
				"refs": [
					"https://www.ua.edu/"
				]
			},
			"uuid": "638dea10-abbe-11e9-a2a3-2a2ae2dbcce4",
			"value": "The University of Alabama"
		},
		{
			"description": "Lancaster University is a collegiate public research university in Lancaster, Lancashire, England. The university was established by Royal Charter in 1964, one of several new universities created in the 1960s.",
			"meta": {
				"refs": [
					"https://www.lancaster.ac.uk/"
				]
			},
			"uuid": "f78337d6-b616-11e9-a2a3-2a2ae2dbcce4",
			"value": "Lancaster University"
		},
		{
			"description": "The University of Hawaii at Mānoa is a public co-educational research university as well as the flagship campus of the University of Hawaii system.",
			"meta": {
				"refs": [
					"https://www.hawaii.edu/"
				]
			},
			"uuid": "f7833a42-b616-11e9-a2a3-2a2ae2dbcce4",
			"value": "University of Hawaii at Mānoa"
		},
		{
			"description": "There are 25 million currently unfilled or soon-to-be created mid-skill jobs. Graduation Alliance can help train and prepare students for gainful employment.",
			"meta": {
				"refs": [
					"https://www.graduationalliance.com/"
				]
			},
			"uuid": "f7833b96-b616-11e9-a2a3-2a2ae2dbcce4",
			"value": "Graduation Alliance Inc."
		},
		{
			"description": "The University of Western Australia is a public research university in the Australian state of Western Australia. The university's main campus is in Perth, the state capital, with a secondary campus in Albany and various other facilities elsewhere.",
			"meta": {
				"refs": [
					"https://www.uwa.edu.au/"
				]
			},
			"uuid": "f7833cd6-b616-11e9-a2a3-2a2ae2dbcce4",
			"value": "The University of Western Australia"
		},
		{
			"description": "An authorized World School of the International Baccalaureate Organization (IBO), the only elementary school in New Orleans with this designation. The school has built a program of study that is both developmentally appropriate for young children and challenging to their growth as students. Their Primary Years Programme offers a rigorous curriculum that crosses disciplines and aligns with many of the Common Core State Standards for learning. We are a candidate school of the IBO, offering the Middle Years Programme (MYP) and hope to be fully authorized to deliver this program in 2017.",
			"meta": {
				"refs": [
					"https://www.morrisjeffschool.org/"
				]
			},
			"uuid": "f7834028-b616-11e9-a2a3-2a2ae2dbcce4",
			"value": "Morris Jeff Community School"
		},
		{
			"description": "TAFE NSW is an Australian vocational education and training provider. Annually, the network trains over 500,000 students in campus, workplace, online, or distance education methods of education. It was established as an independent statutory body under the TAFE Commission Act 1990.",
			"meta": {
				"refs": [
					"https://www.tafensw.edu.au/"
				]
			},
			"uuid": "beeff87c-bf81-11e9-9cb5-2a2ae2dbcce4",
			"value": "TAFE NSW"
		},
		{
			"description": "The University of Hong Kong is a public research university in Hong Kong. Founded in 1911, its origins trace back to the Hong Kong College of Medicine for Chinese, which was founded in 1887. It is the oldest tertiary institution in Hong Kong.",
			"meta": {
				"refs": [
					"https://www.hku.hk/"
				]
			},
			"uuid": "beeffb06-bf81-11e9-9cb5-2a2ae2dbcce4",
			"value": "University of Hong Kong"
		},
		{
			"description": "Arizona State University is a public metropolitan research university on five campuses across the Phoenix metropolitan area, and four regional learning centers throughout Arizona. ASU is one of the largest public universities by enrollment in the U.S.",
			"meta": {
				"refs": [
					"https://www.asu.edu/"
				]
			},
			"uuid": "566c0704-c676-11e9-aa8c-2a2ae2dbcce4",
			"value": "Arizona State University"
		},
		{
			"description": "Meridian Community College is a public community college in Meridian, Mississippi. Founded in 1937, it was originally named Meridian Junior College but changed its name in 1987.",
			"meta": {
				"refs": [
					"http://www.meridiancc.edu/"
				]
			},
			"uuid": "4371c384-d353-11e9-bb65-2a2ae2dbcce4",
			"value": "Meridian Community College"
		},
		{
			"description": "Our students are set up for success with online learning, one-on-one mentorship, living stipends, career coaching, access to one of the most enviable employer networks in the industry, and a tuition refund guarantee",
			"meta": {
				"refs": [
					"https://www.thinkful.com/"
				]
			},
			"uuid": "3606d3a0-e17d-11e9-81b4-2a2ae2dbcce4",
			"value": "Thinkful, Inc."
		},
		{
			"description": "Saint Mary's College is a Catholic women's liberal arts college in Notre Dame, Indiana. Founded in 1844 by the Sisters of the Holy Cross, the name of the school refers to the Blessed Virgin Mary. Saint Mary's offers five bachelor's degrees and more than 30 major areas of study.",
			"meta": {
				"refs": [
					"https://www.saintmarys.edu/"
				]
			},
			"uuid": "351830f4-e5fd-11e9-81b4-2a2ae2dbcce4",
			"value": "Saint Mary’s College"
		},
		{
			"description": "Chegg, Inc. is an American education technology company based in Santa Clara, California that provides student services like homework help, online tutoring, test preparation, scholarship searches, internship matching, and college application advice, as well as both digital and physical textbook rentals.",
			"meta": {
				"refs": [
					"https://www.chegg.com/"
				]
			},
			"uuid": "35183630-e5fd-11e9-81b4-2a2ae2dbcce4",
			"value": "Chegg, Inc."
		},
		{
			"description": "The University of Alabama at Birmingham (UAB) School of Medicine is a public medical school located in Birmingham, Alabama, United States with branch campuses in Huntsville, Montgomery, and at the University of Alabama College of Community Health Sciences in Tuscaloosa.",
			"meta": {
				"refs": [
					"https://www.uab.edu/medicine/home/"
				]
			},
			"uuid": "bb2e2266-e86e-11e9-81b4-2a2ae2dbcce4",
			"value": "The University of Alabama at Birmingham (UAB) School of Medicine"
		},
		{
			"description": "The Graduate School of Public Health is one of 17 schools at the University of Pittsburgh. The school, founded in 1948, was first led by Thomas Parran, surgeon general of the U.S. Public Health Service. It is ranked as the 13th best public health school in the United States by US News and World Report.",
			"meta": {
				"refs": [
					"https://www.publichealth.pitt.edu/"
				]
			},
			"uuid": "bb2e24c8-e86e-11e9-81b4-2a2ae2dbcce4",
			"value": "University of Pittsburgh Graduate School of Public Health"
		},
		{
			"description": "Kent State University is a public research university in Kent, Ohio. The university also includes seven regional campuses in Northeast Ohio and additional facilities in the region and internationally.",
			"meta": {
				"refs": [
					"https://www.kent.edu/"
				]
			},
			"uuid": "b5b234e2-eea6-11e9-81b4-2a2ae2dbcce4",
			"value": "Kent State University"
		},
		{
			"description": "Southeast Missouri State University, is a public university in Cape Girardeau, Missouri. The institution, having started as a normal school, has a traditional strength in teacher education.",
			"meta": {
				"refs": [
					"https://semo.edu/"
				]
			},
			"uuid": "7feedc3e-0332-11ea-9a9f-362b9e155667",
			"value": "Southeast Missouri State University"
		},
		{
			"description": "Washington University School of Medicine is the medical school of Washington University in St. Louis in St. Louis, Missouri. Founded in 1891, the School of Medicine has 1,260 students, 604 of which are pursuing a medical degree with or without a combined Doctor of Philosophy or other advanced degree.",
			"meta": {
				"refs": [
					"https://medicine.wustl.edu/"
				]
			},
			"uuid": "7feedeaa-0332-11ea-9a9f-362b9e155667",
			"value": "Washington University School of Medicine"
		},
		{
			"description": "The University of North Carolina School of Medicine is a professional school within the University of North Carolina at Chapel Hill. It offers a Doctor of Medicine degree along with combined Doctor of Medicine-Doctor of Philosophy or Doctor of Medicine-Master of Public Health degrees.",
			"meta": {
				"refs": [
					"https://www.med.unc.edu/"
				]
			},
			"uuid": "d6454336-096b-11ea-8d71-362b9e155667",
			"value": "UNC School of Medicine"
		},
		{
			"description": "Baton Rouge Community College is an open admissions public community college in Baton Rouge, Louisiana. Established on June 28, 1995, the college settled into a permanent location in 1998.",
			"meta": {
				"refs": [
					"https://www.mybrcc.edu/"
				]
			},
			"uuid": "2b9e5d1a-1f8b-11ea-978f-2e728ce88125",
			"value": "Baton Rouge Community College"
		},
		{
			"description": "In the place where innovative education, cutting-edge research and community outreach intersect, you'll find Simon Fraser University. Our vision? To be Canada's leading engaged university. Born in 1965, SFU has become Canada's leading comprehensive university with vibrant campuses in British Columbia's largest municipalities — Vancouver, Burnaby and Surrey — and deep roots in partner communities throughout the province and around the world.",
			"meta": {
				"refs": [
					"https://www.sfu.ca/"
				]
			},
			"uuid": "ec4a0e34-6314-11ea-bc55-0242ac130003",
			"value": "Simon Fraser University"
		},
		{
			"description": "Wichita State University is a public research university in Wichita, Kansas, United States, and governed by the Kansas Board of Regents. Wichita State University offers more than 60 undergraduate degree programs in more than 200 areas of study in six colleges.",
			"meta": {
				"refs": [
					"https://www.wichita.edu/"
				]
			},
			"uuid": "cbdb86de-686c-11ea-bc55-0242ac130003",
			"value": "Wichita State University"
		},
		{
			"description": "Melbourne Polytechnic, formerly NMIT, is a TAFE and higher education institute located predominantly in the northern suburbs of Melbourne, but also in the south with a campus at Prahran, Victoria, Australia.",
			"meta": {
				"refs": [
					"https://www.melbournepolytechnic.edu.au/"
				]
			},
			"uuid": "cbdb8954-686c-11ea-bc55-0242ac130003",
			"value": "Melbourne Polytechnic"
		},
		{
			"description": "Online resource for musical instruction.",
			"meta": {
				"refs": [
					"https://truefire.com/"
				]
			},
			"uuid": "c63612e4-691b-11ea-bc55-0242ac130003",
			"value": "TrueFire"
		},
		{
			"description": "College of DuPage is a public community college with its main campus in Glen Ellyn, Illinois. The college also owns and operates facilities in the Illinois communities of Addison, Carol Stream, Naperville and Westmont. With more than 28,000 students, the College of DuPage is the second largest provider of undergraduate education in Illinois. The college serves students residing in Illinois' Community College District 502.",
			"meta": {
				"refs": [
					"https://cod.edu/",
					"https://en.wikipedia.org/wiki/College_of_DuPage"
				]
			},
			"uuid": "f607c55e-6d20-11ea-bc55-0242ac130003",
			"value": "College of DuPage"
		},
		{
			"description": "Illinois Valley Community College is a community college in Oglesby, Illinois. The college serves a 2,000-square-mile district encompassing all of Putnam and parts of Bureau, LaSalle, DeKalb, Grundy, Lee, Livingston, and Marshall counties. The college sits on a 425-acre campus that was constructed in 1972.",
			"meta": {
				"refs": [
					"https://www.ivcc.edu/"
				]
			},
			"uuid": "9feb7ed2-8aed-11ea-bc55-0242ac130003",
			"value": "Illinois Valley Community College"
		},
		{
			"description": "The University of Warwick is a public research university on the outskirts of Coventry between the West Midlands and Warwickshire, England. It was founded in 1965 as part of a government initiative to expand higher education.",
			"meta": {
				"refs": [
					"https://warwick.ac.uk/"
				]
			},
			"uuid": "9feb80f8-8aed-11ea-bc55-0242ac130003",
			"value": "University of Warwick"
		},
		{
			"description": "SWPS University of Social Sciences and Humanities or simply SWPS University is a private non-profit university in Poland established in 1996 by three professors of Psychology, Andrzej Eliasz, Zbigniew Pietrasiński and Janusz Reykowski.",
			"meta": {
				"refs": [
					"https://english.swps.pl/"
				]
			},
			"uuid": "785a54ae-8fcc-11ea-bc55-0242ac130003",
			"value": "SWPS University of Social Sciences and Humanities"
		},
		{
			"description": "Sorting Hat Technologies Private Limited develops and operates an online platform for free education. The Company, through its platform, provides lessons, courses, and videos in multiple languages. Sorting Hat Technologies serves customers in India.",
			"meta": {
				"refs": [
					"https://www.bloomberg.com/profile/company/1434617D:IN"
				]
			},
			"uuid": "9f1662c8-9539-11ea-bb37-0242ac130002",
			"value": "Sorting Hat Technologies Private Limited"
		},
		{
			"description": "Education application created by Sorting Hat Technologies Private Ltd. With Unacademy, India's largest education platform, we are changing that. In a span of 6 months, over 300,000 students have benefited from over 2,400 online lessons and specialised courses on cracking various competitive examinations, on our platform. We have on board some of the top educators in the country, including Kiran Bedi, India's first woman IPS officer and now the Governor of Pondicherry. With over 2 million views every month, we are touching the lives of people in the remotest corners of the country.",
			"meta": {
				"refs": [
					"https://unacademy.com/"
				]
			},
			"uuid": "9f1664e4-9539-11ea-bb37-0242ac130002",
			"value": "Unacademy"
		},
		{
			"description": "The Ruhr-University Bochum, located on the southern hills of central Ruhr area in Bochum, was founded in 1962 as the first new public university in Germany after World War II. Instruction began in 1965.",
			"meta": {
				"refs": [
					"https://www.ruhr-uni-bochum.de/en"
				]
			},
			"uuid": "9f1665de-9539-11ea-bb37-0242ac130002",
			"value": "The Ruhr-University Bochum"
		},
		{
			"description": "Mathway provides students with the tools they need to understand and solve their math problems. With millions of users and billions of problems solved, Mathway is the premier problem solving resource available for students, parents, and teachers.",
			"meta": {
				"refs": [
					"https://www.linkedin.com/company/mathway/about/"
				]
			},
			"uuid": "9a308a9a-a042-11ea-bb37-0242ac130002",
			"value": "Mathway"
		},
		{
			"description": "At EDUCBA  you can Learn Real World Skills Online from over 4500 Courses. Anytime,  Anywhere, using Any Device.",
			"meta": {
				"refs": [
					"https://www.linkedin.com/company/corporate-bridge-academy/about/"
				]
			},
			"uuid": "9a308ca2-a042-11ea-bb37-0242ac130002",
			"value": "eduCBA"
		},
		{
			"description": "Michigan State University (MSU) is a public research university in East Lansing, Michigan. MSU was founded in 1855 and served as a model for land-grant universities later created under the Morrill Act of 1862. The university was founded as the Agricultural College of the State of Michigan, one of the country's first institutions of higher education to teach scientific agriculture. After the introduction of the Morrill Act, the college became coeducational and expanded its curriculum beyond agriculture. Today, MSU is one of the largest universities in the United States (in terms of enrollment) and has approximately 634,300 living alumni worldwide.",
			"meta": {
				"refs": [
					"https://en.wikipedia.org/wiki/Michigan_State_University",
					"https://msu.edu/"
				]
			},
			"uuid": "fd438a7e-a5c9-11ea-bb37-0242ac130002",
			"value": "Michigan State University"
		},
		{
			"description": "Ahmadu Bello University is a federal government research university in Zaria, Kaduna State, Nigeria. ABU was founded on 4 October 1962, as the University of Northern Nigeria. The university operates two campuses: Samaru and Kongo in Zaria.",
			"meta": {
				"refs": [
					"https://www.abu.edu.ng/"
				]
			},
			"uuid": "fd438c90-a5c9-11ea-bb37-0242ac130002",
			"value": "Ahmadu Bello University"
		},
		{
			"description": "University of Benin is a research university located in Benin City, Edo State, Nigeria. It is among the universities owned by the Federal Government of Nigeria and was founded in 1970.",
			"meta": {
				"refs": [
					"http://uniben.edu/"
				]
			},
			"uuid": "fd438d8a-a5c9-11ea-bb37-0242ac130002",
			"value": "University of Benin"
		},
		{
			"description": "Mount Kenya University is a private, multi-campus, chartered and ISO 9001:2015 Certified university in Kenya. It was founded by Prof. Simon N. Gicharu. MKU is one of the largest private universities in the country, with a student body in excess of 52,000, as at September 2015.",
			"meta": {
				"refs": [
					"https://www.mku.ac.ke/"
				]
			},
			"uuid": "fd438e5c-a5c9-11ea-bb37-0242ac130002",
			"value": "Mount Kenya University"
		},
		{
			"description": "Columbia College Chicago is a private college specializing in arts and media disciplines and located in Chicago, Illinois. Founded in 1890, it has 6,195 students pursuing degrees in more than 60 undergraduate and graduate degree programs. It is accredited by the Higher Learning Commission.",
			"meta": {
				"refs": [
					"https://www.colum.edu/"
				]
			},
			"uuid": "430019e0-ab44-11ea-bb37-0242ac130002",
			"value": "Columbia College Chicago"
		},
		{
			"description": "The University of California is a public university system in the U.S. state of California. The system is composed of the campuses at Berkeley, Davis, Irvine, Los Angeles, Merced, Riverside, San Diego, San Francisco, Santa Barbara, and Santa Cruz, along with numerous research centers and academic abroad centers.",
			"meta": {
				"refs": [
					"https://www.universityofcalifornia.edu/"
				]
			},
			"uuid": "43001c38-ab44-11ea-bb37-0242ac130002",
			"value": "University of California"
		},
		{
			"description": "San Beda University is a private Roman Catholic university run by the Benedictine monks in the Philippines. Its main campus which provides tertiary education is situated in Mendiola, Manila. It has an affiliated campus that provides elementary and high school education in Taytay, Rizal. The Benedictine College in Alabang, Muntinlupa known as the San Beda College Alabang is an autonomous institution despite being an affiliate of San Beda University.",
			"meta": {
				"refs": [
					"https://en.wikipedia.org/wiki/San_Beda_University"
				]
			},
			"uuid": "43001dd2-ab44-11ea-bb37-0242ac130002",
			"value": "San Beda University (SBU)"
		},
		{
			"description": "Far Eastern University, also known simply as FEU, is a private university in Manila, Philippines. Created by the merger of Far Eastern College and the Institute of Accounts Business and Finance, FEU became a university in 1934 under the guidance of its first president, Dr. Nicanor B. Reyes Sr. It has been noted as the leading proprietary university in the Philippines. The first accountancy and business school for Filipinos, the University, through the years, has expanded its course offerings to the Arts and Sciences, Architecture and Fine Arts, Education, Engineering and Computer Studies, Graduate Studies, Tourism and Hotel Management, Law, Nursing and Medicine.",
			"meta": {
				"refs": [
					"https://en.wikipedia.org/wiki/Far_Eastern_University"
				]
			},
			"uuid": "612945ba-b6e6-11ea-b3de-0242ac130004",
			"value": "The Far Eastern University"
		},
		{
			"description": "Cebu Normal University, abbreviated as CNU, is a state research university in Cebu City, Philippines established in 1902. CNU is designated by the Commission on Higher Education (CHED) as Center of Excellence (COE) in both Nursing Education and Teacher Education.",
			"meta": {
				"refs": [
					"https://en.wikipedia.org/wiki/Cebu_Normal_University"
				]
			},
			"uuid": "61294916-b6e6-11ea-b3de-0242ac130004",
			"value": "Cebu Normal University (CNU)"
		},
		{
			"description": "Mid Michigan College is a public community college with two locations in Michigan, one in Harrison, Michigan and one in Mount Pleasant, Michigan. Founded in 1965, the college offers one- and two-year certificates and associate degrees in transfer, occupational, and health science programs.",
			"meta": {
				"refs": [
					"https://www.midmich.edu/"
				]
			},
			"uuid": "61294a24-b6e6-11ea-b3de-0242ac130004",
			"value": "Mid Michigan Community College"
		},
		{
			"description": "The University of Michigan, often simply referred to as Michigan, is a public research university in Ann Arbor, Michigan. The university is Michigan's oldest. it was founded in 1817 in Detroit, as the Catholepistemiad, or the University of Michigania, 20 years before the territory became a state.",
			"meta": {
				"refs": [
					"https://umich.edu/"
				]
			},
			"uuid": "1872d7d6-c1e6-11ea-b3de-0242ac130004",
			"value": "The University of Michigan"
		},
		{
			"description": "The University of Delhi, informally known as Delhi University, is a collegiate public central university, located in New Delhi, India. It was founded in 1922 by an Act of the Central Legislative Assembly.",
			"meta": {
				"refs": [
					"http://du.ac.in/"
				]
			},
			"uuid": "acb3e26e-cce0-11ea-87d0-0242ac130003",
			"value": "University of Delhi"
		},
		{
			"description": "The Royal Military College of Canada, commonly abbreviated as RMC, is the military college of the Canadian Armed Forces, and is a degree-granting university training military officers. RMC was established in 1876 and is the only federal institution in Canada with degree-granting powers.",
			"meta": {
				"refs": [
					"https://en.wikipedia.org/wiki/Royal_Military_College_of_Canada"
				]
			},
			"uuid": "acb3e476-cce0-11ea-87d0-0242ac130003",
			"value": "Royal Military College of Canada"
		},
		{
			"description": "The University of York is a collegiate research university, located in the city of York, England. Established in 1963, the university has expanded to more than thirty departments and centres, covering a wide range of subjects.",
			"meta": {
				"refs": [
					"https://www.york.ac.uk/"
				]
			},
			"uuid": "5a6497dc-d335-11ea-87d0-0242ac130003",
			"value": "The University of York"
		},
		{
			"description": "SUNY Erie is a community college in New York. It is part of the 64-campus State University of New York system and serves Erie County and the surrounding communities of western New York. It has 3 campuses, north in Williamsville, NY, city in Buffalo, NY, and south in Orchard Park, NY.",
			"meta": {
				"refs": [
					"https://www.ecc.edu/"
				]
			},
			"uuid": "5a6499da-d335-11ea-87d0-0242ac130003",
			"value": "Erie Community College"
		},
		{
			"description": "Sheffield Hallam University is a public research university in Sheffield, South Yorkshire, England and one of the UK's largest and most diverse universities.",
			"meta": {
				"refs": [
					"https://www.shu.ac.uk/"
				]
			},
			"uuid": "5a649aca-d335-11ea-87d0-0242ac130003",
			"value": "Sheffield Hallam University"
		},
		{
			"description": "The University of Auckland is a public research university in Auckland, New Zealand. The institution was established in 1883 as Auckland University College, a constituent college of the University of New Zealand.",
			"meta": {
				"refs": [
					"https://www.auckland.ac.nz/en.html"
				]
			},
			"uuid": "0135894e-d7e7-11ea-87d0-0242ac130003",
			"value": "University of Auckland"
		},
		{
			"description": "Slippery Rock University of Pennsylvania is a public university in Slippery Rock, Pennsylvania. SRU is a member of the Pennsylvania State System of Higher Education. The university has been coeducational since its founding in 1889. Its campus occupies 611 acres.",
			"meta": {
				"refs": [
					"https://www.sru.edu/"
				]
			},
			"uuid": "01358b56-d7e7-11ea-87d0-0242ac130003",
			"value": "Slippery Rock University"
		},
		{
			"description": "The University of Oklahoma is a public research university in Norman, Oklahoma. Founded in 1890, it had existed in Oklahoma Territory near Indian Territory for 17 years before the two became the state of Oklahoma. In Fall 2018 the university had 31,702 students enrolled, most at its main campus in Norman.",
			"meta": {
				"refs": [
					"https://www.ou.edu/"
				]
			},
			"uuid": "01358c46-d7e7-11ea-87d0-0242ac130003",
			"value": "The University of Oklahoma"
		},
		{
			"description": "ProctorU is a real proctoring service that allows students to complete their exams from nearly any location while still ensuring the academic integrity of the exam for the institution. Using almost any webcam and computer, students connect to real people who help enter the exam and monitor real time as they complete it. Proctors act as the student's personal exam concierge, helping them with technical difficulties and making sure they understand the rules of the exam.",
			"meta": {
				"refs": [
					"https://www.linkedin.com/company/proctoru/about/"
				]
			},
			"uuid": "c7f0a0ae-e08f-11ea-87d0-0242ac130003",
			"value": "ProctorU"
		},
		{
			"description": "The University of North Carolina Wilmington is a public research university in Wilmington, North Carolina. It is part of the University of North Carolina System and enrolls 16,747 undergraduate and graduate students each year.",
			"meta": {
				"refs": [
					"https://uncw.edu/"
				]
			},
			"uuid": "c7f0a2fc-e08f-11ea-87d0-0242ac130003",
			"value": "The University of North Carolina Wilmington"
		},
		{
			"description": "The University of Texas at Tyler is a public university in Tyler, Texas. Founded in 1971, it is a part of the University of Texas System.",
			"meta": {
				"refs": [
					"https://www.uttyler.edu/"
				]
			},
			"uuid": "c7f0a3ec-e08f-11ea-87d0-0242ac130003",
			"value": "The University of Texas at Tyler"
		},
		{
			"description": "Coastal Preparatory Academy (CPA) is a tuition-free, non-profit K-8 charter school established in 2017 and located in New Hanover County. CPA serves students in New Hanover, Pender, Brunswick, Onslow and Bladen County. CPA is dedicated to improving the lives of its students by providing authentic learning experiences in a collaborative, nurturing environment that will build a foundation for students’ success in school, at future work, and in life.",
			"meta": {
				"refs": [
					"https://coastalprep.cfacademy.school/"
				]
			},
			"uuid": "87432100-e2e0-11ea-87d0-0242ac130003",
			"value": "Coastal Preparatory Academy"
		},
		{
			"description": "Northumbria University is a university located in Newcastle upon Tyne in the North East of England, gaining university status in 1992.",
			"meta": {
				"refs": [
					"https://www.northumbria.ac.uk/"
				]
			},
			"uuid": "669a0300-f367-11ea-adc1-0242ac120002",
			"value": "University of Northumbria"
		},
		{
			"description": "Newcastle University is a UK public research university based in Newcastle upon Tyne, North East England with overseas campuses in Singapore and Malaysia. The university is a red brick university and a member of the Russell Group, an association of research-intensive UK universities.",
			"meta": {
				"refs": [
					"https://www.ncl.ac.uk/"
				]
			},
			"uuid": "c4e5f11e-f81f-11ea-adc1-0242ac120002",
			"value": "Newcastle University"
		},
		{
			"description": "Guilford Technical Community College is a public community college in the Piedmont Triad of North Carolina. Guilford Technical Community College also has a campus in Jamestown and High Point.",
			"meta": {
				"refs": [
					"https://www.gtcc.edu/"
				]
			},
			"uuid": "7c01d712-fda4-11ea-adc1-0242ac120002",
			"value": "Guilford Technical Community College"
		},
		{
			"description": "The University of Tasmania is a public research university primarily located in Tasmania, Australia. Founded in 1890, it is Australia's fourth oldest university. Christ College, one of the university's residential colleges, was founded in 1846 and is the oldest tertiary institution in the country.",
			"meta": {
				"refs": [
					"https://www.utas.edu.au/"
				]
			},
			"uuid": "7c01d7da-fda4-11ea-adc1-0242ac120002",
			"value": "The University of Tasmania"
		},
		{
			"description": "Flagler College is a private liberal arts college in St. Augustine, Florida. It was founded in 1968 and offers 33 undergraduate majors and 1 master's program. It also has a campus in Tallahassee.",
			"meta": {
				"refs": [
					"https://www.flagler.edu/"
				]
			},
			"uuid": "f1bf2aea-0321-11eb-adc1-0242ac120002",
			"value": "Flagler College"
		},
		{
			"description": "Gulf Coast State College is a public college in Panama City, Florida. It is part of the Florida College System and offers the Associate of Arts degree, Associate of Science degrees, certificates, and, as of 2020, bachelor's degrees.",
			"meta": {
				"refs": [
					"https://www.gulfcoast.edu/"
				]
			},
			"uuid": "dabf8fcc-08a0-11eb-adc1-0242ac120002",
			"value": "Gulf Coast State College"
		},
		{
			"description": "The University of Mumbai, informally known as Mumbai University is a collegiate public state university located in Mumbai, Maharashtra. It offers bachelors, masters and Doctoral courses, as well as diplomas and certificates in many disciplines like the Arts, Commerce, Science, Medical and Engineering.",
			"meta": {
				"refs": [
					"https://mu.ac.in/"
				]
			},
			"uuid": "b2e6c1f6-0e17-11eb-adc1-0242ac120002",
			"value": "University of Mumbai"
		},
		{
			"description": "Piedmont Community College is a public community college in Roxboro, North Carolina. It is one of 58 colleges in the North Carolina Community College System.",
			"meta": {
				"refs": [
					"https://www.piedmontcc.edu/"
				]
			},
			"uuid": "388f4fa2-1e9f-11eb-adc1-0242ac120002",
			"value": "Piedmont Community College"
		},
		{
			"description": "Saskatchewan Polytechnic (formerly the Saskatchewan Institute of Applied Science and Technology or SIAST) is Saskatchewan's primary public institution for post-secondary technical education and skills training, recognized nationally and internationally for its expertise and innovation. Through program and course registrations, Saskatchewan Polytechnic serves 26,000 distinct students with programs that touch every sector of the economy. It operates campuses in Moose Jaw, Prince Albert, Regina and Saskatoon and provides a number of courses and programs through distance education.",
			"meta": {
				"refs": [
					"https://en.wikipedia.org/wiki/Saskatchewan_Polytechnic"
				]
			},
			"uuid": "5688c8b0-2450-11eb-adc1-0242ac120002",
			"value": "Saskatchewan Polytechnic"
		},
		{
			"description": "Southern Illinois University School of Medicine is a medical school located in Springfield, the capital of the U.S. state of Illinois. It is part of the Southern Illinois University system, which includes a campus in Edwardsville as well as the flagship in Carbondale.",
			"meta": {
				"refs": [
					"https://www.siumed.edu/"
				]
			},
			"uuid": "4dc71796-7ebd-11eb-9439-0242ac130002",
			"value": "Southern Illinois University School of Medicine"
		},
		{
			"description": "The Center for Early Education is a private primary school located in West Hollywood, Los Angeles County, California.",
			"meta": {
				"refs": [
					"https://www.centerforearlyeducation.org/"
				]
			},
			"uuid": "4dc719d0-7ebd-11eb-9439-0242ac130002",
			"value": "The Center for Early Education, CA"
		},
		{
			"description": "The Nova Education Trust is a cross-phase Multi-Academy Trust based in Nottinghamshire. Our trust is committed to providing high quality education to all of our students, regardless of their backgrounds. Our track record demonstrates our ability to deliver our core goal, achievement for every child. The schools in our portfolio includes both secondary and primaries, working in a range of contexts. We also run a successful School Centred Initial Teacher Training (SCITT) programme and a Teaching School Alliance (TSA) which links 23 schools together sharing effective practice and developing new models for staff development.",
			"meta": {
				"refs": [
					"https://www.novaeducationtrust.net/"
				]
			},
			"uuid": "4dc71ade-7ebd-11eb-9439-0242ac130002",
			"value": "The Nova Education Trust"
		},
		{
			"description": "Central Piedmont Community College is a public community college in Charlotte, North Carolina. With an enrollment of more than 50,000 students annually, Central Piedmont is the second largest community college in the North Carolina Community College System and the largest in the Charlotte metropolitan area.",
			"meta": {
				"refs": [
					"https://www.cpcc.edu/"
				]
			},
			"uuid": "4dc71bc4-7ebd-11eb-9439-0242ac130002",
			"value": "Central Piedmont Community College"
		},
		{
			"description": "The University of the Highlands and Islands is a tertiary university composed of Academic Partners which are the 13 colleges and research institutions in the Highlands and Islands of Scotland delivering higher education. Its executive office is in the former Royal Northern Infirmary building in Inverness.",
			"meta": {
				"refs": [
					"https://www.uhi.ac.uk/"
				]
			},
			"uuid": "d0d3adec-833c-11eb-8dcd-0242ac130003",
			"value": "The University of the Highlands and Islands"
		},
		{
			"description": "South & City College Birmingham is a further education and higher education college in Birmingham, England, providing full-time and part-time courses. It was previously known as South Birmingham College and City College Birmingham before the merger.",
			"meta": {
				"refs": [
					"https://www.sccb.ac.uk/"
				]
			},
			"uuid": "3027b19a-8b11-11eb-8dcd-0242ac130003",
			"value": "South and City College Birmingham"
		},
		{
			"description": "Castle School Education Trust is a multi academy trust situated in South Gloucester.",
			"meta": {
				"refs": [
					"https://www.linkedin.com/company/castle-school-education-trust/about/"
				]
			},
			"uuid": "3027b492-8b11-11eb-8dcd-0242ac130003",
			"value": "Castle School Education Trust"
		},
		{
			"description": "Kentucky Wesleyan College is a private Methodist college in Owensboro, Kentucky. The college is known for its liberal arts programs. Fall 2018 enrollment was 830 students.",
			"meta": {
				"refs": [
					"https://kwc.edu/"
				]
			},
			"uuid": "3f0e476c-8f32-11eb-8dcd-0242ac130003",
			"value": "Kentucky Wesleyan College"
		},
		{
			"description": "The Maricopa County Community College District, also known as Maricopa Community Colleges, is a community college district in Arizona with its headquarters in Tempe. It is one of the largest, serving more than 220,000 students each year in Maricopa County, Arizona.",
			"meta": {
				"refs": [
					"https://www.maricopa.edu/"
				]
			},
			"uuid": "3f0e4a0a-8f32-11eb-8dcd-0242ac130003",
			"value": "The Maricopa County Community College District"
		},
		{
			"description": "CMAT exists to provide, support, and champion high-quality education at the heart of local communities.",
			"meta": {
				"refs": [
					"https://www.linkedin.com/company/cambridge-meridian-academies-trust/about/"
				]
			},
			"uuid": "3f0e4b7c-8f32-11eb-8dcd-0242ac130003",
			"value": "Cambridge Meridian Academies Trust"
		},
		{
			"description": "The University of Miami is a private research university in Coral Gables, Florida. As of 2020, the university enrolled approximately 18,000 students in 12 separate colleges and schools.",
			"meta": {
				"refs": [
					"https://welcome.miami.edu/"
				]
			},
			"uuid": "4e52d904-8f32-11eb-8dcd-0242ac130003",
			"value": "The University of Miami"
		},
		{
			"description": "The University of Colorado Boulder, colloquially referred to as CU or Colorado, is a public research university in Boulder, Colorado. It is the flagship university of the University of Colorado system, and was founded in 1876, five months before Colorado became a state.",
			"meta": {
				"refs": [
					"https://www.colorado.edu/"
				]
			},
			"uuid": "4e52db20-8f32-11eb-8dcd-0242ac130003",
			"value": "The University of Colorado Boulder"
		},
		{
			"description": "Mott Community College is a public community college in Flint, Michigan. It is named for politician, businessman, and philanthropist Charles Stewart Mott. Its district is the same as the Genesee Intermediate School District and is governed by an elected board of trustees.",
			"meta": {
				"refs": [
					"https://www.mcc.edu/"
				]
			},
			"uuid": "4e52dc1a-8f32-11eb-8dcd-0242ac130003",
			"value": "Mott Community College"
		},
		{
			"description": "Redborne Upper School & Community College is an academy school and sixth-form located in Ampthill, Bedfordshire, England. The school serves the population of Ampthill, Flitwick and surrounding villages. Redborne is a designated Training school.",
			"meta": {
				"refs": [
					"https://www.redbornecommunitycollege.com/"
				]
			},
			"uuid": "d9beb0c0-962c-11eb-a8b3-0242ac130003",
			"value": "Redborne Upper School & Community College"
		},
		{
			"description": "Harris Federation is a multi-academy trust of 48 primary and secondary academies in and around London. They are sponsored by Philip Harris, educating 36,000 students.",
			"meta": {
				"refs": [
					"https://www.harrisfederation.org.uk/"
				]
			},
			"uuid": "d9beb3ea-962c-11eb-a8b3-0242ac130003",
			"value": "Harris Federation"
		},
		{
			"description": "The University of Maryland, College Park is the state's flagship university and one of the nation's preeminent public research universities. A global leader in research, entrepreneurship and innovation, the university is home to more than 40,700 students, 14,000 faculty and staff, and 388,000 alumni all dedicated to the pursuit of Fearless Ideas. Located just outside Washington, D.C., we discover and share new knowledge every day through our renowned research enterprise and programs in academics, the arts and athletics.",
			"meta": {
				"refs": [
					"https://www.umd.edu/"
				]
			},
			"uuid": "f50250e6-9c6a-11eb-a8b3-0242ac130003",
			"value": "University of Maryland"
		},
		{
			"description": "Brown University is a private Ivy League research university in Providence, Rhode Island. Founded in 1764 as the College in the English Colony of Rhode Island and Providence Plantations.",
			"meta": {
				"refs": [
					"https://www.brown.edu/"
				]
			},
			"uuid": "f5025316-9c6a-11eb-a8b3-0242ac130003",
			"value": "Brown University"
		},
		{
			"description": "National College of Ireland is a not-for-profit, state-aided third-level education institution in Dublin.",
			"meta": {
				"refs": [
					"https://www.ncirl.ie/"
				]
			},
			"uuid": "a22cdfbe-a2a8-11eb-bcbc-0242ac130002",
			"value": "The National College of Ireland"
		},
		{
			"description": "Technological University Dublin or TU Dublin is Ireland's first technological university, established on 1 January 2019.",
			"meta": {
				"refs": [
					"https://tudublin.ie/"
				]
			},
			"uuid": "a22ce1da-a2a8-11eb-bcbc-0242ac130002",
			"value": "The Technological University of Dublin"
		},
		{
			"description": "e2i is the empowering network for workers and employers seeking employment and employability solutions. e2i serves as a bridge between workers and employers, connecting with workers to offer job security through job-matching, career guidance and skills upgrading services, and partnering employers to address their manpower needs through recruitment, training and job redesign solutions. e2i is a tripartite initiative of the National Trades Union Congress set up to support nation-wide manpower and skills upgrading initiatives.",
			"meta": {
				"refs": [
					"https://e2i.com.sg/about-e2i/corporate-information/"
				]
			},
			"uuid": "a22ce2ca-a2a8-11eb-bcbc-0242ac130002",
			"value": "Employment and Employability Institute (e2i)"
		},
		{
			"description": "The Allgemeine Gewerbeschule Basel (AGS) is a vocational school at which apprentices receive supplementary courses in professional-theoretical, professional-practical, business and general subjects.",
			"meta": {
				"refs": [
					"https://www.agsbs.ch/",
					"https://de.wikipedia.org/wiki/Allgemeine_Gewerbeschule_Basel"
				]
			},
			"uuid": "a22ce39c-a2a8-11eb-bcbc-0242ac130002",
			"value": "Allgemeine Gewerbeschule Basel"
		},
		{
			"description": "Edraak is a non-profit massive open online course (MOOC) portal established by Queen Rania al Abdallah of Jordan for the promotion of knowledge in the Arab world. It is considered the first non-profit and pan-Arab online educational platform that offers courses for free to learners worldwide. The MOOC platform operates in partnership with the Harvard-Stanford-MIT consortium called edX and is headquartered in Amman.",
			"meta": {
				"refs": [
					"https://en.wikipedia.org/wiki/Edraak"
				]
			},
			"uuid": "a22ce45a-a2a8-11eb-bcbc-0242ac130002",
			"value": "Edraak"
		},
		{
			"description": "The University of Portsmouth is a public university in the city of Portsmouth, Hampshire, England. The earliest incarnation of the University existed in the Victorian era, and it was granted university status in 1992.",
			"meta": {
				"refs": [
					"https://www.port.ac.uk/"
				]
			},
			"uuid": "4903affe-a69e-11eb-bcbc-0242ac130002",
			"value": "The University of Portsmouth"
		},
		{
			"description": "The University of Castilla–La Mancha is a Spanish university. It offers courses in the cities of Albacete, Ciudad Real, Cuenca, Toledo, Almadén and Talavera de la Reina. This university was recognised by law on 30 June 1982, and began to operate three years later.",
			"meta": {
				"refs": [
					"https://www.uclm.es/home?sc_lang=en"
				]
			},
			"uuid": "4903b346-a69e-11eb-bcbc-0242ac130002",
			"value": "The University of Castilla–La Mancha"
		},
		{
			"description": "The Technical University of Berlin is a public research university located in Berlin, Germany.",
			"meta": {
				"refs": [
					"https://www.tu.berlin/en/"
				]
			},
			"uuid": "031912f2-ae70-11eb-8529-0242ac130003",
			"value": "Berlin Institute of Technology"
		},
		{
			"description": "Colchester Institute is a large provider of further and higher education based in the town of Colchester. The institute includes the Colchester School of Art, Faculty of Creative Arts, the Centre for Hospitality and Food Studies, and the Professional Training Centre.",
			"meta": {
				"refs": [
					"https://www.colchester.ac.uk/"
				]
			},
			"uuid": "031913b0-ae70-11eb-8529-0242ac130003",
			"value": "Colchester Institute"
		},
		{
			"description": "Rensselaer Polytechnic Institute is a private research university in Troy, New York, with additional campuses in Hartford and Groton, Connecticut.",
			"meta": {
				"refs": [
					"https://www.rpi.edu/"
				]
			},
			"uuid": "a84754a6-b707-11eb-8529-0242ac130003",
			"value": "Rensselaer Polytechnic Institute"
		},
		{
			"description": "Rochester Community and Technical College is a public community college in Rochester, Minnesota. It serves more than 8,000 students annually. The college was founded in 1915 on a motion by Dr. Charles Mayo to the Rochester School Board and is Minnesota's oldest original community college.",
			"meta": {
				"refs": [
					"https://www.rctc.edu/"
				]
			},
			"uuid": "a8475780-b707-11eb-8529-0242ac130003",
			"value": "Rochester Community and Technical College"
		},
		{
			"description": "The University of Houston is a public research university in Houston, Texas, and the flagship institution of the University of Houston System. Founded in 1927, U of H is the third-largest university in Texas with over 46,000 students.",
			"meta": {
				"refs": [
					"https://www.uh.edu/"
				]
			},
			"uuid": "f607459c-bc99-11eb-8529-0242ac130003",
			"value": "The University of Houston"
		},
		{
			"description": "The University of Franche-Comte (UFC) is a pluridisciplinary public French university located in Besançon, Franche-Comte, with decentralized campuses in Belfort, Montbeliard, Vesoul and Lons-le-Saunier. It is a founding member of the community of universities and institutions University of Burgundy - Franche-Comte (COMUE UBFC), headquartered in Besançon and which federates universities and other higher learning institutes in the Bourgogne-Franche-Comte region. With 28 research labs, 667 PhD students and 788 research professors in 2016–2017, the University of Franche-Comte is well represented in the research community. It collaborates with many organizations (University Hospital of Besançon, CNRS, INSERM, CEA, etc.). It has about 28,000 students, including nearly a third of scholarship students and 12% of foreign students. Its Centre for Applied Linguistics (CLA) is one of the world's leading schools for teaching French as a foreign language and French linguistics.",
			"meta": {
				"refs": [
					"https://en.wikipedia.org/wiki/University_of_Franche-Comt%C3%A9"
				]
			},
			"uuid": "6013fe14-c788-11eb-b8bc-0242ac130003",
			"value": "University of Franche-Comte"
		},
		{
			"description": "Sierra College is a public community college in Rocklin, California. Sierra College is owned and operated by the Sierra Joint Community College District, a district that covers over 3,200 square miles, serves Placer, Nevada and parts of El Dorado and Sacramento counties.",
			"meta": {
				"refs": [
					"https://academics.sierracollege.edu/sierra-college"
				]
			},
			"uuid": "6013fedc-c788-11eb-b8bc-0242ac130003",
			"value": "Sierra College"
		},
		{
			"description": "Des Moines Area Community College (DMACC), a public institution serving the educational and career training needs of Iowans, is committed to the lifelong success of its students. Situated in one of America’s most vibrant regions, DMACC offers 200 programs, certificates and transfer degrees, annually serving more than 70,000 credit and noncredit students across six campuses and six learning centers. Thanks to College-wide innovation, including Continuous Process Improvement (CPI), new programs and affordable tuition, DMACC continues to experience strong growth. For more information, please visit www.dmacc.edu.",
			"meta": {
				"refs": [
					"https://www.linkedin.com/school/des-moines-area-community-college/about/"
				]
			},
			"uuid": "a1a52b02-f841-11eb-9a03-0242ac130003",
			"value": "Des Moines Area Community College"
		},
		{
			"description": "GEMS Education is one of the world’s oldest and largest K-12 private education providers. It is a highly-regarded choice for quality private education in the Middle East and North Africa region. As a company founded in the UAE in 1959, it holds an unparalleled track-record of providing diverse curricula and educational choices to all socio-economic means. Operating 47 owned and operated schools, and a further three managed in the MENA region, GEMS Education currently serves over 115,000 students, and through its growing network of schools as well as charitable contributions is fulfilling the founder’s vision of putting a quality education within the reach of every child.",
			"meta": {
				"refs": [
					"https://www.linkedin.com/school/gems-education/"
				]
			},
			"uuid": "e07f53aa-9afa-11ec-b909-0242ac120002",
			"value": "GEMS Education"
		},
		{
			"description": "Boston University (BU) is a private research university in Boston, Massachusetts. The university is nonsectarian, but has a historical affiliation with the United Methodist Church. It was founded in 1839 by Methodists with its original campus in Newbury, Vermont, before moving to Boston in 1867.",
			"meta": {
				"refs": [
					"https://en.wikipedia.org/wiki/Boston_University"
				]
			},
			"uuid": "53735c66-b1b3-11ec-b909-0242ac120002",
			"value": "Boston University"
		},
		{
			"description": "North Carolina Agricultural and Technical State University (also known as North Carolina A&T State University, North Carolina A&T, N.C. A&T, or simply A&T) is a public, historically black land-grant research university in Greensboro, North Carolina. It is a constituent institution of the University of North Carolina System. Founded by the North Carolina General Assembly on March 9, 1891, as the Agricultural and Mechanical College for the Colored Race, it is the second college established under the provisions of the Morrill Act of 1890, and the first for people of color in the state of North Carolina. Initially, the college offered instruction in agriculture, English, horticulture, and mathematics. In 1967, the college was designated a Regional University by the North Carolina General Assembly and renamed North Carolina Agricultural and Technical State University.",
			"meta": {
				"refs": [
					"https://en.wikipedia.org/wiki/North_Carolina_A%26T_State_University"
				]
			},
			"uuid": "b9560118-bfd8-11ec-9d64-0242ac120002",
			"value": "North Carolina Agricultural and Technical State University"
		},
		{
			"description": "Florida International University (FIU) is a public research university with its main campus in University Park, Miami-Dade County, Florida. Founded in 1965, the school opened its doors to students in 1972. It has become the largest university in South Florida, the second-largest in Florida, and the fifth-largest in the United States by enrollment. FIU is a constituent part of the State University System of Florida. In 2021, it was ranked #1 in the Florida Board of Governors performance funding, and had over $246 million in research expenditures.",
			"meta": {
				"refs": [
					"https://en.wikipedia.org/wiki/Florida_International_University"
				]
			},
			"uuid": "b956046a-bfd8-11ec-9d64-0242ac120002",
			"value": "Florida International University"
		},
		{
			"description": "Queen's University at Kingston, commonly known as Queen's University or simply Queen's, is a public research university in Kingston, Ontario, Canada. Queen's holds more than 1,400 hectares (3,500 acres) of land throughout Ontario and owns Herstmonceux Castle in East Sussex, England. Queen's is organized into eight faculties and schools.",
			"meta": {
				"refs": [
					"https://en.wikipedia.org/wiki/Queen's_University_at_Kingston"
				]
			},
			"uuid": "b9560636-bfd8-11ec-9d64-0242ac120002",
			"value": "Queen's University at Kingston"
		},
		{
			"description": "Orchard View Highschool is a part of the Orchard View School District located in Muskegon Township Michigan, USA.",
			"meta": {
				"refs": [
					"http://www.orchardview.org/schools/high-school/"
				]
			},
			"uuid": "f4dfc716-4b21-11e9-8646-d663bd873d93",
			"value": "Orchard View High School"
		}
	],
	"version": 35
}
