{
	"category": "BLS-NAICS-813",
	"description": "Industries in the Religious, Grantmaking, Civic, Professional, and Similar Organizations subsector group establishments that organize and promote religious activities; support various causes through grantmaking; advocate various social and political causes; and promote and defend the interests of their members.",
	"name": "BLS-NAICS-813",
	"source": "BLS Industries at a Glance",
	"type": "BLS-NAICS-813",
	"uuid": "99cae6e4-4847-11e9-8646-d663bd873d93",
	"values": [{
			"description": "Test place holder",
			"meta": {
				"refs": [
					"https://www.bls.gov/iag/tgs/iag813.htm"
				]
			},
			"uuid": "a93dbac0-48fb-11e9-8646-d663bd873d93",
			"value": "Test Religious, Grantmaking, Civic, Professional, and Similar Organizations Value"
		},
		{
			"description": "Opportunity International is a 501 nonprofit organization that is working to end global poverty by creating and sustaining jobs. Through a network of 47 program and support partners, Opportunity provides small business loans, savings, insurance and training to more than 14 million people in the developing world.",
			"meta": {
				"refs": [
					"https://opportunity.org/"
				]
			},
			"uuid": "4f9be668-4b3f-11e9-8646-d663bd873d93",
			"value": "Opportunity International"
		},
		{
			"description": "Our direct basic cremation service without a ceremony includes transfer of deceased, transportation to the crematory and refrigeration no mileage charges or daily refrigeration fees. This service also includes the standard responsibilities of a funeral director and staff. Plus, if the bereaved live in Pennsylvania, we come to the home or any place of convenience of the next of kin, after death, to do any paperwork, so they do not have to travel to us.",
			"meta": {
				"refs": [
					"https://www.cremationsocietyofpa.com/"
				]
			},
			"uuid": "6ea34c14-5241-11e9-8647-d663bd873d93",
			"value": "Cremation Society of Pennsylvania, Inc."
		},
		{
			"description": "Housing provider that offers safe, affordable rental accommodations to families and individuals in a multi-cultural setting.",
			"meta": {
				"refs": [
					"https://easternontario.cioc.ca/record/OCR3954"
				],
				"synonyms": [
					"OCISO Hilda",
					"OCISO Presland",
					"OCISONPH",
					"Unity Hilda",
					"Unity Housing",
					"Unity Presland",
					"OCISO Non Profit Housing Corporation"
	       ]
			},
			"uuid": "c2987ed8-5bfc-11e9-8647-d663bd873d93",
			"value": "Unity Non Profit Housing Corporation Ottawa"
		},
		{
			"description": "Amnesty International is a London-based non-governmental organization focused on human rights. The organization says it has more than seven million members and supporters around the world.",
			"meta": {
				"refs": [
					"https://www.amnesty.org/en/"
				]
			},
			"uuid": "282dcc44-6cf1-11e9-a923-1681be663d3e",
			"value": "Amnesty International"
		},
		{
			"description": "Catholic Parish in Brunswick, Ohio.",
			"meta": {
				"refs": [
					"https://stambrose.us/"
				]
			},
			"uuid": "282dc974-6cf1-11e9-a923-1681be663d3e",
			"value": "Saint Ambrose Catholic Parish"
		},
		{
			"description": "People Inc. is a non-profit organization in Western New York. People Inc. provides a variety of services to seniors, families and individuals with developmental disabilities including residential, employment, community outreach, health care, and recreation programs.",
			"meta": {
				"refs": [
					"https://www.people-inc.org/"
				]
			},
			"uuid": "13e4c38c-8d44-11e9-bc42-526af7764f64",
			"value": "People Inc."
		},
		{
			"description": "Supported by United Way of King County, Washington. We provide relief to families and individuals living within the boundaries of the Auburn School District.",
			"meta": {
				"refs": [
					"http://www.theauburnfoodbank.org/"
				]
			},
			"uuid": "13e4c62a-8d44-11e9-bc42-526af7764f64",
			"value": "The Auburn Food Bank"
		},
		{
			"description": "Father Bill’s & MainSpring (FBMS), a registered 501(c)3 charitable organization, has been a leading innovator of ending homelessness. Our mission is to end and prevent homelessness in Southern Massachusetts with programs that provide emergency and permanent housing and help people obtain skills, jobs, housing, and services. We help people who are struggling with homelessness, or are at risk of homelessness, to achieve self-sufficiency.",
			"meta": {
				"refs": [
					"https://helpfbms.org/"
				]
			},
			"uuid": "81dc44bc-a5d3-11e9-a2a3-2a2ae2dbcce4",
			"value": "Father Bill's & MainSpring"
		},
		{
			"description": "St John Ambulance is the name of a number of affiliated organisations in different countries which teach and provide first aid and emergency medical services, and are primarily staffed by volunteers. The associations are overseen by the international Order of St John and its priories.",
			"meta": {
				"refs": [
					"https://www.sja.ca/"
				]
			},
			"uuid": "81dc4732-a5d3-11e9-a2a3-2a2ae2dbcce4",
			"value": "St John Ambulance"
		},
		{
			"description": "Independent Age is an older peoples charity based in the UK. It has offices in London, Newcastle and Glasgow, and staff and volunteers based in a number of other UK locations. It is a registered charity in England & Wales and in Scotland.",
			"meta": {
				"refs": [
					"https://www.independentage.org/"
				]
			},
			"uuid": "499e9750-abc1-11e9-a2a3-2a2ae2dbcce4",
			"value": "Independent Age"
		},
		{
			"description": "In the early 1960s, the residents of the Park DuValle Community Health Center began to voice their concern for the lack of medical services provided to this area. At that time, the only health care, other than private physicians, was General Hospital. It was located in the east end of town and public transportation was unavailable after 5 p.m. These primarily medically indigent residents began to work with several civic-minded groups to make their dreams a reality. A coalition of residents, led by the late Vernice Hunter, a community activist, along with the American Friends Service Committee (AFSC), approached the city government about its concerns. Due to these efforts, several buildings in the Cotter Homes subsidized housing area were designated by the city to house the new health care facility. Federal Office of Economic Opportunity funding was secured and in 1968, Dr. Harvey I. Sloane became the center’s first director and provided direction for this most important and sensitive endeavor.",
			"meta": {
				"refs": [
					"http://pdchc.org/pdchc-our-history-page/"
				]
			},
			"uuid": "11ca2690-b61c-11e9-a2a3-2a2ae2dbcce4",
			"value": "Park Duvalle Community Health Center Inc"
		},
		{
			"description": "The stated mission of the Boy Scouts of America is to prepare young people to make ethical and moral choices over their lifetimes by instilling in them the values of the Scout Oath and Law.",
			"meta": {
				"refs": [
					"https://www.scouting.org/"
				]
			},
			"uuid": "224463e4-d356-11e9-bb65-2a2ae2dbcce4",
			"value": "Boy Scouts of America"
		},
		{
			"description": "Likud, officially the Likud-National Liberal Movement, is a centre-right to right-wing political party in Israel. A secular party, it was founded in 1973 by Menachem Begin and Ariel Sharon in an alliance with several right-wing parties.",
			"meta": {
				"refs": [
					"https://en.wikipedia.org/wiki/Likud"
				]
			},
			"uuid": "22446650-d356-11e9-bb65-2a2ae2dbcce4",
			"value": "Likud"
		},
		{
			"description": "We Are The Largest Community and Family Based Agency in New Mexico. Youth Development Inc. currently offers services in early childhood education, mental and behavioral health, education, employment, and career training.",
			"meta": {
				"refs": [
					"http://www.ydinm.org/"
				]
			},
			"uuid": "950ef102-153a-11ea-8d71-362b9e155667",
			"value": "Youth Development, Inc."
		},
		{
			"description": "The Council of Licenced Firearms Owners represents the interests of firearms owners and is the largest voluntary shooting-related organisation in New Zealand. COLFO was set up in 1996 by a number of interested individuals and groups to combat firearms-related disinformation. COLFO takes a professional approach using sound research to dispel the inaccurate and emotive claims of self-proclaimed anti-gun experts. Membership is available to any society, association, organisation, or individual whose objects and practices are supportive of the Council's objectives. COLFO is a member of the Pacific Shooting Sports Forum and the World Forum for the Future of Shooting Sports.",
			"meta": {
				"refs": [
					"https://www.colfo.org.nz/"
				]
			},
			"uuid": "93e67862-16c1-11ea-8d71-362b9e155667",
			"value": "Council of Licenced Firearms Owners (COLFO)"
		},
		{
			"description": "Since 1945, Saint Francis Ministries has been dedicated to the needs of children and youth. We advocate for them and work to protect them. We do our best to ensure that every child we serve gets a chance at a happy and fulfilling life. As a non-profit, faith-based organization, we place great stock in the value of both traditional and non-traditional families. We believe strong families make children’s lives better. What began as a home for boys on the Kansas prairie is now a multi-faceted child and family services ministry serving over 31,000 people in Arkansas, Kansas, Mississippi, Nebraska, Oklahoma, Illinois, Texas, and Central America with a broad range of programs and services. We help strengthen and heal families while providing for the health and security of children. Though rooted in the Episcopal tradition, Saint Francis Ministries is an independent not-for-profit organization dedicated to the protection, nurturing, and healing of children and families in body, mind, and spirit. To that end, while partnering with government agencies in supporting children and families in crisis, Saint Francis Ministries honors religious freedom and is also committed to allowing children and families in its care to participate in religious activities on a voluntary basis.",
			"meta": {
				"refs": [
					"https://saintfrancisministries.org/"
				]
			},
			"uuid": "6683eae0-7d8b-11ea-bc55-0242ac130003",
			"value": "Saint Francis Ministries, KS"
		},
		{
			"description": "UNITED TISSUE NETWORK IS A NONPROFIT 501C3, AATB ACCREDITED, WHOLE-BODY DONATION COMPANY.",
			"meta": {
				"refs": [
					"https://unitedtissue.org/"
				]
			},
			"uuid": "8b6c327e-4b3f-11e9-8646-d663bd873d93",
			"value": "United Tissue Network"
		}
	],
	"version": 13
}
