{
  "category": "BLS-NAICS-442",
  "description": "Industries in the Furniture and Home Furnishings Stores subsector retail new furniture and home furnishings from fixed point-of-sale locations. Establishments in this subsector usually operate from showrooms and have substantial areas for the presentation of their products. Many offer interior decorating services in addition to the sale of products.",
  "name": "BLS-NAICS-442",
  "source": "BLS Industries at a Glance",
  "type": "BLS-NAICS-442",
  "uuid": "abb3db62-4802-11e9-b210-d663bd873d93",
  "values": [
	  {
      "description": "Test place holder",
      "meta": {
        "refs": [
          "https://www.bls.gov/iag/tgs/iag442.htm"
        ]
      },
      "uuid": "d49bbc1a-48c6-11e9-8646-d663bd873d93",
      "value": "Test Furniture and Home Furnishings Stores Value"
    },
	{
      "description": "My Pillow, Inc. is a pillow manufacturing company based in Chaska, Minnesota, United States. The company was founded in 2004 by Michael J. Lindell, who invented and patented MyPillow, an open-cell, poly-foam pillow design. My Pillow has sold over 41 million pillows, due mostly to My Pillow’s TV infomercials.",
      "meta": {
        "refs": [
          "https://www.mypillow.com/"
        ]
      },
      "uuid": "49cf997e-4ff3-11e9-8647-d663bd873d93",
      "value": "MyPillow"
    },
	{
      "description": "IKEA is a Swedish-founded multinational group that designs and sells ready-to-assemble furniture, kitchen appliances and home accessories, among other useful goods and occasionally home services. It has been the world's largest furniture retailer since at least 2008.",
      "meta": {
        "refs": [
          "https://www.ikea.com/ms/en_KR/about-the-ikea-group/company-information/index.html"
        ]
      },
      "uuid": "f11ecea8-bf82-11e9-9cb5-2a2ae2dbcce4",
      "value": "IKEA"
    },
	{
      "description": "Back in 1989 two friends decided to open the first Furniture Village store in Abingdon, Oxfordshire with a simple philosophy – to offer high quality, beautifully designed furniture at a great price with exceptional service.",
      "meta": {
        "refs": [
          "https://www.linkedin.com/company/furniture-village/about/"
        ]
      },
      "uuid": "a6ab2baa-f842-11eb-9a03-0242ac130003",
      "value": "Furniture Village"
    },
	{
      "description": "Amerisleep is a retailer and producer of mattresses.",
      "meta": {
        "refs": [
          "https://www.amerisleep.com/"
        ]
      },
      "uuid": "acfdad10-4ff3-11e9-8647-d663bd873d93",
      "value": "Amerisleep"
    }
	  ],
	"version": 3
}
