{
  "category": "BLS-NAICS-315",
  "description": "Industries in the Apparel Manufacturing subsector group establishments with two distinct manufacturing processes: (1) cut and sew (i.e., purchasing fabric and cutting and sewing to make a garment), and (2) the manufacture of garments in establishments that first knit fabric and then cut and sew the fabric into a garment. The Apparel Manufacturing subsector includes a diverse range of establishments manufacturing full lines of ready-to-wear apparel and custom apparel: apparel contractors, performing cutting or sewing operations on materials owned by others; jobbers performing entrepreneurial functions involved in apparel manufacture; and tailors, manufacturing custom garments for individual clients are all included. Knitting, when done alone, is classified in the Textile Mills subsector, but when knitting is combined with the production of complete garments, the activity is classified in Apparel Manufacturing.",
  "name": "BLS-NAICS-315",
  "source": "BLS Industries at a Glance",
  "type": "BLS-NAICS-315",
  "uuid": "b232871e-47f2-11e9-b210-d663bd873d93",
  "values": [
	  {
      "description": "Test place holder",
      "meta": {
        "refs": [
          "https://www.bls.gov/iag/tgs/iag315.htm"
        ]
      },
      "uuid": "a0d516d2-48bd-11e9-8646-d663bd873d93",
      "value": "Test Apparel Manufacturing Value"
    },
	{
      "description": "Boardriders is a leading action sports and lifestyle company that designs, produces and distributes branded apparel, footwear and accessories for Boardriders around the world.",
      "meta": {
        "refs": [
          "https://www.boardriders.com/"
        ]
      },
      "uuid": "cdeb1194-096a-11ea-8d71-362b9e155667",
      "value": "Boardriders"
    },
	{
      "description": "Quiksilver is a brand of surf-inspired apparel and accessories that was founded in 1969 in Torquay, Australia, but is now based in Huntington Beach, California. It is one of the world's largest brands of surfwear and boardsport-related equipment.",
      "meta": {
        "refs": [
          "https://www.quiksilver.com/"
        ]
      },
      "uuid": "cdeb14f0-096a-11ea-8d71-362b9e155667",
      "value": "Quiksilver"
    },
	{
      "description": "Billabong International Limited is a surf company, primarily a clothing retailer that also produces accessories, like watches and backpacks and skateboard and snowboard products under other brand-names.",
      "meta": {
        "refs": [
          "https://www.billabong.com/"
        ]
      },
      "uuid": "cdeb18c4-096a-11ea-8d71-362b9e155667",
      "value": "Billabong International Limited"
    },
	{
      "description": "Luxottica Group S.p.A. is an Italian eyewear conglomerate and the world's largest company in the eyewear industry. It is based in Milan, Italy.",
      "meta": {
        "refs": [
          "https://www.linkedin.com/company/luxottica"
        ]
      },
      "uuid": "7c01d3fc-fda4-11ea-adc1-0242ac120002",
      "value": "Luxottica Group S.p.A."
    },
	{
      "description": "BLK is an Australian sporting goods manufacturing company which was established in 1999 in the city of Gold Coast in Queensland. The overall but now heavily transitioned company has origins as far back as 1999, but evolved from the Australian arm of the brand KooGa.",
      "meta": {
        "refs": [
          "https://blksport.com/"
        ]
      },
      "uuid": "e2ba8b12-c9f4-11eb-b8bc-0242ac130003",
      "value": "BLK Sport"
    },
	{
      "description": "Puma SE, branded as Puma, is a German multinational corporation that designs and manufactures athletic and casual footwear, apparel and accessories, which is headquartered in Herzogenaurach, Bavaria, Germany. Puma is the third largest sportswear manufacturer in the world.",
      "meta": {
        "refs": [
          "https://us.puma.com/"
        ]
      },
      "uuid": "6e343824-0b30-11ec-9a03-0242ac130003",
      "value": "Puma SE"
    },
	{
      "description": "Uniqlo Co., Ltd. is a Japanese casual wear designer, manufacturer and retailer. The company is a wholly owned subsidiary of Fast Retailing Co., Ltd. The company operates in Japan and several other countries.",
      "meta": {
        "refs": [
          "https://www.uniqlo.com/"
        ]
      },
      "uuid": "a75306e4-7b4a-11e9-8f9e-2a86e4085a59",
      "value": "Uniqlo Co., Ltd."
    }
	  ],
	"version": 3
}
