{
	"category": "BLS-NAICS-62",
	"description": "The Health Care and Social Assistance sector comprises establishments providing health care and social assistance for individuals. The sector includes both health care and social assistance because it is sometimes difficult to distinguish between the boundaries of these two activities. The industries in this sector are arranged on a continuum starting with those establishments providing medical care exclusively, continuing with those providing health care and social assistance, and finally finishing with those providing only social assistance. The services provided by establishments in this sector are delivered by trained professionals. All industries in the sector share this commonality of process, namely, labor inputs of health practitioners or social workers with the requisite expertise. Many of the industries in the sector are defined based on the educational degree held by the practitioners included in the industry.",
	"name": "BLS-NAICS-62",
	"source": "BLS Industries at a Glance",
	"type": "BLS-NAICS-62",
	"uuid": "3198aa24-4825-11e9-8646-d663bd873d93",
	"values": [{
			"description": "Test place holder",
			"meta": {
				"refs": [
					"https://www.bls.gov/iag/tgs/iag62.htm"
				]
			},
			"uuid": "07cd4d90-48ec-11e9-8646-d663bd873d93",
			"value": "Test Health Care and Social Assistance Value"
		},
		{
			"description": "Family medical practice located in Greenville, South Carolina USA.",
			"meta": {
				"refs": [
					"http://milestonefamilymedicine.com/"
				]
			},
			"uuid": "http://milestonefamilymedicine.com/",
			"value": "Milestone Family Medicine"
		},
		{
			"description": "Columbia Surgical Specialists of Spokane is a specialist servie provider within the healthcare industry.",
			"meta": {
				"refs": [
					"https://columbiasurgicalspecialists.com/"
				]
			},
			"uuid": "19ac703e-4b2d-11e9-8646-d663bd873d93",
			"value": "Columbia Surgical Specialists of Spokane"
		},
		{
			"description": "Maffi Clinics includes 5 clinics offering cutting-edge surgical procedures, aesthetic injection, laser and skin care treatments.",
			"meta": {
				"refs": [
					"https://mafficlinics.com/"
				]
			},
			"uuid": "466348a0-4b2d-11e9-8646-d663bd873d93",
			"value": "Maffi Clinics"
		},
		{
			"description": "Covenant Health is the region's top-performing healthcare network with nine hospitals and 1500 affiliated physicians throughout East Tennessee.",
			"meta": {
				"refs": [
					"https://www.covenanthealth.com/"
				]
			},
			"uuid": "78dca9c0-4b2d-11e9-8646-d663bd873d93",
			"value": "Covenant Health"
		},
		{
			"description": "McLaren Health Care Corporation is an integrated, managed care health care organization in the Lower Peninsula of Michigan. McLaren operates 14 hospitals, ambulatory surgery centers, imaging centers, a primary and specialty care physician network, commercial and Medicaid HMOs, home health and hospice providers, retail medical equipment showrooms, pharmacy services, and a wholly owned medical malpractice insurance company. McLaren also operates Michigan's largest network of cancer centers and providers, anchored by the Barbara Ann Karmanos Institute. Its headquarters is in Grand Blanc, Michigan with operations facilities in Michigan and Indiana.",
			"meta": {
				"refs": [
					"https://www.mclaren.org/main/home.aspx"
				]
			},
			"uuid": "b782dbc2-4b2d-11e9-8646-d663bd873d93",
			"value": "McLaren Health"
		},
		{
			"description": "An organization that delivers radiology treatments to the home directly.",
			"meta": {
				"refs": [
					"https://www.portableservice.com/"
				]
			},
			"uuid": "10e962d8-4ff4-11e9-8647-d663bd873d93",
			"value": "Home Health Radiology Services LLC"
		},
		{
			"description": "Frederick Regional Health System maintains a focus on delivering quality care. FRHS includes Monocacy Health Partners, a network of providers offering primary care, family medicine and a wide range of specialty services. MHP partners very closely with Frederick Memorial Hospital since both are part of the Frederick Regional Health System. Because they are all connected, our physicians and clinicians can easily work together to provide the best possible treatment plan and follow up care for all of our patients.",
			"meta": {
				"refs": [
					"https://www.fmh.org/"
				]
			},
			"uuid": "89a2522a-50d0-11e9-8647-d663bd873d93",
			"value": "Frederick Regional Health System"
		},
		{
			"description": "Facility that delivers substance abuse treatment.",
			"meta": {
				"refs": [
					"https://www.databreaches.net/counselor-for-north-haven-substance-abuse-center-stole-patient-identify-for-cable-internet-police/"
				]
			},
			"uuid": "89a25518-50d0-11e9-8647-d663bd873d93",
			"value": "North Haven Substance Abuse Center"
		},
		{
			"description": "HDC is a community mental health center that serves residents in four counties in northeastern Minnesota.",
			"meta": {
				"refs": [
					"https://www.humandevelopmentcenter.org/"
				]
			},
			"uuid": "89a2568a-50d0-11e9-8647-d663bd873d93",
			"value": "The Human Development Center"
		},
		{
			"description": "Verity Medical Foundation is a statewide collaboration of physicians and other healthcare providers dedicated to delivering high quality, compassionate, patient-centered care to individuals and families throughout California.",
			"meta": {
				"refs": [
					"https://medfoundation.verity.org/"
				]
			},
			"uuid": "89a257e8-50d0-11e9-8647-d663bd873d93",
			"value": "Verity Medical Foundation"
		},
		{
			"description": "Southern Hills Eye Care specializes in primary eye care.",
			"meta": {
				"refs": [
					"https://www.southernhillseyecare.com/"
				]
			},
			"uuid": "28f203aa-5a0b-11e9-8647-d663bd873d93",
			"value": "Southern Hills Eye Care"
		},
		{
			"description": "We are a growing Community Mental Health Clinic that connects with more than 40,000 clients across 17 counties in Missouri. Our provider base of more than 150 clinicians offer a full continuum of care through our integrated network. We create individualized care plans and our staff collaborates with families, schools, healthcare systems and other networks to provide the appropriate care for each situation.",
			"meta": {
				"refs": [
					"https://www.burrellcenter.com/"
				]
			},
			"uuid": "28f2065c-5a0b-11e9-8647-d663bd873d93",
			"value": "Burrell Behavioral Health"
		},
		{
			"description": "Apart of the Brookside Surgery Center",
			"meta": {
				"refs": [
					"https://www.yellowpages.com/battle-creek-mi/mip/brookside-ent-hearing-services-453067781"
				]
			},
			"uuid": "98a5e0c2-5bfa-11e9-8647-d663bd873d93",
			"value": "Brookside ENT and Hearing Center"
		},
		{
			"description": "Baystate Health is a not-for-profit integrated health system headquartered in Springfield, Massachusetts, serving Western Massachusetts and the Knowledge Corridor Region of Massachusetts and Connecticut. The system has 4 hospitals, over 80 medical practices, and 25 reference laboratories.",
			"meta": {
				"refs": [
					"https://www.baystatehealth.org/"
				]
			},
			"uuid": "98a5e5a4-5bfa-11e9-8647-d663bd873d93",
			"value": "Baystate Health"
		},
		{
			"description": "Palmetto Health is the largest and most comprehensive integrated health care system in the South Carolina Midlands region.",
			"meta": {
				"refs": [
					"https://www.palmettohealth.org/"
				]
			},
			"uuid": "98a5e72a-5bfa-11e9-8647-d663bd873d93",
			"value": "Palmetto Health"
		},
		{
			"description": "Women's Health CT is dedicated to the best healthcare for women. Find an OBGYN or gynecologist near you in CT, search practices and physicians, and more.",
			"meta": {
				"refs": [
					"https://www.invitrosciences.com/"
				]
			},
			"uuid": "98a5e86a-5bfa-11e9-8647-d663bd873d93",
			"value": "Women's Health CT"
		},
		{
			"description": "Welcome to Clearway Pain Solutions Institute, where we relieve pain, restore physical function and empower our patients to renew themselves.",
			"meta": {
				"refs": [
					"https://clearwaypain.com/"
				]
			},
			"uuid": "a1311758-63ce-11e9-a923-1681be663d3e",
			"value": "Clearway Pain Solutions Institute"
		},
		{
			"description": "Questcare Partners is Dallas and Fort Worth-based physician-owned as well as operated medical practice providing quality services in multiple specialties of medicine.",
			"meta": {
				"refs": [
					"https://questcare.com/"
				]
			},
			"uuid": "a1311a0a-63ce-11e9-a923-1681be663d3e",
			"value": "Questcare Medical Services"
		},
		{
			"description": "RS Medical manufactures non-opioid, pain relieving INF interferential therapy devices that penetrate deep into soft tissue for long-lasting pain relief.",
			"meta": {
				"refs": [
					"https://www.rsmedical.com/"
				]
			},
			"uuid": "a1311b5e-63ce-11e9-a923-1681be663d3e",
			"value": "RS Medical"
		},
		{
			"description": "Private non-profit corporation. Health Recovery Services offers mediacation assisted treatment to those who need help with alcohol and drug addiction.",
			"meta": {
				"refs": [
					"https://www.hrs.org/"
				]
			},
			"uuid": "077f0c72-63cf-11e9-a923-1681be663d3e",
			"value": "Health Recovery Services"
		},
		{
			"description": "Pasquotank–Camden EMS is a Paramedic level EMS organization serving both Pasquotank and Camden counties located in Northeastern NC. Pasquotank-Camden County EMS operates out of one centralized station located in Elizabeth City, NC and three satellite stations located in the more rural areas of each county.",
			"meta": {
				"refs": [
					"https://www.pasquotankcamdenems.com/about-us"
				]
			},
			"uuid": "077f0f4c-63cf-11e9-a923-1681be663d3e",
			"value": "Pasquotank-Camden Emergency Medical Service"
		},
		{
			"description": "Riverplace Counseling Centers provide primary chemical dependency therapy programs and related services in Minnesota, USA.",
			"meta": {
				"refs": [
					"http://www.riverplacecenter.com/"
				]
			},
			"uuid": "cae75fca-65e6-11e9-a923-1681be663d3e",
			"value": "Riverplace Counseling Centers"
		},
		{
			"description": "Rehabilitation center for drug and alcohol abuse located in Pennsylvania, USA.",
			"meta": {
				"refs": [
					"https://www.stepstorecovery.com/about-steps-to-recovery/drug-alcohol-rehab-staff/"
				]
			},
			"uuid": "cae764e8-65e6-11e9-a923-1681be663d3e",
			"value": "Steps to Recovery"
		},
		{
			"description": "EmCare Holdings Inc., or EmCare, is an American provider of physician practice management services for emergency departments, inpatient physician services or hospitals, acute care surgery, trauma and general surgery, women's and children's services, radiology and teleradiology programs as well as anesthesiology services.",
			"meta": {
				"refs": [
					"https://www.emcare.com/"
				]
			},
			"uuid": "cae7665a-65e6-11e9-a923-1681be663d3e",
			"value": "EmCare Holdings Inc."
		},
		{
			"description": "Metrocare Services providees behavioral health, primary care, pharmacy, housing and supportive services.",
			"meta": {
				"refs": [
					"https://www.metrocareservices.org/"
				]
			},
			"uuid": "cae76790-65e6-11e9-a923-1681be663d3e",
			"value": "Metrocare Services"
		},
		{
			"description": "Centrelake Imaging is a full-service, all digital radiology network in Southern California. Our practice was founded in 2006 in Ontario, California by a team of experienced medical practitioners focused on delivering high quality and affordable diagnostic imaging services.",
			"meta": {
				"refs": [
					"https://centrelakeimaging.com/"
				]
			},
			"uuid": "cae768c6-65e6-11e9-a923-1681be663d3e",
			"value": "Centrelake Medical Group Inc."
		},
		{
			"description": "CarePartners brings together four services – rehabilitation, home health, adult care and hospice – to offer our patients a full continuum of post-acute care, or care after a serious illness or injury. When it comes to our patients, CarePartners is committed to delivering exceptional, personalized care.",
			"meta": {
				"refs": [
					"https://missionhealth.org/member-hospitals/carepartners/"
				]
			},
			"uuid": "892aad8a-6b54-11e9-a923-1681be663d3e",
			"value": "CarePartners"
		},
		{
			"description": "Allegheny Children’s Initiative provides behavioral and mental health oriented services to children and adolescents between the ages of 2-21 in Allegheny County.",
			"meta": {
				"refs": [
					"https://www.pfq.org/allegheny-childrens-initiative-inc"
				]
			},
			"uuid": "892ab014-6b54-11e9-a923-1681be663d3e",
			"value": "Allegheny Children’s Initiative"
		},
		{
			"description": "At Citizen Care CCI, we have been committed to providing services and supports to individuals with intellectual and developmental disabilities for more than four decades. In 1974, CCI was founded as an Intermediate Care Facility, and Robinson Developmental Center. By the end of the 1975, 132 people had transferred from Polk State Center and were living and receiving services at CCI. The Agency reflects a person centered philosophy in which people receiving services are gainfully employed, active in their communities, are treated with dignity and respect, they have choices and CCI helps them achieve their goals and dreams.",
			"meta": {
				"refs": [
					"https://www.pfq.org/citizen-care-inc"
				]
			},
			"uuid": "892ab24e-6b54-11e9-a923-1681be663d3e",
			"value": "Citizen Care"
		},
		{
			"description": "With 40 years of experience, Exceptional Adventures provides top-notch vacation opportunities, events and monthly activities for adolescents and adults with intellectual and physical disabilities.",
			"meta": {
				"refs": [
					"https://www.pfq.org/exceptional-adventures"
				]
			},
			"uuid": "892ab960-6b54-11e9-a923-1681be663d3e",
			"value": "Exceptional Adventures"
		},
		{
			"description": "Milestone Centers' mission is to provide quality, life-enhancing services that promote wellness and the development of human potential to persons with intellectual and developmental disabilities and or behavioral health challenges.",
			"meta": {
				"refs": [
					"https://www.pfq.org/milestone-centers-inc"
				]
			},
			"uuid": "892abb04-6b54-11e9-a923-1681be663d3e",
			"value": "Milestone Centers"
		},
		{
			"description": "The Partners For Quality Foundation strives to advance, promote and support the mission of the agency. Partners For Quality receives operating funds through various sources, private gifts, grants and special events help the agency go above and beyond basic needs.",
			"meta": {
				"refs": [
					"https://www.pfq.org/partners-quality-foundation"
				]
			},
			"uuid": "892abd02-6b54-11e9-a923-1681be663d3e",
			"value": "Partners For Quality Foundation"
		},
		{
			"description": "Hong Kong based government supported dental clinic.",
			"meta": {
				"refs": [
					"https://tel.directory.gov.hk/0258000401_ENG.html"
				]
			},
			"uuid": "565f041c-7105-11e9-a923-1681be663d3e",
			"value": "Li Po Chun Dental Clinic"
		},
		{
			"description": "Provides quality medical, dental, pediatric and behavioral health services to all members of our community.  Founded in 1994 as a Santa Barbara based non-profit, our community clinic has served the Central-Coast’s healthcare needs for over twenty years.  Our patient-centered medical home model organizes primary care in a manner that emphasizes care coordination and communication between the patient and provider and outside specialists.  We cultivate more engaging patient relationships and achieve better health outcomes by putting patients’ needs first.  Our doctors are leading the way in providing higher quality care at lower costs, and improving overall experience in primary healthcare.",
			"meta": {
				"refs": [
					"http://www.aihscorp.org/"
				]
			},
			"uuid": "565f06ba-7105-11e9-a923-1681be663d3e",
			"value": "American Indian Health & Services, Inc."
		},
		{
			"description": "Spectrum Health Lakeland is a not-for-profit, community-owned health system, nationally recognized for delivering exemplary patient experiences and clinical outcomes.",
			"meta": {
				"refs": [
					"https://www.spectrumhealth.org/lakeland"
				]
			},
			"uuid": "eb3ace92-7bd5-11e9-8f9e-2a86e4085a59",
			"value": "Spectrum Health Lakeland"
		},
		{
			"description": "Tahoe Forest Hospital offers 24 hour emergency care, an ambulatory surgery center, intensive care, orthopedics and sports medicine, a medical and surgical unit, women and family center, home health and hospice programs, a health clinic, cancer center, long term care center, children’s center, a health and sports performance center, as well as a variety of community health outreach programs.",
			"meta": {
				"refs": [
					"https://www.tfhd.com/"
				]
			},
			"uuid": "eb3ad14e-7bd5-11e9-8f9e-2a86e4085a59",
			"value": "Tahoe Forest Health District"
		},
		{
			"description": "At Sauk Prairie Healthcare and Hospital, located in Prairie du Sac, WI, our mission is to provide extraordinary healthcare from the heart.",
			"meta": {
				"refs": [
					"https://www.saukprairiehealthcare.org/"
				]
			},
			"uuid": "eb3ad5c2-7bd5-11e9-8f9e-2a86e4085a59",
			"value": "Sauk Prairie Healthcare, Inc."
		},
		{
			"description": "Cancer Treatment Centers of America, headquartered in Boca Raton, Florida, is a national, for-profit network of five comprehensive cancer care and research centers and three out patient care centers that serves cancer patients throughout the United States. CTCA was originally headquartered in Schaumburg, Illinois.",
			"meta": {
				"refs": [
					"https://www.cancercenter.com/"
				]
			},
			"uuid": "eb3ad72a-7bd5-11e9-8f9e-2a86e4085a59",
			"value": "Cancer Treatment Centers of America"
		},
		{
			"description": "Southeastern Health is a non-profit organization and is accredited by DNV-GL Healthcare. The medical center is licensed for 452 beds and offers a combination of acute care, intensive care and psychiatric services to more than 14,000 inpatients and 78,000 emergency patients annually. The Medical Center is a comprehensive health care system which offers a wide array of health care services through its affiliated divisions. Additional information about Southeastern Health can be found by visiting www.srmc.org and on Facebook at www.facebook.com/sehealth.",
			"meta": {
				"refs": [
					"http://www.srmc.org/"
				]
			},
			"uuid": "eb3ad86a-7bd5-11e9-8f9e-2a86e4085a59",
			"value": "Southeastern Regional Medical Center"
		},
		{
			"description": "Established in 1984, Equitas Health is a regional not-for-profit community-based healthcare system and federally qualified community health center look-alike. Its expanded mission has made it one of the nation’s largest HIV/AIDS, lesbian, gay, bisexual, transgender, and queer/questioning (LGBTQ) healthcare organizations. With 17 offices in 11 cities, it serves more than 67,000 individuals in Ohio, Kentucky, and West Virginia each year through its diverse healthcare and social service delivery system focused around primary and specialized medical care, retail pharmacy, dental, behavioral health, HIV/STI prevention, advocacy, and community health initiatives.",
			"meta": {
				"refs": [
					"https://equitashealth.com/"
				]
			},
			"uuid": "bbd44be6-7bd6-11e9-8f9e-2a86e4085a59",
			"value": "Equitas Health, Inc."
		},
		{
			"description": "Memorial Hermann Health System is the largest not-for-profit health system in southeast Texas and consists of 16 hospitals, 8 Cancer Centers, 3 Heart & Vascular Institutes, and 27 sports medicine and rehabilitation centers, in addition to other outpatient and rehabilitation centers.",
			"meta": {
				"refs": [
					"http://www.memorialhermann.org/"
				]
			},
			"uuid": "bbd44eb6-7bd6-11e9-8f9e-2a86e4085a59",
			"value": "Memorial Hermann Health System"
		},
		{
			"description": "Accredited by The Joint Commission’s Health Facilities Accreditation Program and is approved by the New York State Department of Health.",
			"meta": {
				"refs": [
					"https://ehs.org/"
				]
			},
			"uuid": "bbd4500a-7bd6-11e9-8f9e-2a86e4085a59",
			"value": "Episcopal Health Services Inc."
		},
		{
			"description": "During the last 40 years UMC, a public hospital for the citizens of Lubbock County, has become a health system we can be proud of and a great investment for Lubbock County taxpayers. Together with UMC Physicians, UMC has seen an increase in market share, demand for service, and growth in reputation. Even during difficult economic times, sound financial planning has allowed the system to thrive.",
			"meta": {
				"refs": [
					"https://www.umchealthsystem.com/"
				]
			},
			"uuid": "bbd451ae-7bd6-11e9-8f9e-2a86e4085a59",
			"value": "UMC Health System"
		},
		{
			"description": "Branch of UMC Health Sysetm.",
			"meta": {
				"refs": [
					"https://www.umchealthsystem.com/medical-services/gastroenterology/locations-contact/umc-southwest-gastroenterology"
				]
			},
			"uuid": "bbd452f8-7bd6-11e9-8f9e-2a86e4085a59",
			"value": "UMC Southwest Gastroenterology"
		},
		{
			"description": "The Southeastern Council on Alcoholism and Drug Dependence, Inc. (SCADD) is an organization dedicated to helping people and their families with alcohol and substance abuse problems. SCADD was founded in 1966 by three men — Attorney Morgan K. McGuire, Dr. Joseph A. Ceha and Reverend Orin E. Dice who shared a vision of a community program organized, staffed, operated and funded, in part, by the people of Southeastern Connecticut.",
			"meta": {
				"refs": [
					"http://www.scadd.org/"
				]
			},
			"uuid": "7c81f0e6-7bd7-11e9-8f9e-2a86e4085a59",
			"value": "The Southeastern Council on Alcoholism and Drug Dependence, Inc."
		},
		{
			"description": "TriHealth is a unified health system based in Cincinnati, Ohio, United States. It was originally formed in 1995 to bring together physicians, Bethesda and Good Samaritan Hospitals and the community.",
			"meta": {
				"refs": [
					"https://www.trihealth.com/"
				]
			},
			"uuid": "adfb32b0-8224-11e9-bc42-526af7764f64",
			"value": "TriHealth"
		},
		{
			"description": "The Nova Scotia Health Authority is a provincial health authority serving Nova Scotia, Canada. It is the largest employer in the province, with more than 23,000 employees, 2,500 physicians and 7,000 volunteers working from 45 different facilities. Its largest hospital is the QEII Health Sciences Centre in Halifax.",
			"meta": {
				"refs": [
					"http://www.nshealth.ca/"
				]
			},
			"uuid": "17c671ba-8d41-11e9-bc42-526af7764f64",
			"value": "The Nova Scotia Health Authority"
		},
		{
			"description": "Olean Medical Group LLP has been serving our community for more than 70 years and is the largest medical group in Western New York outside of Buffalo. Our family practice has six locations, with our central location at 535 Main Street in Olean, NY which includes support services to better meet our patients' needs. Our satellite offices are located in Cuba, Ellicottville, Franklinville and Salamanca, NY, all within 12 - 28 miles of our main office.",
			"meta": {
				"refs": [
					"https://oleanmedicalgroup.com/"
				]
			},
			"uuid": "bdcadb18-95ee-11e9-bc42-526af7764f64",
			"value": "Olean Medical Group"
		},
		{
			"description": "Our mission at Capitol Cardiology Associates is to provide our patients with the highest standard of cardiovascular care through our compassion, medical expertise, and commitment to excellence. Our prime goal is to benefit the community, by providing the full spectrum of cardiac services that modern technology has to offer.",
			"meta": {
				"refs": [
					"https://www.capitolcardiology.com/"
				]
			},
			"uuid": "bdcadeb0-95ee-11e9-bc42-526af7764f64",
			"value": "Capitol Cardiology Associates"
		},
		{
			"description": "Southern Maryland Medical Group provides professional treatment for all phases of family medical care from pediatrics to geriatrics. They can be relied upon to perform general diagnostic tests such as throat cultures and blood work as well as school and pre-employment physicals and routine medical checkups. Referrals to other medical specialties are always made when necessary.",
			"meta": {
				"refs": [
					"http://smmgmd.com/"
				]
			},
			"uuid": "bdcae004-95ee-11e9-bc42-526af7764f64",
			"value": "Southern Maryland Medical Group"
		},
		{
			"description": "We specialize in disorders of the genitourinary tract in both male and female patients. Our group offers current minimally invasive and advanced technologies to our patients with over 80 years of combined experience. We are proud to serve Mahoning and Trumbull counties plus surrounding areas.",
			"meta": {
				"refs": [
					"http://www.neourology.com/"
				]
			},
			"uuid": "bdcae1e4-95ee-11e9-bc42-526af7764f64",
			"value": "N.E.O. Urology"
		},
		{
			"description": "Creighton University Campus Pharmacy at 2412 Cuming St.",
			"meta": {
				"refs": [
					"https://spahp.creighton.edu/clinical-services/creighton-university-campus-pharmacy"
				]
			},
			"uuid": "bdcae324-95ee-11e9-bc42-526af7764f64",
			"value": "Creighton University Campus Pharmacy"
		},
		{
			"description": "Franciscan Health is a 14-hospital health system which includes clinics, home health services and doctors serving Indiana and Illinois.",
			"meta": {
				"refs": [
					"https://www.franciscanhealth.org/"
				]
			},
			"uuid": "21372192-a5d1-11e9-a2a3-2a2ae2dbcce4",
			"value": "Franciscan Health"
		},
		{
			"description": "Summa Health is a nonprofit integrated healthcare delivery system in Northeast Ohio, United States. The Greater Akron Chamber documents Summa Health as the largest employer in Summit County with more than 7,000 employees. Summa provides comprehensive emergency, acute, critical, outpatient and long-term/home care.",
			"meta": {
				"refs": [
					"https://www.summahealth.org/"
				]
			},
			"uuid": "21372408-a5d1-11e9-a2a3-2a2ae2dbcce4",
			"value": "Summa Health"
		},
		{
			"description": "Alive Hospice provides loving care to people with life-threatening illnesses, support to their families and service to the community in a spirit of enriching lives.",
			"meta": {
				"refs": [
					"https://www.alivehospice.org/"
				]
			},
			"uuid": "21372570-a5d1-11e9-a2a3-2a2ae2dbcce4",
			"value": "Alive Hospice"
		},
		{
			"description": "We provide comprehensive, integrated primary health care services for all to improve the health and wellbeing of our patients and the Maine communities we serve.",
			"meta": {
				"refs": [
					"https://pchc.com/"
				]
			},
			"uuid": "f9186452-abbe-11e9-a2a3-2a2ae2dbcce4",
			"value": "Penobscot Community Health Center"
		},
		{
			"description": "At Wise Health System, we are committed to leading the growth and development of health care services in our area and providing quality, specialized care for you and your family. Our affiliation with Baylor Scott & White Health allows Wise Health System to access resources from one of the most highly regarded health care systems in the world today, maximizing the delivery of health care in our region. With more than 1,900 employees and growing, our health care system continues to be the largest employer in Wise County. Wise Health System is a 501(c)(3) not-for-profit organization.",
			"meta": {
				"refs": [
					"https://www.wisehealthsystem.com/about/"
				]
			},
			"uuid": "f91866b4-abbe-11e9-a2a3-2a2ae2dbcce4",
			"value": "Wise Health System"
		},
		{
			"description": "South Texas Dermatology is a unique practice offering advanced technology for general dermatology, mohs surgery, skin rejuvenation and cosmetic procedures. Located in Corpus Christi, Texas we are serving patients throughout South Texas. Our team of skin experts is lead by Dr. Wayne Fagan, Dr. Nathan Davis and Dr. Richard DeVillez.",
			"meta": {
				"refs": [
					"http://www.southtxderm.com/"
				]
			},
			"uuid": "6068e55e-aca6-11e9-a2a3-2a2ae2dbcce4",
			"value": "South Texas Dermatopathology, PLLC"
		},
		{
			"description": "General and cosmetic dentisry in Maitland, FL.",
			"meta": {
				"refs": [
					"http://www.maitlanddentistry.com/"
				]
			},
			"uuid": "40c1f8ea-bf83-11e9-9cb5-2a2ae2dbcce4",
			"value": "Maitland Dentistry"
		},
		{
			"description": "Presbyterian Healthcare Services is a private not-for-profit health care system and health care provider in the State of New Mexico. It owns and operates 8 hospitals in 7 New Mexico communities. It also operates Presbyterian Health Plan.",
			"meta": {
				"refs": [
					"https://www.phs.org/Pages/default.aspx"
				]
			},
			"uuid": "40c1fbd8-bf83-11e9-9cb5-2a2ae2dbcce4",
			"value": "Presbyterian Healthcare Services"
		},
		{
			"description": "Truman Medical Centers (TMC) has all the things you expect from a great health system. With two acute care academic hospital locations, the largest, most comprehensive behavioral health program in the area, a long-term care facility and multiple primary care practices, TMC provides care from birth through your senior years. We are the primary teaching hospital for the University of Missouri-Kansas City School of Medicine, so our doctors are academic specialists who teach tomorrow’s doctors the very latest updates in their respective specialties.",
			"meta": {
				"refs": [
					"https://www.trumed.org/"
				]
			},
			"uuid": "40c1fd54-bf83-11e9-9cb5-2a2ae2dbcce4",
			"value": "Truman Medical Centers"
		},
		{
			"description": "Renown Health is the largest locally owned not-for-profit healthcare network in Northern Nevada. It has more than 6,500 employees system-wide and is one of Northern Nevada's largest employers.",
			"meta": {
				"refs": [
					"https://www.renown.org/"
				]
			},
			"uuid": "40c1fe94-bf83-11e9-9cb5-2a2ae2dbcce4",
			"value": "Renown Health"
		},
		{
			"description": "Local drug store in TN.",
			"meta": {
				"refs": [
					"https://www.databreaches.net/ugh-amazon-buckets-with-1-8-million-pharmacy-related-files-and-1-2-million-telemarketing-recordings-about-diabetic-supplies-found-unsecured/"
				]
			},
			"uuid": "40c1ffde-bf83-11e9-9cb5-2a2ae2dbcce4",
			"value": "Lynchburg Drug Store TN"
		},
		{
			"description": "Local pharmacy in MD.",
			"meta": {
				"refs": [
					"https://www.databreaches.net/ugh-amazon-buckets-with-1-8-million-pharmacy-related-files-and-1-2-million-telemarketing-recordings-about-diabetic-supplies-found-unsecured/"
				]
			},
			"uuid": "fd6c4b44-bf83-11e9-9cb5-2a2ae2dbcce4",
			"value": "Chesapeake Bay Pharmacy MD"
		},
		{
			"description": "Local drug store in FL.",
			"meta": {
				"refs": [
					"https://www.databreaches.net/ugh-amazon-buckets-with-1-8-million-pharmacy-related-files-and-1-2-million-telemarketing-recordings-about-diabetic-supplies-found-unsecured/"
				]
			},
			"uuid": "fd6c51ca-bf83-11e9-9cb5-2a2ae2dbcce4",
			"value": "Milton Medical & Drug FL"
		},
		{
			"description": "The NCH Healthcare System is a not-for-profit, multi-facility healthcare system located in Naples, Florida, United States. The anchor of the system is the two hospitals with a total of 681 beds.",
			"meta": {
				"refs": [
					"https://www.nchmd.org/"
				]
			},
			"uuid": "fd6c5346-bf83-11e9-9cb5-2a2ae2dbcce4",
			"value": "The NCH Healthcare System"
		},
		{
			"description": "Western Connecticut Health Network is a for-profit group of three Western Connecticut hospitals formed in 2010 by Danbury Hospital, New Milford Hospital and Norwalk Hospital.",
			"meta": {
				"refs": [
					"https://www.westernconnecticuthealthnetwork.org/introducing-nuvance-health"
				]
			},
			"uuid": "1fa9b4d6-c677-11e9-aa8c-2a2ae2dbcce4",
			"value": "Western Connecticut Health Network"
		},
		{
			"description": "Michigan Medicine, formerly the University of Michigan Health System, is the wholly owned academic medical center of the University of Michigan in Ann Arbor.",
			"meta": {
				"refs": [
					"https://med.umich.edu/"
				]
			},
			"uuid": "1fa9b792-c677-11e9-aa8c-2a2ae2dbcce4",
			"value": "Michigan Medicine University of Michigan"
		},
		{
			"description": "General and cosmetic dentistry services.",
			"meta": {
				"refs": [
					"http://www.maitlanddentistry.com/"
				]
			},
			"uuid": "633913d2-cb30-11e9-a32f-2a2ae2dbcce4",
			"value": "Maitland Dentistry"
		},
		{
			"description": "Capital and Coast DHB (CCDHB) is located centrally in Wellington and has over 6,000 full-time equivalent staff, making us one of the major employers in the Wellington region. CCDHB operates two hospitals – Wellington Regional Hospital in Newtown and Kenepuru Hospital in Porirua – as well as the Kāpiti Health Centre at Paraparaumu.",
			"meta": {
				"refs": [
					"https://www.ccdhb.org.nz/"
				]
			},
			"uuid": "63391634-cb30-11e9-a32f-2a2ae2dbcce4",
			"value": "Capital & Coast District Health Board"
		},
		{
			"description": "UC Health brings together the region’s top clinicians and researchers to provide world-class care to the Cincinnati community and beyond. From our flagship University of Cincinnati Medical Center to our state-of-the-art West Chester Hospital, UC Health delivers the absolute best in treatment and care.",
			"meta": {
				"refs": [
					"https://www.uchealth.com"
				]
			},
			"uuid": "fafc9fc4-d353-11e9-bb65-2a2ae2dbcce4",
			"value": "UC Health, OH"
		},
		{
			"description": "The Gender Identity Clinic (GIC) is the largest and oldest gender clinic in the UK, dating back to 1966. We accept referrals from all over the UK for adults with issues related to gender. We accept referrals for patients who are aged 17 years and older onto our waiting list. Patients will not be offered an appointment before their 18th birthday.",
			"meta": {
				"refs": [
					"https://gic.nhs.uk/"
				]
			},
			"uuid": "fafca244-d353-11e9-bb65-2a2ae2dbcce4",
			"value": "Charing Cross Gender Identity Clinic"
		},
		{
			"description": "Healthcare service provider in the state of Utah.",
			"meta": {
				"refs": [
					"https://premierfamily.net/"
				]
			},
			"uuid": "76bf64b8-d587-11e9-bb65-2a2ae2dbcce4",
			"value": "Premier Family Medical, UT"
		},
		{
			"description": "The Loyola University Medical Center, also known as Loyola Medicine, is a quaternary-care system with a 61-acre main medical center campus in the western suburbs of Chicago, in the U.S. state of Illinois. The medical center campus is located in Maywood, 13 miles west of the Chicago Loop and 8 miles east of Oak Brook.",
			"meta": {
				"refs": [
					"https://www.loyolamedicine.org/"
				]
			},
			"uuid": "8f58982e-db08-11e9-8a34-2a2ae2dbcce4",
			"value": "Loyola University Medical Center"
		},
		{
			"description": "Sarrell Dental and Eye Centers, based in Anniston, Alabama, is the largest dental provider in the state of Alabama. Sarrell was organized as a non-profit 501 tax-exempt organization in 2005, and currently operates 17 dental clinics, 4 clinics include vision care and a mobile dental bus.",
			"meta": {
				"refs": [
					"http://www.sarrelldental.org/"
				]
			},
			"uuid": "8f589b58-db08-11e9-8a34-2a2ae2dbcce4",
			"value": "Sarrell Dental & Eye Centers"
		},
		{
			"description": "Magellan Health Inc., is an American for-profit managed health care company, focused on special populations, complete pharmacy benefits and other specialty areas of healthcare.",
			"meta": {
				"refs": [
					"https://www.magellanhealth.com/"
				]
			},
			"uuid": "3f7ad938-dd7f-11e9-8a34-2a2ae2dbcce4",
			"value": "Magellan Health, Inc."
		},
		{
			"description": "Campbell County Health includes Campbell County Memorial Hospital, a 90-bed acute care, community hospital in Gillette; Campbell County Medical Group with nearly 20 clinics; The Legacy Living & Rehabilitation Center long-term care center and the Powder River Surgery Center. We are certified as an Area Trauma Hospital by the State of Wyoming. Almost 80 physicians, physician assistants and nurse practitioners in over 20 specialties are committed to your wellbeing right here at home. If you haven’t visited us lately, we urge you to get to know us again. Our physicians, nurses and staff are committed to giving you the very best experience possible in Campbell County, Wyoming.",
			"meta": {
				"refs": [
					"https://www.cchwyo.org/"
				]
			},
			"uuid": "3f7addfc-dd7f-11e9-8a34-2a2ae2dbcce4",
			"value": "Campbell County Health"
		},
		{
			"description": "PINN clinics work exclusively with industrial rehabilitation patients. Just as orthopedists specialize in broken bones, we tailor rehab plans to the unique physical demands of each worker’s job. PINN’s functional approach to treatment means patients return to their work healthy, strong, and prepared to meet the demands of their jobs.",
			"meta": {
				"refs": [
					"https://www.pinnrehab.com/"
				]
			},
			"uuid": "8608a694-e17d-11e9-81b4-2a2ae2dbcce4",
			"value": "Peoples Injury Network Northwest (PINN)"
		},
		{
			"description": "The Listowel Wingham Hospitals Alliance was formed on July 1, 2003 as a partnership between Listowel Memorial Hospital and Wingham and District Hospital. As an Alliance, we share a common management structure with a single management team and one Mission, Vision & Values. There are still two separate corporations, however, the two Boards meet at the same time as a single Alliance Board. We look for opportunities to share services and programs across our two communities and find creative ways to link to our community partners.",
			"meta": {
				"refs": [
					"http://www.lwha.ca/"
				]
			},
			"uuid": "8608a90a-e17d-11e9-81b4-2a2ae2dbcce4",
			"value": "The Listowel Wingham Hospitals Alliance"
		},
		{
			"description": "The South West Alliance Of Rural Health (SWARH) is an Alliance of public health agencies in the South West of Victoria covering an area of approximately 60,000 sq. kilometres connecting all public acute hospitals and associated health services in a region extending from west of Melbourne to the South Australian Border. SWARH was formed in late 1997 to focus on the development of IT for the Acute Public Hospitals in the South West Region of Victoria. In addition to the financial incentive provided by the Department of Human Services, the SWARH Alliance has been fortunate to have a group of Chief Executive Officers and Hospital Boards who, although not technically expert, have appreciated the fact that as individual agencies, the capacity to invest in technology to improve service delivery and gain returns on the investment required was not possible on their own.",
			"meta": {
				"refs": [
					"https://www.swarh2.com.au/"
				]
			},
			"uuid": "d82ae642-e5fd-11e9-81b4-2a2ae2dbcce4",
			"value": "South West Alliance of Rural Health (Vic)"
		},
		{
			"description": "Wood Ranch Medical, a Medical Group Practice located in Simi Valley, CA.",
			"meta": {
				"refs": [
					"https://www.woodranchmedical.com/"
				]
			},
			"uuid": "d82ae8ea-e5fd-11e9-81b4-2a2ae2dbcce4",
			"value": "Wood Ranch Medical"
		},
		{
			"description": "Demant is a leading international hearing health care company within hearing aids, audiometric equipment, and personal communication. Today, the Demant Group is a market leader within hearing health and operates in hearing devices, hearing implants, diagnostic instruments and intelligent audio solutions.",
			"meta": {
				"refs": [
					"https://www.demant.com/"
				]
			},
			"uuid": "d82aea48-e5fd-11e9-81b4-2a2ae2dbcce4",
			"value": "Demant"
		},
		{
			"description": "North Florida OBGYN is a private practice of over 70 physicians in greater Jacksonville, FL, serving teenage adolescents, young and mature.",
			"meta": {
				"refs": [
					"https://www.nfobgyn.com/"
				]
			},
			"uuid": "d82aeb7e-e5fd-11e9-81b4-2a2ae2dbcce4",
			"value": "North Florida OBGYN"
		},
		{
			"description": "DCH Regional Medical Center, originally known as Druid City Hospital and generally referred to as DCH, is a public, not-for-profit hospital and medical complex located in Tuscaloosa, Alabama that serves the West Alabama region.",
			"meta": {
				"refs": [
					"https://www.dchsystem.com/"
				]
			},
			"uuid": "47fd1070-e870-11e9-81b4-2a2ae2dbcce4",
			"value": "DCH Health System"
		},
		{
			"description": "Pharmacy in Rankin Inlet, Canada",
			"meta": {
				"refs": [
					"https://www.yellowpages.ca/bus/Nunavut/Rankin-Inlet/Sakku-Drugs-Ltd/3323037.html"
				]
			},
			"uuid": "47fd14f8-e870-11e9-81b4-2a2ae2dbcce4",
			"value": "Sakku Drugs Ltd"
		},
		{
			"description": "Count on Goshen Health to provide your family with exceptional healthcare services for every stage of life. We have earned local, state and national recognition for our dedication to improving the health of our community. Goshen Hospital ranks as one of the best in Indiana. Its Magnet designation means our nurses go beyond the standard of care to take care of you. Our dedicated doctors and specialists provide compassionate care with medical excellence from 38 locations in four counties. That means you can find family doctors and pediatricians, cancer care specialists and heart treatment, orthopedic medicine, women’s health services and more close to home.",
			"meta": {
				"refs": [
					"https://goshenhealth.com"
				]
			},
			"uuid": "47fd166a-e870-11e9-81b4-2a2ae2dbcce4",
			"value": "Goshen Health"
		},
		{
			"description": "Bolton NHS Foundation Trust provides patient care in the community at health centres and clinics as well as services such as district nursing and intermediate care. We also provide services at the Royal Bolton Hospital.",
			"meta": {
				"refs": [
					"http://www.boltonft.nhs.uk/"
				]
			},
			"uuid": "47fd18b8-e870-11e9-81b4-2a2ae2dbcce4",
			"value": "Royal Bolton NHS Foundation Trust"
		},
		{
			"description": "Compass Health Wellington Trust (formerly named the Greater Wellington Health Trust) was formed in 1997 to contract with District Health Boards and other funders to provide health services, and was managed by the Wellington Independent Practitioner's Association (WIPA, formed in 1995). Compass Health in its present state was formed in July 2010 by the merger of three existing PHOs - Capital PHO, Tumai Mo Te Iwi, and Kapiti PHO. Wairarapa PHO was then merged into Compass Health in 2012. The PHO has contracts with health professionals and organisations in the community, such as General Practitioners and the wider General Practice teams to help deliver quality health services to you.",
			"meta": {
				"refs": [
					"https://www.compasshealth.org.nz/"
				]
			},
			"uuid": "5e0ffade-eea7-11e9-81b4-2a2ae2dbcce4",
			"value": "Compass Health (Tū Ora)"
		},
		{
			"description": "CHI Health is a non-profit, faith-based health organization with headquarters in Omaha, Nebraska. CHI Health is made up of 14 acute care hospitals, five of which are located in the Omaha metro area. CHI stands for Catholic Health Initiatives.",
			"meta": {
				"refs": [
					"https://www.chihealth.com/"
				]
			},
			"uuid": "5e0ffd40-eea7-11e9-81b4-2a2ae2dbcce4",
			"value": "CHI Health"
		},
		{
			"description": "We understand that health care is a local issue and health is a personal concern. That is why we have assembled a full range of health care services to meet the growing needs of our regions residents and visitors. Kalispell Regional Healthcare mission is to improve the health, comfort and lives of the people we serve. We do that through a host of health care facilities and services designed to serve our local community.",
			"meta": {
				"refs": [
					"https://www.krh.org/"
				]
			},
			"uuid": "d7cdee12-f81b-11e9-8f0b-362b9e155667",
			"value": "Kalispell Regional Healthcare"
		},
		{
			"description": "Subsidiary of Magellan Health, Inc.",
			"meta": {
				"refs": [
					"http://www.niahealthcare.com/"
				]
			},
			"uuid": "d7cdf0b0-f81b-11e9-8f0b-362b9e155667",
			"value": "National Imaging Associates, Inc"
		},
		{
			"description": "Betty Jean Kerr Peoples Health Centers (PHC), founded in 1972, has been at the forefront of providing quality health care to the St. Louis metropolitan area for over 40 years. The mission of PHC is to provide comprehensive primary health care, such as pediatrics, internal medicine, OBGYN, dental, mammography, behavioral health, pharmacy, radiology, podiatry and laboratory services, to meet the health needs of the entire community. PHC is committed to serving the impoverished, uninsured populations in St. Louis and St Louis County communities. With three (3) conveniently located health centers, and a friendly welcoming staff, PHC aspires to serve all the health care and wellness needs of the entire family.",
			"meta": {
				"refs": [
					"https://phcenters.org/about/"
				]
			},
			"uuid": "a0cfab52-0334-11ea-8d71-362b9e155667",
			"value": "Betty Jean Kerr People's Health Centers (PHC)"
		},
		{
			"description": "Prisma Health, formerly Palmetto Health and Greenville Health System, is the largest not-for-profit health organization in South Carolina after Palmetto Health and the Greenville Health System merged in November 2017.",
			"meta": {
				"refs": [
					"https://www.prismahealth.org/"
				]
			},
			"uuid": "a0cfadd2-0334-11ea-8d71-362b9e155667",
			"value": "Prisma Health"
		},
		{
			"description": "Founded in 1993, InterMed serves primary care patients in the community through our practice sites in Portland, South Portland, and Yarmouth. Specialty and ancillary services support patient care with audiology, laboratory testing, radiology, diagnostic imaging, as well as therapeutic services, such as physical therapy. Specialty physician services include Cardiology, Dermatology, Ear Nose & Throat, OBGYN, and Sports Medicine. Our Marginal Way location boasts two state-of-the-art surgical rooms, where we offer procedures for our Gastrointestinal, Gynecologic, Otolaryngology (Ears, Nose, and Throat), Orthopedics, Podiatry, and Urology patients. For InterMed patients seeking care beyond normal hours, or when their provider is not available, we offer a seven-day-a-week Urgent Care, as well as our Extended Primary Care weekend clinic. InterMed also provides on-site urgent care and physical therapy services at IDEXX, as well as physical therapy and occupational medicine at L.L.Bean and SAPPI.",
			"meta": {
				"refs": [
					"https://www.intermed.com/"
				]
			},
			"uuid": "a0cfaf26-0334-11ea-8d71-362b9e155667",
			"value": "InterMed, P.A."
		},
		{
			"description": "We are Connecticut’s leading multispecialty group. We are proud of our renowned medical providers, wide range of specialties, coordinated approach to care, and strong focus on building enduring relationships with our patients. We offer 27 specialities in 32 convenient locations. Learn how Starling Physicians can handle all your healthcare needs.",
			"meta": {
				"refs": [
					"https://www.starlingphysicians.com/"
				]
			},
			"uuid": "a0fa198a-096c-11ea-8d71-362b9e155667",
			"value": "Starling Physicians"
		},
		{
			"description": "Select Health Network is a Physician Hospital Organization which began operations in 1994 and provides a comprehensive physician network in St. Joseph and Marshall Counties, Indiana. In total, Select Health Network offers access to over 770 providers including specialists, primary care physicians and mid-level providers.",
			"meta": {
				"refs": [
					"https://www.selecthealthnetwork.com/"
				]
			},
			"uuid": "a0fa1e12-096c-11ea-8d71-362b9e155667",
			"value": "Select Health Network Inc."
		},
		{
			"description": "At Sunshine Behavioral Health our goal is to help as many people as possible in their struggles with substance abuse. We aim to show people that not only is sobriety possible, but repairing the damages of addiction can also be obtained. At Sunshine, we believe that every person’s addiction story is different, which is why we equip our centers with licensed professionals for every unique treatment available. From holistic therapies to our faith-based counselors, and our 12 step or SMART Recovery programs, Sunshine aims to staff our facilities with the best of the best in all facets of addiction treatment. At Sunshine we offer a comprehensive program from our inpatient rehab centers to intensive outpatient treatment (IOP) as well as sober living homes. Our addiction counselors work hard to develop unique aftercare programs for each patient we come across. Whether you live in the state of one of our centers or travel for treatment, we can find support groups, therapists and outpatient programs in any area our patients return home to. We also employ a team of insurance experts who understand the ins and outs of healthcare law. Our insurance team knows how to handle insurance companies and maximize your healthcare benefits. We strive to obtain the highest quality of care for the smallest out of pocket expense. The leadership of Sunshine Behavioral Health believes that everybody should be able to receive the best addiction treatment without the fear of breaking the bank.",
			"meta": {
				"refs": [
					"https://www.sunshinebehavioralhealth.com/"
				]
			},
			"uuid": "a0fa1f98-096c-11ea-8d71-362b9e155667",
			"value": "Sunshine Behavioral Health, LLC"
		},
		{
			"description": "Aegis Medical Group is a comprehensive network of physicians working together to make sure your healthcare needs are met in a respectful, helpful and efficient way. Our healthcare network is made up of primary care, internal medicine, hospitalist, endocrinology, cardiology, pain management, infectious disease, Nephrology, Neurology, Rheumatology, physician assistants, and nurse practitioners. It also encompasses our preferred provider network which includes home health, skilled nursing facilities, assisted living facilities and outpatient therapies.",
			"meta": {
				"refs": [
					"https://aegismedicalgroup.com/"
				]
			},
			"uuid": "a0fa20ce-096c-11ea-8d71-362b9e155667",
			"value": "Aegis Medical Group"
		},
		{
			"description": "National Veterinary Associates (NVA) is the largest private owner of freestanding veterinary hospitals in the United States. NVA owns over 600 veterinary hospitals and boarding facilities in the United States, Canada, Australia and New Zealand.",
			"meta": {
				"refs": [
					"https://www.nva.com/"
				]
			},
			"uuid": "bdf02804-0c87-11ea-8d71-362b9e155667",
			"value": "National Veterinary Associates (NVA)"
		},
		{
			"description": "Saint Francis Medical Center is a 306-bed facility serving more than 715,000 people throughout Missouri, Illinois, Kentucky, Tennessee and Arkansas. Guided by our mission to provide a ministry of healing, wellness, quality and love inspired by our faith in Jesus Christ, we have become a progressive, innovative regional tertiary care referral center.",
			"meta": {
				"refs": [
					"https://www.sfmc.net/"
				]
			},
			"uuid": "61593484-0d5c-11ea-8d71-362b9e155667",
			"value": "Saint Francis Healthcare System"
		},
		{
			"description": "A premier multi-specialty healthcare group providing quality state-of-the-art medical services in a caring, compassionate and professional atmosphere.",
			"meta": {
				"refs": [
					"https://www.sfmc.net/group/ferguson-medical-group/"
				]
			},
			"uuid": "6159389e-0d5c-11ea-8d71-362b9e155667",
			"value": "Ferguson Medical Group (FMG)"
		},
		{
			"description": "Located just left-of-center in the state, Great Plains Health in North Platte, Nebraska, is a nonprofit, fully accredited, 116-bed regional referral center serving west Nebraska, northern Kansas and northern Colorado. In total, our primary and secondary service areas span 34 counties, 136,000 lives and approximately 67,832 square miles, about the size of the state of Pennsylvania. With nearly 100 physicians representing 30 medical specialties, the Great Plains Health system offers advanced medical services, including heart and vascular, cancer, orthopedic services, women's services, and a level III trauma center. The system employs approximately 1,100 employees and has more than 200 volunteers. The range of patient populations served includes neonatal, pediatric, adult, obstetric and geriatric.",
			"meta": {
				"refs": [
					"https://www.gphealth.org/"
				]
			},
			"uuid": "e4fc760e-1534-11ea-8d71-362b9e155667",
			"value": "Great Plains Health"
		},
		{
			"description": "UPMC Susquehanna is a six-hospital integrated health system in northcentral Pennsylvania including Williamsport Regional Medical Center, Divine Providence Campus, UPMC Susquehanna Muncy, UPMC Susquehanna Soldiers and Sailors, UPMC Susquehanna Lock Haven, UPMC Susquehanna Sunbury, and UPMC Susquehanna Williamsport.",
			"meta": {
				"refs": [
					"https://www.susquehannahealth.org/"
				]
			},
			"uuid": "e4fc78e8-1534-11ea-8d71-362b9e155667",
			"value": "UPMC Susquehanna"
		},
		{
			"description": "We are a community health center supporting your health by offering affordable, quality care. Our patient-centered care model provides a sensible integration of the following primary care services - medical, dental, behavioral health, laboratory, radiology, pharmacy, care management, and health education.",
			"meta": {
				"refs": [
					"https://sunrisecommunityhealth.org/en/"
				]
			},
			"uuid": "df8e2526-184c-11ea-8d71-362b9e155667",
			"value": "Sunrise Community Health"
		},
		{
			"description": "Hackensack Meridian Health's mission is to provide the full spectrum of life-enhancing care and services to create and sustain healthy, vibrant communities.",
			"meta": {
				"refs": [
					"https://www.hackensackmeridianhealth.org/"
				]
			},
			"uuid": "51e64954-1b64-11ea-9acb-2e728ce88125",
			"value": "Hackensack Meridian Health, Inc."
		},
		{
			"description": "NYC Health + Hospitals, officially the New York City Health and Hospitals Corporation, operates the public hospitals and clinics in New York City as a public benefit corporation.",
			"meta": {
				"refs": [
					"https://www.nychealthandhospitals.org/"
				]
			},
			"uuid": "51e64d32-1b64-11ea-9acb-2e728ce88125",
			"value": "NYC Health + Hospitals"
		},
		{
			"description": "We offer a comprehensive line of healthcare services, including Cardiovascular, Cancer, Orthopedics, Neurosciences, Women and Children’s Services, Trauma, Wound Management & Hyperbaric Medicine, Rehabilitation, Home Care, Hospice, Behavioral Health, Medical Imaging and Lab Services.",
			"meta": {
				"refs": [
					"https://www.cheyenneregional.org/"
				]
			},
			"uuid": "6e869db8-1f8b-11ea-978f-2e728ce88125",
			"value": "Cheyenne Regional Medical Center"
		},
		{
			"description": "Here, cancer treatment services are delivered by experienced and caring cancer specialists who offer guidance and excellence in cancer care. We treat each patient as if they are a part of our own family and offer support, hope and education throughout the process of fighting cancer. Our expert cancer physician team develops tailored treatment plans for each patient based on factors like type of cancer, stage, lifestyle needs and overall health. And our convenient locations ensure patients, their families and loved ones can access outstanding, advanced services close to home. We are with you every step of the way, united to maximize the chances to cure cancer and maintain quality of life.",
			"meta": {
				"refs": [
					"http://www.tccoh.com/about-us/"
				]
			},
			"uuid": "6e86a218-1f8b-11ea-978f-2e728ce88125",
			"value": "The Cancer Center of Hawaii"
		},
		{
			"description": "Affordacare is a new approach to health care. Like our name suggests, we provide cutting- edge medical care to you and your family at an affordable price. Instead of making an expensive trip to the ER, visit one of our six locations to get medical treatment, testing, or physicals. Walk-ins are welcome at all Affordacare locations, but you can reserve an appointment online for even faster service. Our Practitioners can provide patients with referrals to primary care physicians, physical therapists, chiropractors, surgeons, and many other specialists to make sure you get the care you need. In addition to high quality medical care, Affordacare offers full on-site x-ray service to assist in the diagnosis of your problem. Each image is carefully examined by a board certified radiologist. Full laboratory services are also available.",
			"meta": {
				"refs": [
					"https://affordacare.com/"
				]
			},
			"uuid": "2261331e-686d-11ea-bc55-0242ac130003",
			"value": "AffordaCare Urgent Care Clinic"
		},
		{
			"description": "Advanced Urgent Care (AUC) is Key West and Key Largo’s premiere, state-of-the-art urgent care facilities. Established in 2013 by Dr. Bruce Boros, AUC offers a wide variety of treatments for most common medical emergencies and symptoms.",
			"meta": {
				"refs": [
					"http://www.urgentcarefloridakeys.com/"
				]
			},
			"uuid": "2261354e-686d-11ea-bc55-0242ac130003",
			"value": "Advanced Urgent Care of the Florida Keys"
		},
		{
			"description": "Our mission is to provide the most advanced care and treatment for all eye conditions and diseases. Through the use of our state of the art technology, you will receive the most thorough ocular examination available. We have hundreds of frame styles choose from… rimless, titanium, safety, and sunglasses. Also, our contact lens patients have the benefit of the most current choices, including extended-wear lenses, toric lenses for astigmatism, contacts that eliminate the need for reading glasses, and special contacts for dry eyes. The advanced equipment and instruments we use allow for the detection of glaucoma, cataracts, macular degeneration, and diabetic eye disease, just to name a few.",
			"meta": {
				"refs": [
					"http://www.randlemaneyecenter.com/"
				]
			},
			"uuid": "2261368e-686d-11ea-bc55-0242ac130003",
			"value": "Randleman Eye Center, NC"
		},
		{
			"description": "University of Utah Health is the Mountain West's only academic health care system, combining excellence in patient care, the latest in medical research, and teaching to provide leading-edge medicine in a caring and personal setting. The system provides care for Utahns and residents of five surrounding states in a referral area encompassing more than 10 percent of the continental United States. Whether it's for routine care or highly specialized treatment in orthopedics, stroke, ophthalmology, cancer, radiology, fertility, cardiology, genetic-related diseases, organ transplant, or more than 200 other medical specialties, University of Utah Health offers the latest technology and advancements, including some services available nowhere else in the region. As part of that system, University Hospitals and Clinics relies on more than 1,400 board-certified physicians and more than 5,000 health care professionals who staff five hospitals.",
			"meta": {
				"refs": [
					"https://healthcare.utah.edu/"
				]
			},
			"uuid": "485807b0-6d21-11ea-bc55-0242ac130003",
			"value": "University of Utah Health"
		},
		{
			"description": "Golden Valley Health Centers is certified by The Joint Commission as Primary Care Medical Home for patient-centered care.",
			"meta": {
				"refs": [
					"https://www.gvhc.org/"
				]
			},
			"uuid": "485809c2-6d21-11ea-bc55-0242ac130003",
			"value": "Golden Valley Health Centers"
		},
		{
			"description": "Doctors Community Health System is a network of medical and surgical services provided throughout Prince George’s County and in Anne Arundel County.  At the heart of this network is our flagship – Doctors Community Hospital in Lanham, Maryland.  To complement our high-quality and compassionate services, the system has more than a dozen centers of care in Bowie, Camp Springs, Crofton, District Heights, Greenbelt, Hyattsville, Lanham, Largo, Laurel, Riverdale and Temple Hills.",
			"meta": {
				"refs": [
					"https://www.dchweb.org/about-us"
				]
			},
			"uuid": "136d267a-7fdc-11ea-bc55-0242ac130003",
			"value": "Doctors Community Medical Center"
		},
		{
			"description": "Thunder Bay Regional Health Sciences Centre is an acute care facility serving Thunder Bay and much of Northwestern Ontario, Canada. The hospital has 395 acute care beds.",
			"meta": {
				"refs": [
					"https://tbrhsc.net/"
				]
			},
			"uuid": "dd6b6456-83d7-11ea-bc55-0242ac130003",
			"value": "Thunder Bay Regional Health Sciences Centre-Cancer Care"
		},
		{
			"description": "Bay Area Medical Center is a 99-bed general acute care hospital located in Marinette, Wisconsin. Bay Area Medical Center is constructing a new facility to be located on University Avenue, within miles of the existing hospital.",
			"meta": {
				"refs": [
					"https://www.aurorahealthcare.org/locations/hospital/aurora-medical-center-bay-area"
				]
			},
			"uuid": "dd6b6686-83d7-11ea-bc55-0242ac130003",
			"value": "Aurora Medical Center-Bay Area"
		},
		{
			"description": "Beaumont Health is Michigan’s largest health care system. The organization has net revenue of $4.7 billion and consists of eight hospitals with 3,429 beds, 145 outpatient sites, nearly 5,000 physicians, more than 38,000 employees and about 3,500 volunteers.",
			"meta": {
				"refs": [
					"https://www.beaumont.org/"
				]
			},
			"uuid": "dd6b67e4-83d7-11ea-bc55-0242ac130003",
			"value": "Beaumont Health"
		},
		{
			"description": "Located in the heart of southeast Missouri, Poplar Bluff Regional Medical Center encompasses two hospitals and numerous health care service facilities, including cancer treatment centers and physical therapy and rehabilitation facilities. Offering a full range of medical services and procedures to patients in the region, Poplar Bluff Regional Medical Center brings quality health care to this community with comprehensive services and an experienced team of physicians and caregivers.",
			"meta": {
				"refs": [
					"https://www.pbrmc.com/"
				]
			},
			"uuid": "0c805914-8aee-11ea-bc55-0242ac130003",
			"value": "Poplar Bluff Regional Medical Center"
		},
		{
			"description": "BJC HealthCare is a non-profit health care organization based in St. Louis, Missouri. BJC includes two nationally recognized academic hospitals – Barnes–Jewish Hospital and St. Louis Children's Hospital, which are both affiliated with the Washington University School of Medicine.",
			"meta": {
				"refs": [
					"https://www.bjc.org/"
				]
			},
			"uuid": "fd9139ee-8fcc-11ea-bc55-0242ac130003",
			"value": "BJC HealthCare"
		},
		{
			"description": "Fresenius Medical Care AG & Co. KGaA provides kidney dialysis services through a network of 3,994 outpatient dialysis centers, serving 345,096 patients. The company primarily treats end-stage renal disease, which requires patients to undergo dialysis 3 times per week for the rest of their lives.",
			"meta": {
				"refs": [
					"https://www.fresenius.com/index"
				]
			},
			"uuid": "fd913d0e-8fcc-11ea-bc55-0242ac130003",
			"value": "Fresenius Medical Care AG & Co."
		},
		{
			"description": "About us. HEPACO is the premier environmental and emergency services company in the Eastern United States with coverage across 40+ regional offices. We specialize in emergency response, industrial services, remediation, marine services, and waste services.",
			"meta": {
				"refs": [
					"https://hepaco.com/"
				]
			},
			"uuid": "88161504-953a-11ea-bb37-0242ac130002",
			"value": "HEPACO, LLC"
		},
		{
			"description": "The Little Clinic provides high quality, affordable healthcare located in convenient retail settings. The Little Clinic diagnoses and treats minor illnesses for patients 12 months and up with care provided by board-certified nurse practitioners and (or) physician assistants.",
			"meta": {
				"refs": [
					"https://www.thelittleclinic.com/about-us"
				]
			},
			"uuid": "b0810b84-a043-11ea-bb37-0242ac130002",
			"value": "The Little Clinic (TLC)"
		},
		{
			"description": "CVHCare is a home health agency that provides high quality and cost-effective clinical care in the comfort of your home. Our company, Compassionate Visionary Healthcare, is devoted to delivering healthcare programs geared toward keeping seniors as healthy and as independent as possible at home.",
			"meta": {
				"refs": [
					"https://www.cvhcare.com/"
				]
			},
			"uuid": "b2545ba2-ab45-11ea-bb37-0242ac130002",
			"value": "Castro Valley Health Inc"
		},
		{
			"description": "University of Utah Health is the Mountain West's only academic health care system, combining excellence in patient care, the latest in medical research, and teaching to provide leading-edge medicine in a caring and personal setting. The system provides care for Utahns and residents of five surrounding states in a referral area encompassing more than 10 percent of the continental United States.",
			"meta": {
				"refs": [
					"https://healthcare.utah.edu/about/"
				]
			},
			"uuid": "b2545de6-ab45-11ea-bb37-0242ac130002",
			"value": "University of Utah Health"
		},
		{
			"description": "We work very closely with our allied community nursing, and health visiting teams. The Practice offers the services of, interpreters, stop smoking advisor, and other local services to help our patients with their health and well-being.",
			"meta": {
				"refs": [
					"https://www.hockleymedicalpractice.com/about-us/"
				]
			},
			"uuid": "b2545ee0-ab45-11ea-bb37-0242ac130002",
			"value": "Hockley Medical Practice"
		},
		{
			"description": "Babylon Health is a health service provider that provides remote consultations with doctors and health care professionals via text and video messaging through its mobile application.",
			"meta": {
				"refs": [
					"https://www.babylonhealth.com/"
				]
			},
			"uuid": "fb796f3c-b09c-11ea-b3de-0242ac130004",
			"value": "Babylon Health"
		},
		{
			"description": "University of Missouri Health Care is an academic health system located in Columbia, Missouri. It is owned by the University of Missouri System.",
			"meta": {
				"refs": [
					"https://www.muhealth.org/"
				]
			},
			"uuid": "fb79713a-b09c-11ea-b3de-0242ac130004",
			"value": "University of Missouri Health Care"
		},
		{
			"description": "Cano Health LLC. Cano Health, LLC provides health care services. The Hospital offers asthma and pain management, cardiovascular, hair treatment, dental, medicine, and primary care services. Cano Health serves patients in the State of Florida.",
			"meta": {
				"refs": [
					"https://canohealth.com/"
				]
			},
			"uuid": "fb7973b0-b09c-11ea-b3de-0242ac130004",
			"value": "Cano Health, LLC"
		},
		{
			"description": "Care New England is a non-profit health system, comprising several hospitals in Rhode Island. Founding members Butler Hospital, Kent Hospital & Women and Infants Hospital of Rhode Island formed CNE in February 1996.",
			"meta": {
				"refs": [
					"https://www.carenewengland.org/"
				]
			},
			"uuid": "7ebc03fa-b6e7-11ea-b3de-0242ac130004",
			"value": "Care New England"
		},
		{
			"description": "Crozer-Keystone Health System is a four-hospital health system based in Delaware County, Pennsylvania and serving Delaware County; northern Delaware and parts of western New Jersey.",
			"meta": {
				"refs": [
					"https://www.crozerkeystone.org/"
				]
			},
			"uuid": "7ebc0652-b6e7-11ea-b3de-0242ac130004",
			"value": "Crozer-Keystone Health System"
		},
		{
			"description": "Multi-service healthcare system located in Lufkin, TX.",
			"meta": {
				"refs": [
					"https://www.chistlukeshealthmemorial.org/centers/lufkin/"
				]
			},
			"uuid": "7ebc0756-b6e7-11ea-b3de-0242ac130004",
			"value": "CHI St. Luke’s Health-Memorial Lufkin"
		},
		{
			"description": "Life Healthcare Group, formerly Afrox Healthcare, is the second largest private hospital operator in South Africa, with 6,500 beds. It is owned by Brimstone Investment Corporation. It is also the largest black-owned hospital operator in South Africa.",
			"meta": {
				"refs": [
					"https://www.lifehealthcare.co.za/"
				]
			},
			"uuid": "40cdbe58-bbc4-11ea-b3de-0242ac130004",
			"value": "Life Healthcare Group"
		},
		{
			"description": "Turkish fertility based healthcare provider.",
			"meta": {
				"refs": [
					"https://egemenkoyuncu.com/"
				]
			},
			"uuid": "19035a7a-cce2-11ea-87d0-0242ac130003",
			"value": "Doctor Atadan Egemen KOYUNCU"
		},
		{
			"description": "You and your loved one deserve a place to support a healthy lifestyle, encourage wellness, and provide a comfortable environment until you get home. Whatever your needs, long or short- term care, special medical treatment, or simply a location close to family and friends, Lorien is the place for you.",
			"meta": {
				"refs": [
					"https://www.linkedin.com/company/lorien-health-services/about/"
				]
			},
			"uuid": "c0d68d3a-d336-11ea-87d0-0242ac130003",
			"value": "Lorien Health Services"
		},
		{
			"description": "We are more than just a health system. At Emanate Health, we are a catalyst for change and a beacon for healthier lives. When you come to any one of our locations, you'll be treated like family. And as part of our family, you can rest easy knowing we'll do whatever it takes to benefit your health and wellness.",
			"meta": {
				"refs": [
					"https://www.emanatehealth.org/about-us/"
				]
			},
			"uuid": "a9789986-d7ea-11ea-87d0-0242ac130003",
			"value": "Emanate Health"
		},
		{
			"description": "Summit Medical Associates PC is a medical practice company based out of 5653 Frist Blvd Ste 630, Hermitage, Tennessee, United States.",
			"meta": {
				"refs": [
					"https://www.linkedin.com/company/summit-medical-associates-pc/about/"
				]
			},
			"uuid": "ed99c7c0-e091-11ea-87d0-0242ac130003",
			"value": "Summit Medical Associates PC"
		},
		{
			"description": "Union Quay Medical Centre is a modern GP surgery in the heart of Cork City.  We offer a comprehensive range of GP services, as well as many specialist services.  Our medical services are provided by 4 GPs and 4 practice nurses.",
			"meta": {
				"refs": [
					"https://uqmc.ie/about"
				]
			},
			"uuid": "2eb0f074-e2ec-11ea-87d0-0242ac130003",
			"value": "Union Quay Medical Centre - Cork"
		},
		{
			"description": "Atrium Health, formerly Carolinas HealthCare System, is a not for profit hospital network which operates nearly 40 hospitals, six freestanding emergency departments, more than 30 urgent care centers, and medical practices in the American states of North Carolina, South Carolina and Georgia.",
			"meta": {
				"refs": [
					"https://atriumhealth.org/"
				]
			},
			"uuid": "669a0404-f367-11ea-adc1-0242ac120002",
			"value": "Atrium Health"
		},
		{
			"description": "NorthShore University HealthSystem is an integrated healthcare delivery system serving patients throughout the Chicago metropolitan area.",
			"meta": {
				"refs": [
					"https://www.northshore.org/"
				]
			},
			"uuid": "49c18a1e-f821-11ea-adc1-0242ac120002",
			"value": "NorthShore University HealthSystem"
		},
		{
			"description": "Inova Health System is a non-profit health organization based in Falls Church, Virginia, near Washington, D.C. The system is a network of hospitals, outpatient services, assisted living and long-term care facilities, and healthcare centers.",
			"meta": {
				"refs": [
					"https://www.inova.org/"
				]
			},
			"uuid": "49c18c44-f821-11ea-adc1-0242ac120002",
			"value": "Inova Health System"
		},
		{
			"description": "UnityPoint Health is a network of hospitals, clinics and home care services in Iowa, Illinois and Wisconsin. The system began in 1993, when Iowa Lutheran Hospital and Iowa Methodist Hospital in Des Moines merged, forming the state’s largest provider of hospital and related health services.",
			"meta": {
				"refs": [
					"https://www.unitypoint.org/"
				]
			},
			"uuid": "59572540-fda5-11ea-adc1-0242ac120002",
			"value": "UnityPoint Health"
		},
		{
			"description": "Geisinger is comprised of 13 hospital campuses, two research centers, a college of medicine and a nearly 600,000-member health plan serving more than three million residents in central, south-central and northeast Pennsylvania and beyond. We have approximately 26,500 employees, including over 1,700 employed physicians, all of whom share a commitment to quality healthcare.",
			"meta": {
				"refs": [
					"https://www.linkedin.com/company/geisinger"
				]
			},
			"uuid": "59572798-fda5-11ea-adc1-0242ac120002",
			"value": "Geisinger"
		},
		{
			"description": "Ambulance service based in Ohio.",
			"meta": {
				"refs": [
					"https://www.facebook.com/American-EMS-723057961066676/",
					"https://www.yellowpages.com/massillon-oh/stark-summit-ambulance"
				]
			},
			"uuid": "92cf3362-0322-11eb-adc1-0242ac120002",
			"value": "Stark Summit Ambulance"
		},
		{
			"description": "Century Specialty Script offers physicians and patients an efficient and effective way of managing chronic diseases.",
			"meta": {
				"refs": [
					"https://www.specialtyscript.com/"
				]
			},
			"uuid": "92cf35c4-0322-11eb-adc1-0242ac120002",
			"value": "Century Specialty Script, LLC"
		},
		{
			"description": "Nebraska Medicine is the most esteemed academic health system in the region, consisting of 809 licensed beds at its two hospitals, more than 1,000 physicians and 40 specialty and primary care clinics in Omaha and surrounding areas.",
			"meta": {
				"refs": [
					"https://www.linkedin.com/company/nebraskamed/"
				]
			},
			"uuid": "92cf36be-0322-11eb-adc1-0242ac120002",
			"value": "Nebraska Medicine"
		},
		{
			"description": "Universal Health Services is an American Fortune 500 company that provides hospital and healthcare services, based in King of Prussia, Pennsylvania. In 2019, its annual revenues were $11.37 billion.",
			"meta": {
				"refs": [
					"https://www.uhsinc.com/"
				]
			},
			"uuid": "9ddca5f8-08a1-11eb-adc1-0242ac120002",
			"value": "Universal Health Services"
		},
		{
			"description": "Founded in 1987 by Dr. Sheldon Elman, Medisys has grown from a regional clinic to Canada’s only national provider of preventive healthcare services. Together, we employ over 800 employees and work with more than 700 health professionals across the country to give each individual the time, care and personalized service they need. As of August 2018, Medisys has joined forces with TELUS Health, a leading provider of digital health solutions for healthcare practitioners, health authorities, insurers and employers. Together, we continue to chart a new course for workplace health and wellness services in support of Canadian healthcare transformation. At Medisys, we offer simplified healthcare services using a more human approach while leveraging TELUS Health’s leading-edge technology to optimize healthcare delivery in Canada.",
			"meta": {
				"refs": [
					"https://www.medisys.ca/en-ca/",
					"https://www.medisys.ca/en-ca/company/"
				]
			},
			"uuid": "9ddca81e-08a1-11eb-adc1-0242ac120002",
			"value": "The Medisys Health Group"
		},
		{
			"description": "Copeman Healthcare strives to help people achieve a greater quality of life through physical and psychological wellness. Our core services are medically supervised programs of therapeutic lifestyle change. What makes each program work is offering multidisciplinary medical expertise, and the time (on-time appointments) and attention (average 30-minute appointments) our clients need and deserve. Our first clinic opened in 2005, and we continue to demonstrate that our programs achieve our primary objective of making people’s lives better. We also reduce the demand for more costly medical interventions by preventing serious illness. In the long term, Copeman Healthcare hopes to help create low-cost, high-value programs for all people – harnessing technology and the talents and expertise of non-physician health workers. We now have four clinic locations in Western Canada (Calgary, Edmonton, Vancouver and North Vancouver) and care for over 12,000 clients. We plan to expand our services both regionally and nationally to deliver unparalleled levels of patient care and preventative healthcare services to even more Canadians.",
			"meta": {
				"refs": [
					"https://www.copemanhealthcare.com/",
					"https://www.copemanhealthcare.com/about-us"
				]
			},
			"uuid": "9ddcaa4e-08a1-11eb-adc1-0242ac120002",
			"value": "Copeman Healthcare"
		},
		{
			"description": "Ambulance service Hattiesburg, MS 39402.",
			"meta": {
				"refs": [
					"https://www.aaaambulance.net/"
				]
			},
			"uuid": "5f0843c2-0e1a-11eb-adc1-0242ac120002",
			"value": "AAA Ambulance Service"
		},
		{
			"description": "Hennepin County Medical Center is a Level I adult and pediatric trauma center and safety net hospital in Minneapolis, Minnesota, the county seat of Hennepin County.",
			"meta": {
				"refs": [
					"https://www.hennepinhealthcare.org/"
				]
			},
			"uuid": "e83468b2-1471-11eb-adc1-0242ac120002",
			"value": "Hennepin HealthCare"
		},
		{
			"description": "The GGD Amsterdam is the largest Medical and Health Service in the Netherlands, employs approximately 1200 people and has a wide range of activities in the field of public health. The working area of ​​the GGD Amsterdam includes the municipalities of Amsterdam, Aalsmeer, Amstelveen, Diemen, Ouder-Amstel and Uithoorn. The GGD Amsterdam is part of the Municipality of Amsterdam.",
			"meta": {
				"refs": [
					"https://www.linkedin.com/company/ggd-amsterdam/about/"
				]
			},
			"uuid": "e8346b1e-1471-11eb-adc1-0242ac120002",
			"value": "GGD Amsterdam"
		},
		{
			"description": "Since that initial hospital meeting held in 1881, Oswego Hospital has evolved into a healthcare system that includes many vital services and programs. Today, the Oswego Health system includes Oswego Hospital, a 164-bed facility offering acute medical, emergency, surgical, maternity and behavioral services; The Manor at Seneca Hill, providing 24-hour skilled nursing, rehabilitation services and an Adult Day Health Services Program; as well as Springside at Seneca Hill, which offers retirement living for independent seniors. In 2009, Oswego Health introduced urgent care services to Oswego County with the opening of the Fulton Medical Center, where residents can also have laboratory and medical imaging screenings conducted and businesses can take advantage of our occupational health department. A year later, the health system expanded once again when it unveiled the Central Square Medical Center, offering urgent care, lab and medical imaging services.",
			"meta": {
				"refs": [
					"https://www.linkedin.com/company/oswego-health/about/"
				]
			},
			"uuid": "e8346c22-1471-11eb-adc1-0242ac120002",
			"value": "Oswego Health"
		},
		{
			"description": "At DCHS, our mission is simple to improve health every day. We are seeking providers to join our group who will share in our mission and help to cultivate our vision to be the healthcare provider of choice for the communities we serve. Be an integral partner with one of the country's top-ranked, most respected healthcare systems. As a system, DCHS is dedicated to purchasing the most advanced technology, operating state-of-the-art facilities and introducing new and innovative models of care.",
			"meta": {
				"refs": [
					"https://www.linkedin.com/company/dickinson-county-healthcare-system/about/"
				]
			},
			"uuid": "a2a69132-1929-11eb-adc1-0242ac120002",
			"value": "Dickinson County Healthcare System"
		},
		{
			"description": "St. Lawrence Health System was established in December 2013 with the mission to improve health and to expand access through coordination and integration of services. The largest employer in St. Lawrence County, with 2,025 employees, St. Lawrence Health System has 195 full-time medical staff members and estimated annual net operating revenue of 300 million. Canton-Potsdam Hospital (CPH) is a not-for-profit community healthcare facility certified for 94 beds. Its core programs include emergency medicine, acute care, hospitalist medicine, critical care, and a Level III Trauma Center. It offers specialist care in over 25 different specialties, including a robust orthopedic surgery and sports medicine program, the Center for Cancer Care. Gouverneur Hospital (GH) is a not-for-profit critical access hospital founded in 2013 that is certified for 25 beds. Critical access is a federal designation that is available only to hospitals located in remote, rural regions, enabling these hospitals to be reimbursed at a higher rate because of the challenges they face in providing care in high-need areas. Massena Hospital (MH) is an acute care, 25-bed hospital providing inpatient medical, surgical, labor and delivery, and pediatric services in addition to emergency care.",
			"meta": {
				"refs": [
					"https://www.stlawrencehealthsystem.org/about"
				]
			},
			"uuid": "ab6b9a24-1ea1-11eb-adc1-0242ac120002",
			"value": "St. Lawrence Health System"
		},
		{
			"description": "The Scottish Ambulance Service is part of NHS Scotland, which serves all of Scotland's population., The Scottish Ambulance Service is governed by a special health board and is funded directly by the Health and Social Care Directorates of the Scottish Government.",
			"meta": {
				"refs": [
					"https://www.scottishambulance.com/"
				]
			},
			"uuid": "ab6b9ccc-1ea1-11eb-adc1-0242ac120002",
			"value": "The Scottish Ambulance Service"
		},
		{
			"description": "Our network was created in October 2011 when Fletcher Allen in Burlington, Vermont, and Central Vermont Medical Center in Berlin, Vermont, signed an affiliation agreement. In January 2013, New York partners Champlain Valley Physicians Hospital in Plattsburgh and Elizabethtown Community Hospital in Elizabethtown joined the affiliation. In 2016, Alice Hyde Medical Center joined. The network was originally called Fletcher Allen Partners.",
			"meta": {
				"refs": [
					"https://www.linkedin.com/company/the-university-of-vermont-health-network/about/"
				]
			},
			"uuid": "d3bb60cc-1ec4-11eb-adc1-0242ac120002",
			"value": "The University of Vermont Health Network"
		},
		{
			"description": "Elara Caring is one of the nation’s largest providers of home-based care, with a footprint in the Northeast, Midwest and South. Elara Caring brings together three award-winning organizations — Great Lakes Caring, National Home Health Care, and Jordan Health Services — into one transformational company. We provide the highest-quality comprehensive care continuum of personal care, skilled home health, hospice care and behavioral health. Our intimate understanding of our patients’ needs allows us to apply proprietary platforms to deliver proactive, customized care that improves quality of life and keeps patients in their homes.",
			"meta": {
				"refs": [
					"https://elara.com/about-us/"
				]
			},
			"uuid": "12d59918-7ebe-11eb-9439-0242ac130002",
			"value": "Elara Caring"
		},
		{
			"description": "Cochise Eye & Laser is committed to providing Southeastern Arizona with exceptional quality and compassionate eye care service. We provide a staff that is knowledgeable in the latest technology and educated in the areas of ophthalmology, optometry and opticianry services. We deliver affordable services to our patients in a pleasant environment and efficient manner. Cochise Eye & Laser is an active partner in maintaining the quality of life for all of our patients.",
			"meta": {
				"refs": [
					"http://www.cochiseeye.com/"
				]
			},
			"uuid": "12d59bca-7ebe-11eb-9439-0242ac130002",
			"value": "Cochise Eye and Laser"
		},
		{
			"description": "The physicians at the Altona Clinic are committed to the highest standards of quality and comprehensive and preventative healthcare. We work with families and individuals to promote overall physical and mental well-being. We also provide education for disease prevention and treatment of illnesses as well as manage chronic medical conditions. We treat acute conditions and establish relationships with specialists to provide care for those patients that are dealing with complex medical issues.",
			"meta": {
				"refs": [
					"http://www.altonaclinic.ca/",
					"http://www.altonaclinic.ca/services/"
				]
			},
			"uuid": "12d59db4-7ebe-11eb-9439-0242ac130002",
			"value": "Altona Clinic"
		},
		{
			"description": "Sandhills Medical Foundation, Inc. is a Health Center Program grantee under 42 U.S.C. 254b, and a deemed Public Health Service employer under 42 U.S.C. 233(g)-(n). This health center receives HHS funding and has Federal PHS deemed status with respect to certain health or health-related claims, including medical malpractice claims, for itself and its covered individuals.",
			"meta": {
				"refs": [
					"http://sandhillsmedical.org/"
				]
			},
			"uuid": "f90b335e-833f-11eb-8dcd-0242ac130003",
			"value": "Sandhills Medical Foundation, Inc."
		},
		{
			"description": "Hospital located at 1 Avenue Alexander Fleming, 64400 Oloron-Sainte-Marie, France.",
			"meta": {
				"refs": [
					"https://www.ch-oloron.fr/"
				]
			},
			"uuid": "f90b3430-833f-11eb-8dcd-0242ac130003",
			"value": "Centre Hospitalier General d’Oloron"
		},
		{
			"description": "St. Bernards Healthcare has four hospitals in its network – the flagship facility anchoring the Matthews Medical Mile in Jonesboro, St. Bernards Medical Center; St. Bernards CrossRidge Community Hospital in Wynne, St. Bernards Five Rivers Medical Center in Pocahontas, and a management relationship with Lawrence Memorial Hospital in Walnut Ridge.",
			"meta": {
				"refs": [
					"https://www.stbernards.info/about-us"
				]
			},
			"uuid": "a8a10bc8-872c-11eb-8dcd-0242ac130003",
			"value": "St. Bernards Total Life Healthcare, Inc"
		},
		{
			"description": "Founded in 2007 by a group of dedicated healthcare professionals, Preferred Home Care has rapidly earned the trust of doctors & social workers across New York, growing ― in just 10 years ― into one of the state’s largest licensed home care agencies.",
			"meta": {
				"refs": [
					"https://preferredhcny.com/whoweare/"
				]
			},
			"uuid": "a8a10e5c-872c-11eb-8dcd-0242ac130003",
			"value": "Preferred Home Care of New York"
		},
		{
			"description": "Polyclinic IP Pavlova sro is an accredited medical facility with many years of experience since 1993. We offer our patients comprehensive outpatient activities and specialized counseling in modernly equipped surgeries. Within the workplaces of the IP Pavlova Polyclinic, we offer interdisciplinary cooperation, which, if necessary for our patients, can be connected to a higher clinical workplace. The health services in our facility are covered by public insurance funds and we have contractual relations with all health insurance companies.",
			"meta": {
				"refs": [
					"http://www.poliklinikaippavlova.cz/"
				]
			},
			"uuid": "e165813a-8b11-11eb-8dcd-0242ac130003",
			"value": "Poliklinika IP Pavlova"
		},
		{
			"description": "Spectrum Health System, commonly known as Spectrum Health, is a not-for-profit, integrated, managed care health care organization based in West Michigan. Spectrum Health's subsidiaries include hospitals, treatment facilities, urgent care facilities, as well as physician practices that serve the western Michigan area.",
			"meta": {
				"refs": [
					"https://www.spectrumhealth.org/"
				]
			},
			"uuid": "e16583ce-8b11-11eb-8dcd-0242ac130003",
			"value": "Spectrum Health System"
		},
		{
			"description": "Lumino’s first breath of life was in 2002 when we were purchased by Abano Healthcare.  Back then we were called Geddes Dental – a group of 12 Auckland dental practices.  Geddes had a well known radio jingle but was quite a different business to the one we know today.  In 2005 the Lumino The Dentists brand was launched and Lumino’s successes continued to mount as we grew through acquisition by eight to ten practices a year.  During this time Lumino began to really carve out our footprint on the dental industry and on New Zealanders as a whole  We are all about providing amazing general and specialist dental care for our patients, attracting and selecting great quality clinicians and support teams, and providing our team with opportunities that they wouldn't easily get elsewhere in dentistry to train, to network, to share knowledge.",
			"meta": {
				"refs": [
					"https://www.linkedin.com/company/lumino-the-dentists/about/"
				]
			},
			"uuid": "e16584c8-8b11-11eb-8dcd-0242ac130003",
			"value": "Lumino The Dentists"
		},
		{
			"description": "Eastern Health is one of Melbourne's largest metropolitan public health services.  We provide a range of emergency, surgical, medical and general healthcare services, including maternity, palliative care, mental health, drug and alcohol, residential care, community health and statewide specialist services to people and communities that are diverse in culture, age, socio-economic status, population and healthcare needs.",
			"meta": {
				"refs": [
					"https://www.linkedin.com/company/easternhealthau/about/"
				]
			},
			"uuid": "63b6edca-8f33-11eb-8dcd-0242ac130003",
			"value": "Eastern Health, AU"
		},
		{
			"description": "When you start or continue your treatment at Mendelson Kornblum Physical Therapy, you are already a step ahead to achieving your rehabilitation goals. Our licensed physical therapists work hand-in-hand with the physicians, and have extensive experience in the field of orthopedics.",
			"meta": {
				"refs": [
					"https://www.linkedin.com/company/mendelson-kornblum-physical-therapy/about/"
				]
			},
			"uuid": "63b6f158-8f33-11eb-8dcd-0242ac130003",
			"value": "Mendelson Kornblum Rehabilitation"
		},
		{
			"description": "Headquartered in Nashville, Tennessee, the hospitals under the Haven Behavioral Healthcare banner provide inpatient psychiatric stabilization and treatment to adults experiencing acute symptoms of depression, anxiety, psychosis or other severe behavioral problems in locations across the country.",
			"meta": {
				"refs": [
					"https://www.linkedin.com/company/haven-behavioral-healthcare/about/"
				]
			},
			"uuid": "63b6f25c-8f33-11eb-8dcd-0242ac130003",
			"value": "Haven Behavioral Healthcare"
		},
		{
			"description": "SalusCare is a Fort Myers, Florida based not-for-profit mental health and substance abuse service provider incorporated in 2013 after the merger of Lee Mental Health Center and Southwest Florida Addiction Services (SWFAS). SalusCare has seven locations to serve you throughout Southwest Florida. Our fees are affordable and may be adjusted to the means of our patients based on household income. SalusCare accepts Medicaid, Medicare, Visa, MasterCard and some major health insurance providers. Please call us beforehand to verify that your insurance is accepted. SalusCare provides services for all regardless of disability or handicap. Accommodations will be provided upon request. All substance abuse programs and most mental health services are accredited by CARF International, an independent, nonprofit accreditor of health and human services.",
			"meta": {
				"refs": [
					"https://www.linkedin.com/company/saluscare-inc/about/"
				]
			},
			"uuid": "10706d82-962f-11eb-a8b3-0242ac130003",
			"value": "SalusCare, Inc."
		},
		{
			"description": "As part of Wake Forest Baptist Health, Lexington Medical Center has the resources of a nationally recognized academic medical center at its doorstep, enabling the facility to offer world-class health care here, close to home. Lexington Medical Center is a not-for-profit facility licensed with 94 acute care beds. The medical center's specialty services include orthopaedic surgery, general surgery, ENT, head and neck surgery and cancer care. Our outpatient expertise includes digestive health services, a state-of-the-art rehabilitation department, a diagnostic imaging center and wound care center.",
			"meta": {
				"refs": [
					"https://www.wakehealth.edu/Locations/Hospitals/Lexington-Medical-Center"
				]
			},
			"uuid": "10706fee-962f-11eb-a8b3-0242ac130003",
			"value": "Wake Forest Baptist Health - Lexington Medical Center"
		},
		{
			"description": "The Canterbury District Health board is transforming the delivery of health care services and is being recognised in New Zealand and overseas for our extraordinary journey.",
			"meta": {
				"refs": [
					"https://www.linkedin.com/company/canterbury-district-health-board/about/"
				]
			},
			"uuid": "107072f0-962f-11eb-a8b3-0242ac130003",
			"value": "Canterbury District Health Board"
		},
		{
			"description": "PERSONAL-TOUCH HOME CARE, began operations in 1974 and since then has grown into a national company. Each office is licensed by the State in which it operates and most of the offices are certified as home health agencies offering Medicare services. We provide skilled nursing, physical, occupational and speech therapy, medical social work and home health aides and companions. In addition to these traditional home health services, Personal-Touch has developed specialty programs, including mental health, pediatrics, maternal/child, hospice, rehabilitation, early intervention and early childhood education, dialysis, infusion and others.",
			"meta": {
				"refs": [
					"https://www.pthomecare.com/about"
				]
			},
			"uuid": "107073cc-962f-11eb-a8b3-0242ac130003",
			"value": "Personal Touch Holding Corp."
		},
		{
			"description": "Allina Health Apple Valley, Apple Valley, MN.",
			"meta": {
				"refs": [
					"https://www.applevalleymedicalcenter.com/?utm_source=gmb_auth"
				]
			},
			"uuid": "f50256b8-9c6a-11eb-a8b3-0242ac130003",
			"value": "Apple Valley Clinic"
		},
		{
			"description": "Pain management and other physicians in the San Francisco area, US.",
			"meta": {
				"refs": [
					"https://www.remedydocs.com/index.html"
				]
			},
			"uuid": "66869d4a-a2aa-11eb-bcbc-0242ac130002",
			"value": "Remedy Medical Group"
		},
		{
			"description": "Signify Health is a leading healthcare platform that leverages advanced analytics, technology, and nationwide healthcare provider networks to create and power value-based payment programs.",
			"meta": {
				"refs": [
					"https://www.linkedin.com/company/signifyhealth/about/"
				]
			},
			"uuid": "6686a4de-a2aa-11eb-bcbc-0242ac130002",
			"value": "Signify Health, LLC"
		},
		{
			"description": "AZIENDA UNITA' SANITARIA LOCALE UMBRIA 2 is located in TERNI, TERNI, Italy and is part of the Ambulatory Health Care Services Industry. AZIENDA UNITA' SANITARIA LOCALE UMBRIA 2 has 1,549 employees at this location and generates 190.12 million in sales (USD). There are 35,639 companies in the AZIENDA UNITA' SANITARIA LOCALE UMBRIA 2 corporate family.",
			"meta": {
				"refs": [
					"https://www.dnb.com/business-directory/company-profiles.azienda_unita_sanitaria_locale_umbria_2.600b62dddd8162136ba17ca1f1bb76ec.html"
				]
			},
			"uuid": "429a94b4-a6a0-11eb-bcbc-0242ac130002",
			"value": "Azienda Unita' Sanitaria Locale Umbria 2"
		},
		{
			"description": "The Council is one of the largest and most diverse employers in South West Wales employing over 9000 people providing services across a rural county to a population of around 180,500.",
			"meta": {
				"refs": [
					"https://www.linkedin.com/company/carmarthenshire-county-council/"
				]
			},
			"uuid": "429a96bc-a6a0-11eb-bcbc-0242ac130002",
			"value": "Carmarthenshire County Council"
		},
		{
			"description": "Planned Parenthood of Metropolitan Washington, DC (PPMW) was founded on the visionary idea that access to sexual and reproductive health care could transform people’s lives. For over 80 years, PPMW has provided high quality, supportive reproductive medical care for families in the DC metro area.",
			"meta": {
				"refs": [
					"https://www.plannedparenthood.org/planned-parenthood-metropolitan-washington-dc/who-we-are"
				]
			},
			"uuid": "429a97ac-a6a0-11eb-bcbc-0242ac130002",
			"value": "Planned Parenthood of Metropolitan Washington, DC (PPMW)"
		},
		{
			"description": "Peak Vista Community Health Centers is a non profit Federally Qualified Health Center (FQHC) dedicated to premier medical, dental, and behavioral health services for people of all ages. We provide primary care services to low-income, uninsured, underinsured, and working families facing other access barriers, within Colorado's Pikes Peak and East Central Plains Regions, at 26 health centers.",
			"meta": {
				"refs": [
					"https://www.linkedin.com/company/peak-vista-community-health-centers/about/"
				]
			},
			"uuid": "9403465c-a9d9-11eb-bcbc-0242ac130002",
			"value": "Peak Vista Community Health Centers"
		},
		{
			"description": "Every day in the community, we engage with people from all walks of life. We deliver skilled, evidence-based interventions for those facing adversity, and utilise our reach and vision to confront injustice. We are leaders in crisis response, the protection of vulnerable children, financial resilience and family wellbeing. We meet people where they are and walk alongside them to achieve positive change and growth. Right across Queensland, UnitingCare supports thousands of people living with a disability in redefining what’s possible in their lives. UnitingCare also provides aged care, disability supports, health care and crisis response in Queensland through Blue Care, Lifeline, The Wesley Hospital, St Andrew’s War Memorial Hospital, Buderim Private Hospital and St Stephen’s Hospital. And we provide community, aged care, disability and mental health support in the Northern Territory through ARRCS.",
			"meta": {
				"refs": [
					"https://www.unitingcareqld.com.au/about-us"
				]
			},
			"uuid": "94034940-a9d9-11eb-bcbc-0242ac130002",
			"value": "UnitingCare"
		},
		{
			"description": "St. John's Well Child and Family Center is an independent, 501(c)(3) network of community health centers that provides care to patients of all ages in South Los Angeles. Our mission is to eliminate health disparities and foster community well-being by providing and promoting the highest quality care in South Los Angeles.",
			"meta": {
				"refs": [
					"https://www.linkedin.com/company/st.-john's-well-child-&-family-center/about/"
				]
			},
			"uuid": "1815aec6-ae71-11eb-8529-0242ac130003",
			"value": "St. John’s Well Child and Family Center"
		},
		{
			"description": "Scripps Health is a nonprofit health care system based in San Diego, California. The system includes five hospitals and 19 outpatient facilities, and treats a half-million patients annually through 2,600 affiliated physicians. The system also includes clinical research and medical education programs.",
			"meta": {
				"refs": [
					"https://www.scripps.org/"
				]
			},
			"uuid": "1815b128-ae71-11eb-8529-0242ac130003",
			"value": "Scripps Health"
		},
		{
			"description": "Midwest Transplant Network (MTN) has been connecting lives in Kansas and western Missouri since 1973. As a federally certified, not-for-profit organ procurement organization (OPO), we work with organ, eye, and tissue donors, their families, hospitals, and other professional partners to extend legacies, provide hope and give life.",
			"meta": {
				"refs": [
					"https://mwtn.org/about-midwest-transplant-network/"
				]
			},
			"uuid": "1815b1fa-ae71-11eb-8529-0242ac130003",
			"value": "Midwest Transplant Network"
		},
		{
			"description": "Shortly after the turn of the 20th century, Dr. John Gifford, a popular local physician and the son of an East Randolph farmer, took up as a personal cause the creation of a hospital in his home town. In 1903, he purchased the Seldon Holman house on South Main Street – at the site of today’s Gifford Medical Center – and with two nurses established a private hospital. Two years later, discouraged by the high expenses and demands that came with running a small hospital alone, Dr. Gifford made plans to close his hospital. It was then that several local leaders, realizing the value of the hospital, stepped forward to create a corporation that would purchase the hospital and keep it open. Offering shares of capital stock to the community at 25 a piece, they easily raised the 7,500 that was needed to keep the doors open. The hospital became the Randolph Sanatorium, with Dr. Gifford as its medical director. Student nurses were a part of the hospital from the very beginning and in 1905 a two-year nursing program was established.",
			"meta": {
				"refs": [
					"https://giffordhealthcare.org/about-us/history/"
				]
			},
			"uuid": "c2d1c738-b708-11eb-8529-0242ac130003",
			"value": "Gifford Health Care"
		},
		{
			"description": "San Diego Family Care operates eight health centers in San Diego County. This includes 4 sites in Linda Vista, the Mid-City Community Clinic and the Mid-City Community Clinic, as well as two school based clinics inside elementary and middle schools. These high quality community health centers deliver 116,337 primary care medical, dental and mental health visits annually to all residents of San Diego County. All health centers have been nationally recognized by the National Council on Quality Assurance. Translation is available in multiple languages.",
			"meta": {
				"refs": [
					"https://sdfamilycare.org/about-sdfc/"
				]
			},
			"uuid": "c2d1ca3a-b708-11eb-8529-0242ac130003",
			"value": "San Diego Family Care"
		},
		{
			"description": "Founded in 1977, Health Center Partners of Southern California is a private, nonprofit association comprised of 16 community clinics and health centers providing primary care for San Diego, Imperial and Riverside counties. A premier consortium of primary health care organizations, Health Center Partners is an advocate for its members providing them with the voice and power to serve vulnerable populations.",
			"meta": {
				"refs": [
					"https://www.linkedin.com/company/health-center-partners-of-southern-california/about/"
				]
			},
			"uuid": "c2d1cb34-b708-11eb-8529-0242ac130003",
			"value": "Health Center Partners of Southern California"
		},
		{
			"description": "When it comes to selecting an eye-care specialist, seeing is believing. That’s why since 1919, generations of Iowans have trusted the medical and surgical experts at Wolfe Eye Clinic to provide a higher standard of eye-care excellence. At Wolfe Eye Clinic, some of the nation’s most highly skilled physicians utilize the latest technologies and treatments in LASIK, laser vision correction, age-related eye disease and childhood eye disorders. After all, your sight is our vision.",
			"meta": {
				"refs": [
					"https://www.linkedin.com/company/wolfe-eye-clinic/about/"
				]
			},
			"uuid": "c2d1cbfc-b708-11eb-8529-0242ac130003",
			"value": "Wolfe Eye Clinic"
		},
		{
			"description": "Mental health clinic in Edinburgh, Scotland",
			"meta": {
				"refs": [
					"https://edinburghpractice.com/"
				]
			},
			"uuid": "c2d1cd96-b708-11eb-8529-0242ac130003",
			"value": "The Edinburgh Practice"
		},
		{
			"description": "Orthopedic Associates of Dutchess County is a medical group practice located in Poughkeepsie, NY that specializes in Orthopedic Surgery and Physician Assistant (PA).",
			"meta": {
				"refs": [
					"http://www.orthoadc.com/about-us"
				]
			},
			"uuid": "a129f4ec-b709-11eb-8529-0242ac130003",
			"value": "Orthopedic Associates of Dutchess County"
		},
		{
			"description": "Faxton St. Luke’s Healthcare (FSLH) and St. Elizabeth Medical Center (SEMC) affiliated as the Mohawk Valley Health System (MVHS) effective March 2014. MVHS is governed by a single, 18-member board of directors, with nine members from FSLH’s board and nine from SEMC’s board. The system is operated by a single management team.",
			"meta": {
				"refs": [
					"https://www.linkedin.com/company/faxton-st-luke's-healthcare/about/"
				]
			},
			"uuid": "a129f8c0-b709-11eb-8529-0242ac130003",
			"value": "Faxton St. Luke's Healthcare"
		},
		{
			"description": "SAC Health System (SACHS) is a non-profit community healthcare corporation serving the Inland Empire. SACHS is committed to providing accessible whole person patient-centered health care to our communities and educating future health care professionals.  We empower our patients and their families to live vibrant and healthy lives through culturally responsive, exceptional care.",
			"meta": {
				"refs": [
					"https://www.linkedin.com/company/social-action-community-health-system/"
				]
			},
			"uuid": "5618d706-bc9b-11eb-8529-0242ac130003",
			"value": "SAC Health System"
		},
		{
			"description": "At Gastroenterology we take care of your digestive problems with extraordinary skill, extensive experience and the warmth and commitment you deserve. Founded in 1983 by Dr. Nat Bala as a one-man practice, it has grown to a nine-physician group, becoming the largest GI pratice in Houston today. Over the years, we have helped tens of thousands of patients and their doctors. Today, we are known for our skill, our comprehensive services and our availabiliy, responsiveness and efficiency.",
			"meta": {
				"refs": [
					"https://www.linkedin.com/company/gastroenterology-consultants-pa/about/"
				]
			},
			"uuid": "5618d936-bc9b-11eb-8529-0242ac130003",
			"value": "Gastroenterology Consultants, P.A."
		},
		{
			"description": "Forget everything you thought you knew about senior living. Vitality Senior Living, a new Nashville-based provider, has an entirely new vision. Featuring an innovative technology-focused approach to senior living, Vitality Senior Living has one goal in mind - To empower successful aging. How? By creating vibrant, engaging lifestyles that advance independence and contribute to the health and well-being of seniors.",
			"meta": {
				"refs": [
					"https://www.linkedin.com/company/vitality-senior-living/"
				]
			},
			"uuid": "5618dac6-bc9b-11eb-8529-0242ac130003",
			"value": "Vitality Senior Living LLC"
		},
		{
			"description": "A Salt Lake City, Utah based health care company that focuses on skilled nursing and rehabilitation, sub-acute, and assisted living acquisitions and operations, real estate investment into healthcare related properties, home health and hospice, and other geriatric related healthcare investment. We currently manage properties in nine states, and are rapidly growing.",
			"meta": {
				"refs": [
					"https://www.linkedin.com/company/eduro-healthcare-llc-/"
				]
			},
			"uuid": "11b014f8-bfb1-11eb-8529-0242ac130003",
			"value": "Eduro Healthcare, LLC"
		},
		{
			"description": "RMCHCS is an integrated delivery system providing care for Northwestern New Mexico and Eastern Arizona. We are proud to continue a history of healthcare dating back to the early 1900s. As a private, not-for-profit healthcare system, we are committed to improving the health and wellness of our community and the individuals for whom we care.",
			"meta": {
				"refs": [
					"https://www.linkedin.com/company/rehoboth-mckinley-christian-health-care-services/about/"
				]
			},
			"uuid": "11b01840-bfb1-11eb-8529-0242ac130003",
			"value": "Rehoboth McKinley Christian Health Care Services"
		},
		{
			"description": "About Health Plan of San Joaquin – HPSJ has been serving members enrolled in publicly-funded programs in the heart of the Central Valley since 1996. As a publicly sponsored, not-for-profit, Health Maintenance Organization (HMO), we have a contract with the California Department of Health Care Services (DHCS) to manage health care for Medi-Cal members.",
			"meta": {
				"refs": [
					"https://www.hpsj.com/about-us/"
				]
			},
			"uuid": "11b0194e-bfb1-11eb-8529-0242ac130003",
			"value": "Health Plan of San Joaquin"
		},
		{
			"description": "1727 E Bell Rd, Phoenix, AZ 85022",
			"meta": {
				"refs": [
					"http://spineanddisc.net/"
				]
			},
			"uuid": "2043caca-c789-11eb-b8bc-0242ac130003",
			"value": "Spine & Disc"
		},
		{
			"description": "Dutch mental health center, Riagg Rijnmond, cures IT budget woes and reduces their employee desktop budget by migrating from Citrix and Windows to a Linux and open source-based system hosted on NoMachine software.",
			"meta": {
				"refs": [
					"https://www.nomachine.com/Riagg-Rijnmond"
				]
			},
			"uuid": "2043cd7c-c789-11eb-b8bc-0242ac130003",
			"value": "Riagg Rijnmond"
		},
		{
			"description": "Beech Acres Parenting Center has served Greater Cincinnati children and families for more than 160 years. Our programs are based on the guiding principle that parents, and other dedi­cated adults filling that role, all want the best for their children. They all need education, support and guidance in raising their children to achieve their unique potential.",
			"meta": {
				"refs": [
					"https://www.linkedin.com/company/beech-acres-parenting-center"
				]
			},
			"uuid": "2de93d08-c7a8-11eb-b8bc-0242ac130003",
			"value": "Beech Acres Parenting Center"
		},
		{
			"description": "Glacier Medical Associates is a Medical Practice company located in 1111 Baker Ave, Whitefish, Montana, United States. Specializing in family medicine, internal medicine, pediatrics and geriatrics, Glacier Medical Associates offers 15 Providers, including 4 Family Nurse Practitioners and 1 Physician’s Assistant.",
			"meta": {
				"refs": [
					"https://www.linkedin.com/company/glacier-medical-associates/about/"
				]
			},
			"uuid": "e2ba931e-c9f4-11eb-b8bc-0242ac130003",
			"value": "Glacier Medical Associates"
		},
		{
			"description": "Radiological service provider. 79 Hudson St Suite 100, Hoboken, NJ 07030.",
			"meta": {
				"refs": [
					"https://hobokenradiology.com/"
				]
			},
			"uuid": "4e3bde6c-c9f6-11eb-b8bc-0242ac130003",
			"value": "Hoboken Radiology, LLC"
		},
		{
			"description": "20/20 Eye Care Network is a premier vision care administrator committed to providing comprehensive superior vision benefits throughout the state of Florida.  We have a complete network of vision care professionals including board certified optometrists and ophthalmologists to serve all of your vision care needs.  Comprised of independent, affiliated optical practices, we offer a statewide system of vision health benefits for a wide range of employers, as well as individuals and families. We also offer programs and reporting systems that provide our members with quality, cost-effective vision benefit programs and services.",
			"meta": {
				"refs": [
					"https://www.linkedin.com/company/20-20-eye-care-network/about/"
				]
			},
			"uuid": "4e3be092-c9f6-11eb-b8bc-0242ac130003",
			"value": "20/20 Eye Care Network"
		},
		{
			"description": "University of Florida Health is a medical network associated with the University of Florida. It includes two academic hospitals – UF Health Shands Hospital in Gainesville and UF Health Jacksonville – and several other hospitals and facilities in North Florida. It used to be known as Shands Healthcare and UF&Shands.",
			"meta": {
				"refs": [
					"https://ufhealth.org/"
				]
			},
			"uuid": "a6ab2e52-f842-11eb-9a03-0242ac130003",
			"value": "University of Florida Health"
		},
		{
			"description": "Care home with nursing",
			"meta": {
				"refs": [
					"https://carehomescentre.co.uk/prezentacja/pine-heath-nursing-home-,1235.html"
				]
			},
			"uuid": "a6ab2f42-f842-11eb-9a03-0242ac130003",
			"value": "Pine Heath Nursing Home"
		},
		{
			"description": "Hope Medical LLC is a medical group practice located in Stone Mountain, GA that specializes in Family Medicine and Nursing (Nurse Practitioner).",
			"meta": {
				"refs": [
					"https://www.healthgrades.com/group-directory/ga-georgia/stone-mountain/hope-medical-llc-oo76rxt"
				]
			},
			"uuid": "a6ab300a-f842-11eb-9a03-0242ac130003",
			"value": "Hope Medical LLC"
		},
		{
			"description": "DuPage Medical Group is the largest independent, multi-specialty physician group in the state, providing physician-directed healthcare focused on quality, efficiency and access. Our team is comprised of more than 700 experienced physicians and 4,000 dynamic individuals who work collaboratively to transform healthcare for the thousands of patients we serve each day. We seek candidates who can help fulfill our mission to enhance the well-being of the patients we serve by providing the highest quality medical care available.",
			"meta": {
				"refs": [
					"https://www.linkedin.com/company/dupage-medical-group/about/"
				]
			},
			"uuid": "ff492928-0b30-11ec-9a03-0242ac130003",
			"value": "DuPage Medical Group"
		},
		{
			"description": "We are a team of committed, compassionate orthopedic surgeons with a practice that has been building trust in our Hawaii community over decades. We’ve earned a reputation for getting our patients back into action faster and with less pain, which is why primary care physicians recommend Orthopedic Associates more than any other orthopedic practice. We believe in a stronger, healthier Hawaii. And we’re honored to say that Hawaii believes in us.",
			"meta": {
				"refs": [
					"https://oahawaii.com/about/"
				]
			},
			"uuid": "066bca80-94cf-11ec-b909-0242ac120002",
			"value": "Orthopedic Associates of Hawaii"
		},
		{
			"description": "All Access Ortho was founded by fellowship-trained orthopedic surgeons Dr. Darryl Kan and Dr. Gary Blum. The clinic is part of an orthopedic institute at Hale Pawa`a with access to a state-of-the-art surgical center and training facility, laboratory, pharmacy and imaging services. And we also have a second All Access Ortho location at The Gateway at Mililani Mauka.",
			"meta": {
				"refs": [
					"http://www.allaccessortho.com/about.html"
				]
			},
			"uuid": "066bcc6a-94cf-11ec-b909-0242ac120002",
			"value": "All Access Ortho"
		},
		{
			"description": "Minimally Invasive Surgery of Hawaii is a state-of-the-art ambulatory surgery center fully licensed by the Hawaii State Department of Health (DOH) and accredited by the Accreditation Association for Ambulatory Health Care (AAAHC).",
			"meta": {
				"refs": [
					"https://www.mishawaii.com/about/"
				]
			},
			"uuid": "066bcf26-94cf-11ec-b909-0242ac120002",
			"value": "Minimally Invasive Surgery (MIS) Hawaii Surgery Center"
		},
		{
			"description": "Douglas C Morrow Od Pc is a Medical Group that has only one practice medical office located in Auburn IN. There are 4 health care providers, specializing in Optometry, being reported as members of the medical group. Medical taxonomies which are covered by Douglas C Morrow Od Pc include Optometrist.",
			"meta": {
				"refs": [
					"https://www.healthcare4ppl.com/medical-group/indiana/auburn/douglas-c-morrow-od-pc-8022085091.html"
				]
			},
			"uuid": "18ede214-9afc-11ec-b909-0242ac120002",
			"value": "Dr. Douglas C. Morrow, OD"
		},
		{
			"description": "Crossroads Health offers a continuum of recovery and mental health programs and services for all people, at any age or stage of life. As a community-based 501(c)(3) nonprofit we are committed to providing trauma-informed, evidence-based services that change lives and impact communities! We desire to see all who seek support in living healthy, active, and productive lives.",
			"meta": {
				"refs": [
					"https://crossroadshealth.org/about-us/"
				]
			},
			"uuid": "9d8bbfaa-9fb6-11ec-b909-0242ac120002",
			"value": "Crossroads Health of Lake County"
		},
		{
			"description": "Mon Health is the parent company of Mon Health Medical Center, Mon Health Preston Memorial Hospital and Mon Health Stonewall Jackson Memorial Hospital. It was formed in 1982 to aid in strategic planning and to manage all of its affiliated entities under a common philosophy. Mon Health Medical Center is the flagship member of Mon Health.  The 164-bed hospital traces its roots back to the first hospital in Monongalia County in the early 1900s, and was officially established by an act of the Monongalia County Court in April 1943. The hospital has a strong commitment to providing personalized care and service with compassion and respect to North Central West Virginia, southwestern Pennsylvania, and the surrounding region. The more than 250 physicians with privileges at the hospital have a long history of dedication to the community and hospital, with a wide range of specialties including Cardiology, Cardiothoracic Surgery, Family Medicine, General Surgery, Neurology, Obstetrics, Gynecology, Oculofacial Surgery, Oncology, Orthopedics, Psychiatry & Behavioral Health and Rheumatology. We have one of the only Outpatient Surgery Centers in our region, offering same-day total joint replacements, cosmetics, and more. In addition, Mon Health Medical Center is proud to partner with and provide an established 25-bed long term acute care hospital - providing a critical link in the continuum of care for North Central West Virginia's sickest patients.",
			"meta": {
				"refs": [
					"https://www.monhealth.com/main/about-mon-health-system"
				]
			},
			"uuid": "9d8bc6a8-9fb6-11ec-b909-0242ac120002",
			"value": "Monongalia Health System, Inc."
		},
		{
			"description": "SingHealth is Singapore's largest group of healthcare institutions. The group was formed in 2000 and consists of four public hospitals, five national specialty centres and a network of eight polyclinics.",
			"meta": {
				"refs": [
					"http://www.singhealth.com.sg/"
				]
			},
			"uuid": "4d0fdf64-4b2e-11e9-8646-d663bd873d93",
			"value": "SingHealth"
		}
	],
	"version": 48
}
