{
  "category": "BLS-NAICS-518",
  "description": "Industries in the Data Processing, Hosting, and Related Services subsector group establishments that provide the infrastructure for hosting and/or data processing services.",
  "name": "BLS-NAICS-518",
  "source": "BLS Industries at a Glance",
  "type": "BLS-NAICS-518",
  "uuid": "fe92429c-47fd-11e9-b210-d663bd873d93",
  "values": [
	  {
      "description": "Test place holder",
      "meta": {
        "refs": [
          "https://www.bls.gov/iag/tgs/iag518.htm"
        ]
      },
      "uuid": "90c1fd32-48c2-11e9-8646-d663bd873d93",
      "value": "Test Data Processing, Hosting, and Related Services Value"
    },
	{
      "description": "Hostinger International, Ltd. is an employee-owned web hosting provider and Internet domain registrar. Established in 2004, Hostinger now has over 29 million users, collectively with its subsidiaries in 178 countries. The company uses cloud web hosting technology and provides hosting with MySQL, FTP and PHP.",
      "meta": {
        "refs": [
          "https://www.hostinger.com/"
        ]
      },
      "uuid": "96b91b22-cb2f-11e9-a32f-2a2ae2dbcce4",
      "value": "Hostinger"
    },
	{
      "description": "Minehut provides unlimited free server hosting for the Minecraft Community. Our Cloud Platform makes it easy to run a hit server.",
      "meta": {
        "refs": [
          "https://minehut.com/"
        ]
      },
      "uuid": "e30abe5a-e17c-11e9-81b4-2a2ae2dbcce4",
      "value": "Minehut"
    },
	{
      "description": "Twitter is a microblogging and social networking service on which users post and interact with messages known as tweets. Tweets were originally restricted to 140 characters, but on November 7, 2017, this limit was doubled to 280 for all languages except Chinese, Japanese, and Korean.",
      "meta": {
        "refs": [
          "https://twitter.com/?lang=en"
        ]
      },
      "uuid": "90c1fd32-48c2-11e9-8646-d663bd873d93",
      "value": "Twitter Inc."
    },
	{
      "description": "CenturyLink, Inc. is a technology company headquartered in Monroe, Louisiana that offers communications, network services, security, cloud solutions, voice and managed services. The company is a member of the S&P 500 index and the Fortune 500.",
      "meta": {
        "refs": [
          "https://www.centurylink.com/"
        ]
      },
      "uuid": "129021d4-0332-11ea-8d71-362b9e155667",
      "value": "CenturyLink, Inc."
    },
	{
      "description": "Network Solutions, LLC is an American-based technology company and a subsidiary of Web.com, the 4th largest .com domain name registrar with 6,722,545 registrations as of August 2018.",
      "meta": {
        "refs": [
          "https://www.networksolutions.com/"
        ]
      },
      "uuid": "129026e8-0332-11ea-8d71-362b9e155667",
      "value": "Network Solutions, LLC"
    },
	{
      "description": "Professional ASP.NET hosting with unlimited space and bandwidth and email.",
      "meta": {
        "refs": [
          "https://www.smarterasp.net/"
        ]
      },
      "uuid": "6dce43e8-096b-11ea-8d71-362b9e155667",
      "value": "SmarterASP.NET"
    },
	{
      "description": "UseNeXT is a service of Aviteo GmbH. Munich. A part of the Usenet family of data transfer technology and hosting services.",
      "meta": {
        "refs": [
          "https://www.usenext.com/"
        ]
      },
      "uuid": "1e4f78e2-8aed-11ea-bc55-0242ac130003",
      "value": "UseNeXT"
    },
	{
      "description": "GoDaddy Inc. is an American publicly traded Internet domain registrar and web hosting company headquartered in Scottsdale, Arizona and incorporated in Delaware. As of March 2019, GoDaddy has approximately 18.5 million customers and over 9,000 employees worldwide.",
      "meta": {
        "refs": [
          "https://www.godaddy.com/"
        ]
      },
      "uuid": "1ec40bc4-8fcc-11ea-bc55-0242ac130003",
      "value": "GoDaddy Inc."
    },
	{
      "description": "DigitalOcean, Inc. is an American cloud infrastructure provider headquartered in New York City with data centers worldwide. DigitalOcean provides developers cloud services that help to deploy and scale applications that run simultaneously on multiple computers.",
      "meta": {
        "refs": [
          "https://www.digitalocean.com/"
        ]
      },
      "uuid": "094a5bf0-9539-11ea-bb37-0242ac130002",
      "value": "DigitalOcean, Inc."
    },
	{
      "description": "Blackbaud is a cloud computing provider that serves the social good community — nonprofits, foundations, corporations, education institutions, healthcare organizations, religious organizations, and individual change agents.",
      "meta": {
        "refs": [
          "https://www.blackbaud.com/"
        ]
      },
      "uuid": "317d2d48-d335-11ea-87d0-0242ac130003",
      "value": "Blackbaud"
    },
	{
      "description": "Pivot Technology Solutions, Inc. identifies, acquires and integrates companies in the IT-sector. The Company offers multi-vendor sourcing and implementation solutions of its acquired companies to support, plan and provide for the IT needs of customers through data centre, storage and virtualization.",
      "meta": {
        "refs": [
          "https://www.pivotts.com/"
        ]
      },
      "uuid": "01baa364-d7e6-11ea-87d0-0242ac130003",
      "value": "Pivot Technology Solutions, Inc."
    },
	{
      "description": "Equinix, Inc. is an American multinational company headquartered in Redwood City, California, that specializes in Internet connection and data centers. The company is a leader in global colocation data center market share, with 205 data centers in 25 countries on five continents.",
      "meta": {
        "refs": [
          "https://www.equinix.com/"
        ]
      },
      "uuid": "c4e5eef8-f81f-11ea-adc1-0242ac120002",
      "value": "Equinix, Inc."
    },
	{
      "description": "Metaformers is a business transformation and cloud delivery technology organization helping our customers to strategically transform and modernize their organizations. Metaformers partners with our customers and their executive leaders, providing a transformation center of excellence to make the leaps needed to achieve the executive’s vision and true ROI from their process change and technology investment.",
      "meta": {
        "refs": [
          "https://www.linkedin.com/company/metaformers/about/"
        ]
      },
      "uuid": "31507c8a-1471-11eb-adc1-0242ac120002",
      "value": "Metaformers, Inc."
    },
	{
      "description": "Cloud Clusters Inc was founded in 2017 by the same team from Database Mart LLC(DBM), a privately held company in Texas. DBM provides VPS, and dedicated server hosting business to global clients from 2005 with superb customer services. Cloud Clusters Inc provides fully managed open-source application services on Kubernetes cloud. We have over 50 skilled staff supporting our business. Our goal is to use newly developed cutting-edge cloud technologies to deliver cost-effective and reliable services to our clients.",
      "meta": {
        "refs": [
          "https://www.cloudclusters.io/about-us"
        ]
      },
      "uuid": "26407860-2a6d-11eb-adc1-0242ac120002",
      "value": "Cloud Clusters Inc."
    },
	{
      "description": "Established in 1990, CompuCom Systems, Inc. provides end-to-end technology and consulting to create a true digital workplace for enterprise-level businesses. We help clients in all industries leverage the power of technology to maximize productivity and facilitate collaboration. As a single-source provider of end-to-end solutions, we’re uniquely qualified to serve companies that have a distributed workforce with employees in remote locations, some or all of the time. We supply hardware, devices, software, security and support to create a seamless experience, helping employees optimize their performance and organizations achieve their objectives.",
      "meta": {
        "refs": [
          "https://www.compucom.com/",
		  "https://www.compucom.com/about-compucom/"
        ]
      },
      "uuid": "6219395a-7ebc-11eb-9439-0242ac130002",
      "value": "CompuCom Systems Inc."
    },
	{
      "description": "Tech Mahindra is an Indian multinational technology company, providing information technology and business process outsourcing services. A subsidiary of the Mahindra Group, the company is headquartered in Pune and has its registered office in Mumbai.",
      "meta": {
        "refs": [
          "https://www.techmahindra.com/"
        ]
      },
      "uuid": "04001774-8b11-11eb-8dcd-0242ac130003",
      "value": "Tech Mahindra"
    },
	{
      "description": "Backblaze, Inc. is a cloud storage and data backup company, founded in 2007 by Gleb Budman, Billy Ng, Nilay Patel, Brian Wilson, Tim Nufire, Damon Uyeda, and Casey Jones. Its two main products are their B2 Cloud Storage and Computer Backup services, targeted at both business and personal markets.",
      "meta": {
        "refs": [
          "https://www.backblaze.com/"
        ]
      },
      "uuid": "948e35b6-962c-11eb-a8b3-0242ac130003",
      "value": "Backblaze, Inc."
    },
	{
      "description": "Managed-IT B.V. is located in Nieuwegein, UTRECHT, Netherlands and is part of the Information Technology Services Industry. Managed-IT B.V. has 23 employees at this location and generates 1.57 million in sales (USD). There are 2 companies in the Managed-IT B.V. corporate family.",
      "meta": {
        "refs": [
          "https://www.dnb.com/business-directory/company-profiles.managed-it_bv.90fc00473ab71204db60b6892610cc5a.html"
        ]
      },
      "uuid": "691b0cba-a9d7-11eb-bcbc-0242ac130002",
      "value": "Managed-IT B.V."
    },
	{
      "description": "Information Technology and Services, Sweden.",
      "meta": {
        "refs": [
          "https://www.linkedin.com/company/nordlo/about/"
        ]
      },
      "uuid": "691b0db4-a9d7-11eb-bcbc-0242ac130002",
      "value": "Nordlo Group"
    },
	{
      "description": "Cloud computing service provider, Switzerland.",
      "meta": {
        "refs": [
          "https://swiss.cloud/"
        ]
      },
      "uuid": "03191220-ae70-11eb-8529-0242ac130003",
      "value": "Swiss Cloud Computing AG"
    },
	{
      "description": "DDoS-GUARD is one of the leading companies on DDoS protection market. We have filtering nodes on huge interstate channels operated by leading communications companies. Geo-distributed filtering infranet, modern equipment and innovative software solutions allow us to provide the best service for our customers and filter more than 1.5Tb per second of attacking traffic.",
      "meta": {
        "refs": [
          "https://www.linkedin.com/company/ddos-guard/about/"
        ]
      },
      "uuid": "e2ba8f2c-c9f4-11eb-b8bc-0242ac130003",
      "value": "DDoS-Guard"
    },
	{
      "description": "Data center located in the country of New Zealand.",
      "meta": {
        "refs": [
          "https://www.itco.co.nz/"
        ]
      },
      "uuid": "e07f5274-9afa-11ec-b909-0242ac120002",
      "value": "iTCo Solutions Ltd"
    },
	{
      "description": "ZAP-Hosting GmbH & Co. KG has been offering game servers, dedicated servers, virtual servers, root servers, Teamspeak 3 servers, webspaces, domains, and MyMusicBots for Teamspeak 3.",
      "meta": {
        "refs": [
          "https://www.linkedin.com/company/zaphosting/about/"
        ]
      },
      "uuid": "08109bf2-b1d2-11ec-b909-0242ac120002",
      "value": "ZAP-Hosting GmbH & Co. KG"
    },
	{
      "description": "Hetzner Online is a professional web hosting provider and experienced data center operator. Since 1997 the company has provided private and business clients with high-performance hosting products as well as the necessary infrastructure for the efficient operation of websites. A combination of stable technology, attractive pricing and flexible support and services has enabled Hetzner Online to continuously strengthen its market position both nationally and internationally.",
      "meta": {
        "refs": [
          "https://www.linkedin.com/company/hetzner-online-ag/about/"
        ]
      },
      "uuid": "afb51252-bfd3-11ec-9d64-0242ac120002",
      "value": "Hetzner Online GmbH"
    },
	{
      "description": "iNSYNQ offers virtual desktops, giving you access to all of your critical business applications anytime and from anywhere.",
      "meta": {
        "refs": [
          "https://www.insynq.com/"
        ]
      },
      "uuid": "1ff2871e-aca6-11e9-a2a3-2a2ae2dbcce4",
      "value": "iNSYNQ"
    }
	  ],
	"version": 12
}
