{
  "category": "BLS-NAICS-454",
  "description": "Industries in the Nonstore Retailers subsector retail merchandise using methods, such as the broadcasting of infomercials, the broadcasting and publishing of direct-response advertising, the publishing of paper and electronic catalogs, door-to-door solicitation, in-home demonstration, selling from portable stalls and distribution through vending machines. Establishments in this subsector include mail-order houses, vending machine operators, home delivery sales, door-to-door sales, party plan sales, electronic shopping, and sales through portable stalls (e.g., street vendors, except food). Establishments engaged in the direct sale (i.e., nonstore) of products, such as home heating oil dealers and newspaper delivery service providers are included in this subsector.",
  "name": "BLS-NAICS-454",
  "source": "BLS Industries at a Glance",
  "type": "BLS-NAICS-454",
  "uuid": "0ab2668a-4838-11e9-8646-d663bd873d93",
  "values": [
	  {
      "description": "Test place holder",
      "meta": {
        "refs": [
          "https://www.bls.gov/iag/tgs/iag454.htm"
        ]
      },
      "uuid": "910d49cc-48f4-11e9-8646-d663bd873d93",
      "value": "Test Nonstore Retailers Value"
    },
	{
      "description": "Quidd Inc. Quidd, Inc. provides software solutions. The Company offers application which collects stickers, cards, and toys and figures from the shows and games. Quidd serves customers in the State of New York.",
      "meta": {
        "refs": [
          "https://quidd.co/"
        ]
      },
      "uuid": "6cef7bda-7fdc-11ea-bc55-0242ac130003",
      "value": "Quidd, Inc."
    },
	{
      "description": "Artsy is an online platform for discovering, buying and selling fine art. Artsy's search engine and database draw connections and map relationships among works of art.",
      "meta": {
        "refs": [
          "https://www.artsy.net/"
        ]
      },
      "uuid": "52aad624-a044-11ea-bb37-0242ac130002",
      "value": "Artsy"
    },
	{
      "description": "Online peer-to-peer gun exchange servicing the state of Utah.",
      "meta": {
        "refs": [
          "https://utahgunexchange.com/"
        ]
      },
      "uuid": "8743240c-e2e0-11ea-87d0-0242ac130003",
      "value": "Utah Gun Exchange"
    },
	{
      "description": "Shopify Inc. is a Canadian multinational e-commerce company headquartered in Ottawa, Ontario. It is also the name of its proprietary e-commerce platform for online stores and retail point-of-sale systems.",
      "meta": {
        "refs": [
          "https://www.shopify.com/"
        ]
      },
      "uuid": "423dc2f0-0323-11eb-adc1-0242ac120002",
      "value": "Shopify Inc."
    },
	{
      "description": "PromoFarma.com is the leading ecommerce marketplace selling health, beauty and personal care products, direct to consumers, from hundreds of independent pharmacies and other health stores in Spain and now expanding the service through several European countries like France and Italy.",
      "meta": {
        "refs": [
          "https://www.linkedin.com/company/promofarma/about/"
        ]
      },
      "uuid": "367e1722-1ea2-11eb-adc1-0242ac120002",
      "value": "Promofarma"
    },
	{
      "description": "At bigbasket.com we believe in being smart, quick and efficient, making your life as leisurely as possible. We understand that in this fast-paced world, time is always of the essence and hence want to make your grocery shopping easy and convenient so that no time is wasted in this process. So, no more hassle of going down to the grocery store and long queues for billing etc. You can browse through our varied range of products at bigbasket.com, order them and get them to be delivered at your own convenient time slot.",
      "meta": {
        "refs": [
          "https://www.linkedin.com/company/bigbasket-com/about/"
        ]
      },
      "uuid": "53cb3b04-243b-11eb-adc1-0242ac120002",
      "value": "bigbasket.com"
    },
	{
      "description": "Reverb is the largest online marketplace dedicated to buying and selling new, used, and vintage musical instruments.",
      "meta": {
        "refs": [
          "https://www.linkedin.com/company/reverbdotcom/about/"
        ]
      },
      "uuid": "c100befe-a9da-11eb-bcbc-0242ac130002",
      "value": "Reverb Online Marketplace"
    },
	{
      "description": "Glovo is a Spanish quick-commerce start-up founded in Barcelona in 2015. It is an on-demand courier service that purchases, picks up, and delivers products ordered through its mobile app. It aspires to be a multi-category lifestyle app with food delivery being the most popular offering. The company was founded by Oscar Pierre and Sacha Michaud.",
      "meta": {
        "refs": [
          "https://en.wikipedia.org/wiki/Glovo"
        ]
      },
      "uuid": "350ba156-b70a-11eb-8529-0242ac130003",
      "value": "Glovo"
    },
	{
      "description": "JD.com, Inc., also known as Jingdong and formerly called 360buy, is a Chinese e-commerce company headquartered in Beijing. It is one of the two massive B2C online retailers in China by transaction volume and revenue, a member of the Fortune Global 500 and a major competitor to Alibaba-run Tmall.",
      "meta": {
        "refs": [
          "https://corporate.jd.com/ourBusiness"
        ]
      },
      "uuid": "4e3be358-c9f6-11eb-b8bc-0242ac130003",
      "value": "JD.com, Inc."
    },
	{
      "description": "PEARL. GmbH is located in Buggingen, Baden-Wurttemberg, Germany and is part of the Electronics and Appliance Stores Industry. PEARL. GmbH has 400 employees at this location and generates 147.78 million in sales (USD). There are 3 companies in the PEARL. GmbH corporate family.",
      "meta": {
        "refs": [
          "https://www.dnb.com/business-directory/company-profiles.pearl_gmbh.7719c87cb2a8b6c43bb7bcd883547155.html"
        ]
      },
      "uuid": "a0bf5d96-f843-11eb-9a03-0242ac130003",
      "value": "PEARL. GmbH"
    },
	{
      "description": "Wanelo is a digital mall where people can discover and buy products on the internet. The site has over 12 million products posted by users from over 300,000 stores, including both large brands and independent sellers, like those found on Etsy.",
      "meta": {
        "refs": [
          "https://wanelo.com/"
        ]
      },
      "uuid": "2a26d1f8-e5ff-11e9-81b4-2a2ae2dbcce4",
      "value": "Wanelo"
    }
	  ],
	"version": 4
}
