{
  "category": "BLS-NAICS-31-33",
  "description": "The Manufacturing sector comprises establishments engaged in the mechanical, physical, or chemical transformation of materials, substances, or components into new products. Establishments in the Manufacturing sector are often described as plants, factories, or mills and characteristically use power-driven machines and materials-handling equipment. However, establishments that transform materials or substances into new products by hand or in the worker's home and those engaged in selling to the general public products made on the same premises from which they are sold, such as bakeries, candy stores, and custom tailors, may also be included in this sector. Manufacturing establishments may process materials or may contract with other establishments to process their materials for them. Both types of establishments are included in manufacturing.",
  "name": "BLS-NAICS-31-33",
  "source": "BLS Industries at a Glance",
  "type": "BLS-NAICS-31-33",
  "uuid": "223fec04-482a-11e9-8646-d663bd873d93",
  "values": [
	  {
      "description": "Test place holder",
      "meta": {
        "refs": [
          "https://www.bls.gov/iag/tgs/iag31-33.htm"
        ]
      },
      "uuid": "4cb39cc2-48ef-11e9-8646-d663bd873d93",
      "value": "Test Manufacturing Value"
    },
	{
      "description": "Honda Motor Company, Ltd. is a Japanese public multinational conglomerate corporation primarily known as a manufacturer of automobiles, motorcycles, and power equipment.",
      "meta": {
        "refs": [
          "https://www.honda.com/"
        ]
      },
      "uuid": "7527a462-b61a-11e9-a2a3-2a2ae2dbcce4",
      "value": "Honda Motor Company, Ltd."
    },
	{
      "description": "Amarin Corporation plc. is a rapidly growing, innovative pharmaceutical company focused on developing therapeutics to improve cardiovascular health.",
      "meta": {
        "refs": [
          "https://amarincorp.com/"
        ]
      },
      "uuid": "cfa8071a-bf84-11e9-9cb5-2a2ae2dbcce4",
      "value": "Amarin Corporation plc."
    },
	{
      "description": "DK-Lok tube fittings, instrument pipe & weld fittings, and valves are manufactured to stringent industry standards.",
      "meta": {
        "refs": [
          "https://www.dklokusa.com/"
        ]
      },
      "uuid": "6a06a838-d354-11e9-bb65-2a2ae2dbcce4",
      "value": "DK-Lok"
    },
	{
      "description": "Toyota Boshoku Corporation is a Japanese automotive component manufacturer. It is a member of the Toyota Group of companies. Toyota Boshoku Corporation entered the North American market via Toyota Boshoku America.",
      "meta": {
        "refs": [
          "http://www.toyota-boshoku.com/"
        ]
      },
      "uuid": "6a06aafe-d354-11e9-bb65-2a2ae2dbcce4",
      "value": "Toyota Boshoku Corporation"
    },
	{
      "description": "Subaru of Indiana Automotive, Inc. (SIA), a subsidiary of Fuji Heavy Industries, Ltd., is home of North American Subaru production.",
      "meta": {
        "refs": [
          "http://www.subaru-sia.com/"
        ]
      },
      "uuid": "9bf3e74a-e5fe-11e9-81b4-2a2ae2dbcce4",
      "value": "Subaru of Indiana Automotive, Inc."
    },
	{
      "description": "Heartland Automotive has become a significant piece of the Lafayette economic landscape. As a Tier 1 supplier to S.I.A. and a major employer for Lafayette, Heartland Automotive continues its important role in making Lafayette a great place to live and work. They are continually meeting the demands of their industry with upgrades to equipment, technology, hiring new employees, facilitating training and being a part of Lafayette’s effort to improve the quality of life for all of our citizens through community outreach and investments in quality of life initiatives. The City of Lafayette, Indiana appreciates Heartland Automotive’s commitment to their employees, the community, and helping us build a strong future.",
      "meta": {
        "refs": [
          "https://www.hauto.net/"
        ]
      },
      "uuid": "9bf3e9ca-e5fe-11e9-81b4-2a2ae2dbcce4",
      "value": "Heartland Automotive L.L.C."
    },
	{
      "description": "OnePlus Technology Co., Ltd., commonly referred to as OnePlus, is a Chinese smartphone manufacturer, which is based in Shenzhen, Guangdong. It was founded by Pete Lau and Carl Pei in December 2013. The company officially serves 34 countries and regions around the world as of July 2018.",
      "meta": {
        "refs": [
          "https://www.oneplus.com/"
        ]
      },
      "uuid": "f670865a-0fb2-11ea-8d71-362b9e155667",
      "value": "OnePlus Technology Co., Ltd."
    },
	{
      "description": "Shenzhen Smart Care Technology Ltd. Established in 2009, with 100+ engineers, also known as our brand SMA, we are skillful to offer one-top service include design, hardware, firmware, app, and Cloud server. Ee are independently research and develop Bluetooth, GPS, GSM, NB-IOT, LTE-M, Wireless Bluetooth smart watch and fitness tracker. All of our products are private design, with CE ROHS and other USA and Europe certification, SMA products and APP support more than 20 languages. We own 5 assembling line with 200K output per month, pass BSCI ISO9001, control our quality very well.",
      "meta": {
        "refs": [
          "https://www.smawatch.com/home"
        ]
      },
      "uuid": "7317c2a4-1535-11ea-8d71-362b9e155667",
      "value": "Shenzhen Smart Care Technology Ltd."
    },
	{
      "description": "British American Tobacco plc is a British multinational cigarette and tobacco manufacturing company headquartered in London, United Kingdom. It is the second-biggest cigarette maker in the world as of 2012. BAT has a market-leading position in over 50 countries and operations in around 180 countries.",
      "meta": {
        "refs": [
          "https://www.bat.com/"
        ]
      },
      "uuid": "2a4c4eb4-1b66-11ea-978f-2e728ce88125",
      "value": "British American Tobacco"
    },
	{
      "description": "Visser Precision is dedicated to providing high-caliber advanced manufacturing solutions to the aerospace, automotive, industrial and manufacturing industries by utilizing a full lineup of in-house capabilities, including design assistance, engineering, machining, fabrication, 3D printing, inspection and validation. Visser Precision is laser-focused on customer partnerships, prioritizing communication about timeliness and progress, as well as maintaining the highest level of transparency at all times.",
      "meta": {
        "refs": [
          "https://visserprecision.com/"
        ]
      },
      "uuid": "f1c5ca3c-6315-11ea-bc55-0242ac130003",
      "value": "Visser Precision Manufacturing"
    },
	{
      "description": "Communications & Power Industries (CPI) is a global manufacturer of electronic components and subsystems focused primarily on communications and defense markets.",
      "meta": {
        "refs": [
          "https://www.cpii.com/"
        ]
      },
      "uuid": "dbada1f6-67b2-11ea-bc55-0242ac130003",
      "value": "Communications & Power Industries (CPI)"
    },
	{
      "description": "Tandem Diabetes Care is a public US medical device manufacturer based in San Diego, CA. The company develops medical technologies for the treatment of diabetes and specifically insulin infusion therapy.",
      "meta": {
        "refs": [
          "https://www.tandemdiabetes.com/"
        ]
      },
      "uuid": "0864985c-6d22-11ea-bc55-0242ac130003",
      "value": "Tandem Diabetes Care, Inc."
    },
	{
      "description": "From landing a new client or passing your degree to sharing family history or celebrating a milestone - every document tells a story. We print documents for businesses, individuals, students, creatives & more. Whatever your story, we've got printing covered.",
      "meta": {
        "refs": [
          "https://doxzoo.com/"
        ]
      },
      "uuid": "87328530-710b-11ea-bc55-0242ac130003",
      "value": "Doxzoo"
    },
	{
      "description": "KIMCHUK INC is a fast paced, technologically advanced, high product mix electronics firm specializing in Electronic and Electromechanical Contract Manufacturing Services and Engineering Design who is committed to excellence.",
      "meta": {
        "refs": [
          "https://www.kimchuk.com/about/"
        ]
      },
      "uuid": "8f8c40e0-729b-11ea-bc55-0242ac130003",
      "value": "Kimchuck Inc."
    },
	{
      "description": "Founded in 1834 DESMI is one of Denmark’s oldest companies and we are proud of having a long history supplying good, reliable solutions, maintaining an innovative approach and utilising the opportunities on the global market.",
      "meta": {
        "refs": [
          "https://www.linkedin.com/company/desmi-as/about/"
        ]
      },
      "uuid": "13768b42-7d85-11ea-bc55-0242ac130003",
      "value": "DESMI"
    },
	{
      "description": "Tarkett S.A., known until 2008 as Sommer-Allibert S.A., is a French multinational corporation specialising in the production of floor and wall coverings. Headquartered in La Defense, near Paris, the present company was formed in October 1997 by the merging of two others: French Sommer-Allibert and German Tarkett AG. These companies were in turn formed by the combination of various smaller companies in Sweden, Germany and France. The name Tarkett came from a product developed by a Swedish predecessor.",
      "meta": {
        "refs": [
          "https://www.tarkett.com/"
        ]
      },
      "uuid": "1efcfef0-8fce-11ea-bc55-0242ac130003",
      "value": "Tarkett S.A."
    },
	{
      "description": "Mercedes-Benz is a German global automobile marque and a division of Daimler AG. Mercedes-Benz is known for luxury vehicles, vans, trucks, buses, coaches and ambulances. The headquarters is in Stuttgart, Baden-Württemberg. The name first appeared in 1926 under Daimler-Benz.",
      "meta": {
        "refs": [
          "https://www.mbusa.com/en/home"
        ]
      },
      "uuid": "7aa1392a-9acc-11ea-bb37-0242ac130002",
      "value": "Mercedes-Benz"
    },
	{
      "description": "About us. VT San Antonio Aerospace (VT SAA) is one of the leading aircraft MRO providers in North America. Industries Airlines/Aviation. Company size 1001-5000 employees. Headquarters San Antonio, Texas.",
      "meta": {
        "refs": [
          "http://vt-saa.com/"
        ]
      },
      "uuid": "59d69174-ab46-11ea-bb37-0242ac130002",
      "value": "VT San Antonio Aerospace (VT SAA)"
    },
	{
      "description": "BEML Limited, previously Bharat Earth Movers Limited, is an Indian Public Sector Undertaking, with headquarters in Bengaluru. It manufactures a variety of heavy equipment, such as that used for earth moving, transport and mining.",
      "meta": {
        "refs": [
          "https://www.bemlindia.in/"
        ]
      },
      "uuid": "59d6926e-ab46-11ea-bb37-0242ac130002",
      "value": "BEML Limited"
    },
	{
      "description": "H-Wave is a multi-functional electrical stimulation device intended to speed recovery, restore function, and manage chronic, acute or post-operative pain. It is a non-invasive drug-free alternative treatment option without harmful side effects. This unique technology stands apart from other electrotherapy modalities such as TENS, which only masks pain while the device is on, and traditional muscle stimulators; which use harsh signals and fatiguing muscle contractions to re-educate muscle. Whereas H-Wave is a rehabilitative device that focuses on addressing the root cause of symptoms and providing lasting, cumulative benefits; which patients can feel long after the device is taken off.",
      "meta": {
        "refs": [
          "https://www.linkedin.com/company/h-wave/about/"
        ]
      },
      "uuid": "689c6d82-b0a0-11ea-b3de-0242ac130004",
      "value": "Electronic Waveform Lab, Inc."
    },
	{
      "description": "Dresdner Kuhlanlagenbau GmbH provides HVAC products. The Company manufactures, distributes, and installs refrigeration and air-conditioning equipment.",
      "meta": {
        "refs": [
          "https://www.dka.eu/"
        ]
      },
      "uuid": "5206b2fe-d7eb-11ea-87d0-0242ac130003",
      "value": "Dresdner Kuhlanlagenbau GmbH"
    },
	{
      "description": "Intel Corporation is an American multinational corporation and technology company headquartered in Santa Clara, California, in Silicon Valley.",
      "meta": {
        "refs": [
          "https://www.intel.com/content/www/us/en/company-overview/company-overview.html"
        ]
      },
      "uuid": "ed99cbda-e091-11ea-87d0-0242ac130003",
      "value": "Intel Corporation"
    },
	{
      "description": "Konica Minolta, Inc. is a Japanese multinational technology company headquartered in Marunouchi, Chiyoda, Tokyo, with offices in 49 countries worldwide.",
      "meta": {
        "refs": [
          "https://www.konicaminolta.com/us-en/index.html"
        ]
      },
      "uuid": "87432312-e2e0-11ea-87d0-0242ac130003",
      "value": "Konica Minolta, Inc."
    },
	{
      "description": "IPG Photonics is a manufacturer of fiber lasers. IPG Photonics developed and commercialized optical fiber lasers, which are used in a variety of applications including materials processing, medical applications and telecommunications. IPG has manufacturing facilities in the United States, Germany, Russia and Italy.",
      "meta": {
        "refs": [
          "https://www.ipgphotonics.com/"
        ]
      },
      "uuid": "a838984c-fda5-11ea-adc1-0242ac120002",
      "value": "IPG Photonics"
    },
	{
      "description": "The Swatch Group Ltd is a Swiss manufacturer of watches and jewellery.",
      "meta": {
        "refs": [
          "https://www.swatchgroup.com/"
        ]
      },
      "uuid": "9ddcabf2-08a1-11eb-adc1-0242ac120002",
      "value": "The Swatch Group Ltd"
    },
	{
      "description": "DeRoyal Industries is a vertically integrated manufacturer and marketer of health care products. It is a privately held company with headquarters in Powell, Tennessee.",
      "meta": {
        "refs": [
          "http://www.deroyal.com/"
        ]
      },
      "uuid": "5f44f3d8-1ec5-11eb-adc1-0242ac120002",
      "value": "DeRoyal Industries"
    },
	{
      "description": "Compal Electronics is a Taiwanese original design manufacturer, handling the production of notebook computers, monitors, tablets and televisions for a variety of clients around the world, including Apple Inc., Acer, Lenovo, Dell, Toshiba, Hewlett-Packard and Fujitsu. It also licenses brands of its clients.",
      "meta": {
        "refs": [
          "https://www.compal.com/"
        ]
      },
      "uuid": "53cb38b6-243b-11eb-adc1-0242ac120002",
      "value": "Compal Electronics"
    },
	{
      "description": "The North Face is an American outdoor recreation product company. The North Face produces clothing, footwear, and outdoor equipment. Founded in 1966 to supply climbers, the company's logo draws inspiration from Half Dome, in Yosemite National Park.",
      "meta": {
        "refs": [
          "https://www.thenorthface.com/"
        ]
      },
      "uuid": "26407e0a-2a6d-11eb-adc1-0242ac120002",
      "value": "The North Face"
    },
	{
      "description": "Stratus Technologies, Inc. is a major producer of fault tolerant computer servers and software. The company was founded in 1980 as Stratus Computer, Inc. in Natick, Massachusetts, and adopted its present name in 1999. The current CEO and president is Dave Laurello.",
      "meta": {
        "refs": [
          "https://www.stratus.com/"
        ]
      },
      "uuid": "c70ec4c2-8f35-11eb-8dcd-0242ac130003",
      "value": "Stratus Technologies, Inc."
    },
	{
      "description": "Sierra Wireless is a Canadian multinational wireless communications equipment designer and manufacturer headquartered in Richmond, British Columbia, Canada. It also maintains offices and operations in California, Georgia, Brazil, Germany, Sweden, Korea, Japan, China, Taiwan, France, Guangdong and Hong Kong.",
      "meta": {
        "refs": [
          "https://www.sierrawireless.com/"
        ]
      },
      "uuid": "c70ec72e-8f35-11eb-8dcd-0242ac130003",
      "value": "Sierra Wireless"
    },
	{
      "description": "The PDI Group consists of manufacturing company PDI Ground Support Systems and logistics management and distribution company PDI Global.  The Group is a provider of high quality munitions trailers, running gear, weapons containers and modules, weapons adapters, munitions assembly conveyor systems, tow bars, specialized electronic equipment for smart weapons, steerable axle systems, and other ground support equipment used primarily by the United States Air Force, Navy, Army and over 40 allied air forces worldwide.",
      "meta": {
        "refs": [
          "https://www.linkedin.com/company/the-pdi-group/about/"
        ]
      },
      "uuid": "25ee425a-9630-11eb-a8b3-0242ac130003",
      "value": "The PDI Group"
    },
	{
      "description": "MND Group development, planning and the security of ski areas, recreational sites, access roads and other mountain infrastructure.",
      "meta": {
        "refs": [
          "https://www.crunchbase.com/organization/mnd-group"
        ]
      },
      "uuid": "25ee4660-9630-11eb-a8b3-0242ac130003",
      "value": "MND Group"
    },
	{
      "description": "Yposkesi is one of the largest Contract Development & Manufacturing Organizations (CDMO) in Europe for gene therapy viral vector manufacturing. A spin-off from the world-class gene therapy pioneer Genethon, Yposkesi capitalizes on more than 20 years’ expertise in biotherapeutic research.",
      "meta": {
        "refs": [
          "https://www.linkedin.com/company/yposkesi/about/"
        ]
      },
      "uuid": "25ee47a0-9630-11eb-a8b3-0242ac130003",
      "value": "Yposkesi"
    },
	{
      "description": "Ubiquiti Inc. is an American technology company founded in San Jose, California, in 2005. Now based in New York City, Ubiquiti manufactures and sells wireless data communication and wired products for enterprises and homes under multiple brand names.",
      "meta": {
        "refs": [
          "https://www.ui.com/"
        ]
      },
      "uuid": "f5025834-9c6a-11eb-a8b3-0242ac130003",
      "value": "Ubiquiti Inc."
    },
	{
      "description": "Griesser AG was founded in 1882. The company's line of business includes the manufacturing of drapery hardware, blinds, and shades.",
      "meta": {
        "refs": [
          "https://www.bloomberg.com/profile/company/1228898D:SW"
        ]
      },
      "uuid": "f1c056d6-a6a0-11eb-bcbc-0242ac130002",
      "value": "Griesser AG"
    },
	{
      "description": "The Dixie Group is a leading marketer of high-end residential and commercial broadloom carpet and rugs.",
      "meta": {
        "refs": [
          "https://www.linkedin.com/company/the-dixie-group/"
        ]
      },
      "uuid": "f1c0599c-a6a0-11eb-bcbc-0242ac130002",
      "value": "Dixie Group, Inc."
    },
	{
      "description": "Founded in 1941 in Tokyo, Japan, Hoya is a global med-tech company, and a leading supplier of innovative high-tech and medical products. Hoya is active in the fields of healthcare and information technology providing eyeglasses, medical endoscopes, intraocular lenses, optical lenses as well as key components for semiconductor devices, LCD panels and HDDs. With over 150 offices and subsidiaries worldwide, Hoya currently employs a multinational workforce of 37,000 people.",
      "meta": {
        "refs": [
          "https://www.hoya.co.jp/english/company/profile.html"
        ]
      },
      "uuid": "ed713e56-a9d9-11eb-bcbc-0242ac130002",
      "value": "Hoya Corporation"
    },
	{
      "description": "INVICTA GROUP is located in DONCHERY, ALSACE-CHAMPAGNE-ARDENNE-LORRAINE, France and is part of the Household Appliance Manufacturing Industry. INVICTA GROUP has 271 employees at this location and generates 32.34 million in sales (USD). There are 45 companies in the INVICTA GROUP corporate family.",
      "meta": {
        "refs": [
          "https://www.dnb.com/business-directory/company-profiles.invicta_group.94c8a744472b3dd46f5e19c70995921c.html"
        ]
      },
      "uuid": "09c1df00-ae73-11eb-8529-0242ac130003",
      "value": "Invicta Group"
    },
	{
      "description": "Manufacturing of athletic shoes.",
      "meta": {
        "refs": [
          "https://www.veja-store.com/"
        ]
      },
      "uuid": "350b9cd8-b70a-11eb-8529-0242ac130003",
      "value": "Veja Sneakers"
    },
	{
      "description": "Medtronic plc is an American-Irish registered medical device company that primarily operates in the United States. Medtronic has an operational and executive headquarters in Fridley, Minnesota in the US.",
      "meta": {
        "refs": [
          "https://www.medtronic.com/"
        ]
      },
      "uuid": "350ba052-b70a-11eb-8529-0242ac130003",
      "value": "Medtronic plc"
    },
	{
      "description": "The Yamabiko Corporation is a Japanese manufacturer of power tools formed with the September 2008 merger of the Kioritz and Shindaiwa corporations. The brands owned and distributed by Yamabiko are Kioritz, Shindaiwa and Echo. The Yamabiko Corporation is based in Ome, Japan.",
      "meta": {
        "refs": [
          "https://www.yamabiko-corp.co.jp/english/"
        ]
      },
      "uuid": "5618db98-bc9b-11eb-8529-0242ac130003",
      "value": "The Yamabiko Corporation"
    },
	{
      "description": "Herff Jones is an American company that manufactures and sells educational recognition and achievement products and motivational materials, and has been in continuous operation since 1920.",
      "meta": {
        "refs": [
          "https://www.herffjones.com/"
        ]
      },
      "uuid": "5618dc4c-bc9b-11eb-8529-0242ac130003",
      "value": "Herff Jones"
    },
	{
      "description": "Toshiba Corporation is a Japanese multinational conglomerate headquartered in Minato, Tokyo. Its diversified products and services include power, industrial and social infrastructure systems.",
      "meta": {
        "refs": [
          "https://www.toshiba.com/tai/"
        ]
      },
      "uuid": "5618dd1e-bc9b-11eb-8529-0242ac130003",
      "value": "Toshiba Corporation"
    },
	{
      "description": "Utility Trailer Manufacturing Company is an American truck semi-trailer and refrigerated van manufacturing company, based in the City of Industry, Los Angeles County, California.",
      "meta": {
        "refs": [
          "https://www.utilitytrailer.com/"
        ]
      },
      "uuid": "11b01ad4-bfb1-11eb-8529-0242ac130003",
      "value": "Utility Trailer Manufacturing Company"
    },
	{
      "description": "Livpure Pvt. Ltd. is a well-known Organisation in the Indian corporate world and is one of the most trusted manufacturers of water purifiers in India.",
      "meta": {
        "refs": [
          "https://www.linkedin.com/company/livpure-private-limited/about/"
        ]
      },
      "uuid": "e91806b8-c78a-11eb-b8bc-0242ac130003",
      "value": "Livpure Pvt. Ltd."
    },
	{
      "description": "Bose Corporation is an American manufacturing company that predominantly sells audio equipment. The company was established by Amar Bose in 1964 and is based in Framingham, Massachusetts.",
      "meta": {
        "refs": [
          "https://www.bose.com/en_us/index.html"
        ]
      },
      "uuid": "e91809b0-c78a-11eb-b8bc-0242ac130003",
      "value": "Bose Corporation"
    },
	{
      "description": "Manufacturer of building materials.",
      "meta": {
        "refs": [
          "https://www.linkedin.com/company/prb-produits-de-rev%C3%AAtement-du-b%C3%A2timent/about/"
        ]
      },
      "uuid": "a0bf5b48-f843-11eb-9a03-0242ac130003",
      "value": "PRB - Building Coating Products"
    },
	{
      "description": "Toyota Motor Corporation is a Japanese multinational automotive manufacturer headquartered in Toyota City, Aichi, Japan. In 2017, Toyota's corporate structure consisted of 364,445 employees worldwide and, as of September 2018, was the sixth-largest company in the world by revenue.",
      "meta": {
        "refs": [
          "https://www.toyota.com/"
        ]
      },
      "uuid": "fff40f38-5a0b-11e9-8647-d663bd873d93",
      "value": "Toyota"
    }
	  ],
	"version": 19
}
