{
  "category": "BLS-NAICS-31-33",
  "description": "The Manufacturing sector comprises establishments engaged in the mechanical, physical, or chemical transformation of materials, substances, or components into new products. Establishments in the Manufacturing sector are often described as plants, factories, or mills and characteristically use power-driven machines and materials-handling equipment. However, establishments that transform materials or substances into new products by hand or in the worker's home and those engaged in selling to the general public products made on the same premises from which they are sold, such as bakeries, candy stores, and custom tailors, may also be included in this sector. Manufacturing establishments may process materials or may contract with other establishments to process their materials for them. Both types of establishments are included in manufacturing.",
  "name": "BLS-NAICS-31-33",
  "source": "BLS Industries at a Glance",
  "type": "BLS-NAICS-31-33",
  "uuid": "223fec04-482a-11e9-8646-d663bd873d93",
  "values": [
	  {
      "description": "Test place holder",
      "meta": {
        "refs": [
          "https://www.bls.gov/iag/tgs/iag31-33.htm"
        ]
      },
      "uuid": "4cb39cc2-48ef-11e9-8646-d663bd873d93",
      "value": "Test Manufacturing Value"
    },
	{
      "description": "Honda Motor Company, Ltd. is a Japanese public multinational conglomerate corporation primarily known as a manufacturer of automobiles, motorcycles, and power equipment.",
      "meta": {
        "refs": [
          "https://www.honda.com/"
        ]
      },
      "uuid": "7527a462-b61a-11e9-a2a3-2a2ae2dbcce4",
      "value": "Honda Motor Company, Ltd."
    },
	{
      "description": "Amarin Corporation plc. is a rapidly growing, innovative pharmaceutical company focused on developing therapeutics to improve cardiovascular health.",
      "meta": {
        "refs": [
          "https://amarincorp.com/"
        ]
      },
      "uuid": "cfa8071a-bf84-11e9-9cb5-2a2ae2dbcce4",
      "value": "Amarin Corporation plc."
    },
	{
      "description": "DK-Lok tube fittings, instrument pipe & weld fittings, and valves are manufactured to stringent industry standards.",
      "meta": {
        "refs": [
          "https://www.dklokusa.com/"
        ]
      },
      "uuid": "6a06a838-d354-11e9-bb65-2a2ae2dbcce4",
      "value": "DK-Lok"
    },
	{
      "description": "Toyota Boshoku Corporation is a Japanese automotive component manufacturer. It is a member of the Toyota Group of companies. Toyota Boshoku Corporation entered the North American market via Toyota Boshoku America.",
      "meta": {
        "refs": [
          "http://www.toyota-boshoku.com/"
        ]
      },
      "uuid": "6a06aafe-d354-11e9-bb65-2a2ae2dbcce4",
      "value": "Toyota Boshoku Corporation"
    },
	{
      "description": "Subaru of Indiana Automotive, Inc. (SIA), a subsidiary of Fuji Heavy Industries, Ltd., is home of North American Subaru production.",
      "meta": {
        "refs": [
          "http://www.subaru-sia.com/"
        ]
      },
      "uuid": "9bf3e74a-e5fe-11e9-81b4-2a2ae2dbcce4",
      "value": "Subaru of Indiana Automotive, Inc."
    },
	{
      "description": "Heartland Automotive has become a significant piece of the Lafayette economic landscape. As a Tier 1 supplier to S.I.A. and a major employer for Lafayette, Heartland Automotive continues its important role in making Lafayette a great place to live and work. They are continually meeting the demands of their industry with upgrades to equipment, technology, hiring new employees, facilitating training and being a part of Lafayette’s effort to improve the quality of life for all of our citizens through community outreach and investments in quality of life initiatives. The City of Lafayette, Indiana appreciates Heartland Automotive’s commitment to their employees, the community, and helping us build a strong future.",
      "meta": {
        "refs": [
          "https://www.hauto.net/"
        ]
      },
      "uuid": "9bf3e9ca-e5fe-11e9-81b4-2a2ae2dbcce4",
      "value": "Heartland Automotive L.L.C."
    },
	{
      "description": "OnePlus Technology Co., Ltd., commonly referred to as OnePlus, is a Chinese smartphone manufacturer, which is based in Shenzhen, Guangdong. It was founded by Pete Lau and Carl Pei in December 2013. The company officially serves 34 countries and regions around the world as of July 2018.",
      "meta": {
        "refs": [
          "https://www.oneplus.com/"
        ]
      },
      "uuid": "f670865a-0fb2-11ea-8d71-362b9e155667",
      "value": "OnePlus Technology Co., Ltd."
    },
	{
      "description": "Shenzhen Smart Care Technology Ltd. Established in 2009, with 100+ engineers, also known as our brand SMA, we are skillful to offer one-top service include design, hardware, firmware, app, and Cloud server. Ee are independently research and develop Bluetooth, GPS, GSM, NB-IOT, LTE-M, Wireless Bluetooth smart watch and fitness tracker. All of our products are private design, with CE ROHS and other USA and Europe certification, SMA products and APP support more than 20 languages. We own 5 assembling line with 200K output per month, pass BSCI ISO9001, control our quality very well.",
      "meta": {
        "refs": [
          "https://www.smawatch.com/home"
        ]
      },
      "uuid": "7317c2a4-1535-11ea-8d71-362b9e155667",
      "value": "Shenzhen Smart Care Technology Ltd."
    },
	{
      "description": "British American Tobacco plc is a British multinational cigarette and tobacco manufacturing company headquartered in London, United Kingdom. It is the second-biggest cigarette maker in the world as of 2012. BAT has a market-leading position in over 50 countries and operations in around 180 countries.",
      "meta": {
        "refs": [
          "https://www.bat.com/"
        ]
      },
      "uuid": "2a4c4eb4-1b66-11ea-978f-2e728ce88125",
      "value": "British American Tobacco"
    },
	{
      "description": "Visser Precision is dedicated to providing high-caliber advanced manufacturing solutions to the aerospace, automotive, industrial and manufacturing industries by utilizing a full lineup of in-house capabilities, including design assistance, engineering, machining, fabrication, 3D printing, inspection and validation. Visser Precision is laser-focused on customer partnerships, prioritizing communication about timeliness and progress, as well as maintaining the highest level of transparency at all times.",
      "meta": {
        "refs": [
          "https://visserprecision.com/"
        ]
      },
      "uuid": "f1c5ca3c-6315-11ea-bc55-0242ac130003",
      "value": "Visser Precision Manufacturing"
    },
	{
      "description": "Communications & Power Industries (CPI) is a global manufacturer of electronic components and subsystems focused primarily on communications and defense markets.",
      "meta": {
        "refs": [
          "https://www.cpii.com/"
        ]
      },
      "uuid": "dbada1f6-67b2-11ea-bc55-0242ac130003",
      "value": "Communications & Power Industries (CPI)"
    },
	{
      "description": "Tandem Diabetes Care is a public US medical device manufacturer based in San Diego, CA. The company develops medical technologies for the treatment of diabetes and specifically insulin infusion therapy.",
      "meta": {
        "refs": [
          "https://www.tandemdiabetes.com/"
        ]
      },
      "uuid": "0864985c-6d22-11ea-bc55-0242ac130003",
      "value": "Tandem Diabetes Care, Inc."
    },
	{
      "description": "From landing a new client or passing your degree to sharing family history or celebrating a milestone - every document tells a story. We print documents for businesses, individuals, students, creatives & more. Whatever your story, we've got printing covered.",
      "meta": {
        "refs": [
          "https://doxzoo.com/"
        ]
      },
      "uuid": "87328530-710b-11ea-bc55-0242ac130003",
      "value": "Doxzoo"
    },
	{
      "description": "Toyota Motor Corporation is a Japanese multinational automotive manufacturer headquartered in Toyota City, Aichi, Japan. In 2017, Toyota's corporate structure consisted of 364,445 employees worldwide and, as of September 2018, was the sixth-largest company in the world by revenue.",
      "meta": {
        "refs": [
          "https://www.toyota.com/"
        ]
      },
      "uuid": "fff40f38-5a0b-11e9-8647-d663bd873d93",
      "value": "Toyota"
    }
	  ],
	"version": 13
}
