{
	"category": "BLS-NAICS-519",
	"description": "Industries in the Other Information Services subsector group establishments supplying information, storing and providing access to information, searching and retrieving information, operating Web sites that use search engines to allow for searching information on the Internet, or publishing and/or broadcasting content exclusively on the Internet. The main components of the subsector are news syndicates, libraries, archives, exclusive Internet publishing and/or broadcasting, and Web Search Portals.",
	"name": "BLS-NAICS-519",
	"source": "BLS Industries at a Glance",
	"type": "BLS-NAICS-519",
	"uuid": "0a1c1bac-4839-11e9-8646-d663bd873d93",
	"values": [{
			"description": "Test place holder",
			"meta": {
				"refs": [
					"https://www.bls.gov/iag/tgs/iag519.htm"
				]
			},
			"uuid": "c3e9d904-48f5-11e9-8646-d663bd873d93",
			"value": "Test Other Information Services Value"
		},
		{
			"description": "Kanopy is an on-demand streaming video platform for public libraries and universities that offers viewers a large collection of award-winning films and documentaries. Kanopy includes children's programming with its subdivision Kanopy Kids. All members have access to the children's videos section with their account.",
			"meta": {
				"refs": [
					"https://www.kanopy.com/"
				]
			},
			"uuid": "853185d4-50d1-11e9-8647-d663bd873d93",
			"value": "Kanopy"
		},
		{
			"description": "Cultura Colectiva is a Mexico-based digital media publisher. It publishes content designed to be shared over social media networks targeted at a Latin American audience. It currently ranks third among the most read digital native media publishers in Mexico and one of the 10 most important in Latin America.",
			"meta": {
				"refs": [
					"https://culturacolectiva.com/en/"
				]
			},
			"uuid": "fc252652-5bfb-11e9-8647-d663bd873d93",
			"value": "Cultura Colectiva"
		},
		{
			"description": "Johnson Newspaper is a publishing company that is based in Watertown, N.Y. The company publishes the Watertown Daily Times, as well as The Jefferson County Pennysaver. The Pennysaver is a classified advertisement publication that serves buyers and sellers in Jefferson County, N.Y. It is delivered to homes through the county on Mondays, via carriers and counter drops. Approximately 28,000 Pennysavers are circulated on a weekly basis. The Watertown Daily Times is a daily newspaper that serves Jefferson, Lewis and St. Lawrence counties in New York. The publication features local, national and international news coverage. The Watertown Daily also covers sports, business, entertainment and a variety of other news.",
			"meta": {
				"refs": [
					"http://www.watertowndailytimes.com/"
				]
			},
			"uuid": "fe9f9100-7105-11e9-a923-1681be663d3e",
			"value": "Johnson Newspaper Corp."
		},
		{
			"description": "Google LLC is an American multinational technology company that specializes in Internet-related services and products, which include online advertising technologies, search engine, cloud computing, software, and hardware. It is considered one of the Big Four technology companies, alongside Amazon, Apple and Facebook.",
			"meta": {
				"refs": [
					"https://en.wikipedia.org/wiki/Google"
				]
			},
			"uuid": "c8911c18-7e35-11e9-8f9e-2a86e4085a59",
			"value": "Google LLC"
		},
		{
			"description": "Flipboard is a news aggregator and social network aggregation company based in Palo Alto, California, with offices in New York, Vancouver and Bejiing. Its software, also known as Flipboard, was first released in July 2010.",
			"meta": {
				"refs": [
					"https://flipboard.com/"
				]
			},
			"uuid": "ffba0ce8-8224-11e9-bc42-526af7764f64",
			"value": "Flipboard, Inc."
		},
		{
			"description": "Leafly is the largest cannabis website in the world, with over 15 million monthly visitors and 40 million page views across its website and mobile applications. Leafly allows users to rate and review different strains of cannabis and cannabis dispensaries.",
			"meta": {
				"refs": [
					"https://www.leafly.com/"
				]
			},
			"uuid": "4dc4c766-eea9-11e9-81b4-2a2ae2dbcce4",
			"value": "Leafly"
		},
		{
			"description": "Online forum for the discussion of Global Positioning Systems (GPS)",
			"meta": {
				"refs": [
					"https://gpsunderground.com/forum"
				]
			},
			"uuid": "283065a8-0c88-11ea-8d71-362b9e155667",
			"value": "GPS Underground"
		},
		{
			"description": "Mixcloud is a British online music streaming service that allows for the listening and distribution of radio shows, DJ mixes and podcasts, which are crowdsourced by its registered users. Its notable users include Wired, Harvard Business School, TED Talks, and Barack Obama.",
			"meta": {
				"refs": [
					"https://www.mixcloud.com/"
				]
			},
			"uuid": "90735438-1537-11ea-8d71-362b9e155667",
			"value": "Mixcloud"
		},
		{
			"description": "Polish torrent site.",
			"meta": {
				"refs": [
					"http://agusiq-torrents.pl/"
				]
			},
			"uuid": "ddbe4dba-17b2-11ea-8d71-362b9e155667",
			"value": "AgusiQ-Torrents.pl"
		},
		{
			"description": "Anime-Planet is a site created by fans, for fans. Though millions of users a month use the site, we're staffed by only a small team of volunteers including the founder, developers, and content moderators.",
			"meta": {
				"refs": [
					"https://www.anime-planet.com/about"
				]
			},
			"uuid": "dbada3ea-67b2-11ea-bc55-0242ac130003",
			"value": "Anime-Planet"
		},
		{
			"description": "Sina Weibo is a Chinese microblogging website. Launched by Sina Corporation on 14 August 2009, it is one of the biggest social media platforms in China, with over 445 million monthly active users as of Q3 2018.",
			"meta": {
				"refs": [
					"https://www.weibo.com/login.php"
				]
			},
			"uuid": "b4f83948-6d22-11ea-bc55-0242ac130003",
			"value": "Sina Weibo"
		},
		{
			"description": "A Hispanic online community for the discussion of smartphones, tablets and wearables.",
			"meta": {
				"refs": [
					"https://www.htcmania.com/portal.php"
				]
			},
			"uuid": "4ff29846-7825-11ea-bc55-0242ac130003",
			"value": "HTC Mania"
		},
		{
			"description": "Wappalyzer uncovers the technologies used on websites.",
			"meta": {
				"refs": [
					"https://www.linkedin.com/company/wappalyzer/about/"
				]
			},
			"uuid": "4e05c4b8-83d8-11ea-bc55-0242ac130003",
			"value": "Wappalyzer"
		},
		{
			"description": "The Star Tribune is the largest newspaper in Minnesota. It originated as the Minneapolis Tribune in 1867 and the competing Minneapolis Daily Star in 1920. During the 1930s and 1940s Minneapolis's competing newspapers were consolidated, with the Tribune published in the morning and the Star in the evening.",
			"meta": {
				"refs": [
					"https://www.startribune.com/"
				]
			},
			"uuid": "b2bd503c-9acc-11ea-bb37-0242ac130002",
			"value": "The Star Tribune"
		},
		{
			"description": "The Nikkei, formally known as The Nihon Keizai Shimbun, is Nikkei, Inc.'s flagship publication and the world's largest financial newspaper, with a daily circulation exceeding three million. The Nikkei 225, a stock market index for the Tokyo Stock Exchange, has been calculated by the newspaper since 1950.",
			"meta": {
				"refs": [
					"https://asia.nikkei.com/"
				]
			},
			"uuid": "b2bd53c0-9acc-11ea-bb37-0242ac130002",
			"value": "Nikkei Inc."
		},
		{
			"description": "Wishbone is one of the fastest growing social platforms with apps in both the Apple and Google App Stores. Every day voters use Wishbone to complete the Daily Dozen to decide what are the hottest trending topics in pop culture. Who’s your favorite Kardashian, which Franco brother reigns supreme, and which fashion trend annoys you the most…These are all typical debates that get settled everyday by our super loyal fan base.",
			"meta": {
				"refs": [
					"https://www.linkedin.com/company/wishbone---compare-anything/about/"
				]
			},
			"uuid": "90fbf3fe-a044-11ea-bb37-0242ac130002",
			"value": "Wishbone"
		},
		{
			"description": "Online forum for discussions regarding computer hacking.",
			"meta": {
				"refs": [
					"https://www.nulled.ch/"
				]
			},
			"uuid": "90fbf5fc-a044-11ea-bb37-0242ac130002",
			"value": "Nulled.ch"
		},
		{
			"description": "LiveJournal, stylised as LiVEJOURNAL, is a Russian social networking service where users can keep a blog, journal or diary. American programmer Brad Fitzpatrick started LiveJournal on April 15, 1999, as a way of keeping his high school friends updated on his activities.",
			"meta": {
				"refs": [
					"https://www.livejournal.com/"
				]
			},
			"uuid": "90fbf6ec-a044-11ea-bb37-0242ac130002",
			"value": "LiveJournal"
		},
		{
			"description": "AFL Australian Rules Football forum, footy blogs and aussie rules community. Live game chat.",
			"meta": {
				"refs": [
					"https://www.bigfooty.com/"
				]
			},
			"uuid": "09804290-a5cb-11ea-bb37-0242ac130002",
			"value": "Bigfooty.com"
		},
		{
			"description": "e27 is a media company that provides reports and news about the asian technology startup industry. Singapore, Central Region, Singapore.",
			"meta": {
				"refs": [
					"https://www.crunchbase.com/organization/e27"
				]
			},
			"uuid": "772cdf88-bbc4-11ea-b3de-0242ac130004",
			"value": "e27"
		},
		{
			"description": "The Press Trust of India Ltd., commonly known as PTI, is the largest news agency in India.",
			"meta": {
				"refs": [
					"http://www.ptinews.com/"
				]
			},
			"uuid": "3d9a3482-192a-11eb-adc1-0242ac120002",
			"value": "The Press Trust of India Ltd. (PTI)"
		},
		{
			"description": "Our mission is to monitor, analyse and create actionable insight from complex communications across Asia Pacific. With powerful technology and clever people, we deliver what’s relevant when clients need it, driving decisions and opening possibilities. We employ over 1,000 of the best and brightest across 11 markets with a vision to empower clients to make great decisions, every time.",
			"meta": {
				"refs": [
					"https://www.linkedin.com/company/isentia/about/"
				]
			},
			"uuid": "197e556e-1ea3-11eb-adc1-0242ac120002",
			"value": "Isentia"
		},
		{
			"description": "The Star Tribune is the largest newspaper in Minnesota. It originated as the Minneapolis Tribune in 1867 and the competing Minneapolis Daily Star in 1920. During the 1930s and 1940s Minneapolis's competing newspapers were consolidated, with the Tribune published in the morning and the Star in the evening. They merged in 1982, creating the Star and Tribune, and it was renamed to Star Tribune in 1987. After a tumultuous period in which the newspaper was sold and re-sold and filed for bankruptcy protection in 2009, it was purchased by local businessman Glen Taylor in 2014.",
			"meta": {
				"refs": [
					"https://en.wikipedia.org/wiki/Star_Tribune"
				]
			},
			"uuid": "807e384a-1ec3-11eb-adc1-0242ac120002",
			"value": "Star Tribune Media Company, LLC"
		},
		{
			"description": "Wongnai, Thailand’s leading super-lifestyle platform, has connected people to good stuff through its comprehensive content and users’ reviews on restaurants, recipes, beauty, and travels.",
			"meta": {
				"refs": [
					"https://www.linkedin.com/company/wongnai.com/about/"
				]
			},
			"uuid": "53cb3bfe-243b-11eb-adc1-0242ac120002",
			"value": "Wongnai.com"
		},
		{
			"description": "Mashable is an American entertainment, culture, tech, science and social good digital media platform, news website and multi-platform media and entertainment company founded by Pete Cashmore in 2005.",
			"meta": {
				"refs": [
					"https://mashable.com/"
				]
			},
			"uuid": "9923f17c-2a6d-11eb-adc1-0242ac120002",
			"value": "Mashable"
		},
		{
			"description": "123RF is a stock content agency founded in 2005 which sells royalty-free images. In the past few years, 123RF expanded the portfolio to serve the growing market of the web-based content industry.",
			"meta": {
				"refs": [
					"https://www.123rf.com/"
				]
			},
			"uuid": "9923f3c0-2a6d-11eb-adc1-0242ac120002",
			"value": "123RF"
		},
		{
			"description": "Building upon a heritage which dates back to the 1870s, the Midland News Association is the publisher of some of the UK's most popular regional newspapers. With a portfolio including the Express & Star, Britain's biggest selling local title, as well as the Shropshire Star, local people know to turn to the MNA for news and information.",
			"meta": {
				"refs": [
					"https://www.linkedin.com/company/midland-news-association/about/"
				]
			},
			"uuid": "6f9c0dac-8b12-11eb-8dcd-0242ac130003",
			"value": "The Midlands News Association"
		},
		{
			"description": "Data collection company.",
			"meta": {
				"refs": [
					"https://www.zoominfo.com/c/the-rdc/425818941"
				]
			},
			"uuid": "821d3a08-9631-11eb-a8b3-0242ac130003",
			"value": "The RDC"
		},
		{
			"description": "The Nine Network (commonly known as Channel Nine or simply Nine) is a major Australian commercial free-to-air television network. The network's headquarters are located in Sydney and it is one of five main free-to-air networks in Australia. It is owned by Nine Entertainment Co.",
			"meta": {
				"refs": [
					"https://en.wikipedia.org/wiki/Nine_Network"
				]
			},
			"uuid": "821d3d14-9631-11eb-a8b3-0242ac130003",
			"value": "The Nine Network"
		},
		{
			"description": "Newsquest Media Group Ltd. is the second largest publisher of regional and local newspapers in the United Kingdom with 205 brands across the UK, publishing online and in print. It reaches 28 million visitors a month online and 6.5 million readers a week in print.",
			"meta": {
				"refs": [
					"http://www.newsquest.co.uk/"
				]
			},
			"uuid": "47f61cc0-4b36-11e9-8646-d663bd873d93",
			"value": "Newsquest"
		}
	],
	"version": 21
}
