{
	"category": "BLS-NAICS-515",
	"description": "Industries in the Broadcasting (except Internet) subsector include establishments that create content or acquire the right to distribute content and subsequently broadcast the content. The industry groups (Radio and Television Broadcasting and Cable and Other Subscription Programming) are based on differences in the methods of communication and the nature of services provided. The Radio and Television Broadcasting industry group includes establishments that operate broadcasting studios and facilities for over the air or satellite delivery of radio and television programs of entertainment, news, talk, and the like. These establishments are often engaged in the production and purchase of programs and generating revenues from the sale of air time to advertisers and from donations, subsidies, and/or the sale of programs. The Cable and Other Subscription Programming industry group includes establishments operating studios and facilities for the broadcasting of programs that are typically narrowcast in nature (limited format, such as news, sports, education, and youth-oriented programming) on a subscription or fee basis.",
	"name": "BLS-NAICS-515",
	"source": "BLS Industries at a Glance",
	"type": "BLS-NAICS-515",
	"uuid": "3aeb9b58-47f4-11e9-b210-d663bd873d93",
	"values": [{
			"description": "Test place holder",
			"meta": {
				"refs": [
					"https://www.bls.gov/iag/tgs/iag515.htm"
				]
			},
			"uuid": "3df8a6c6-48bf-11e9-8646-d663bd873d93",
			"value": "Test Broadcasting (except Internet) Value"
		},
		{
			"description": "Member-sponsored, Non-commercial FM community radio station serving the Tampa Bay area since 1979 with diverse programming, news and public affairs.",
			"meta": {
				"refs": [
					"https://www.wmnf.org/"
				]
			},
			"uuid": "bbb52ec0-abbd-11e9-a2a3-2a2ae2dbcce4",
			"value": "WMNF 88.5-FM"
		},
		{
			"description": "KHSU-FM is an NPR-member radio station, licensed to Arcata, California, United States. The station is currently owned by Humboldt State University. KHSU also holds licenses for additional stations running Radio Bilingüe and BBC World Service.",
			"meta": {
				"refs": [
					"https://www.khsu.org/"
				]
			},
			"uuid": "3df8a6c6-48bf-11e9-8646-d663bd873d93",
			"value": "KHSU"
		},
		{
			"description": "KNEO is a Christian radio station licensed to Neosho, Missouri, serving the Joplin, Missouri area. The station is owned by Sky High Broadcasting Corporation.",
			"meta": {
				"refs": [
					"https://www.kneo.org/"
				]
			},
			"uuid": "61ce6a02-bf81-11e9-9cb5-2a2ae2dbcce4",
			"value": "KNEO 91.7FM"
		},
		{
			"description": "M6 Group is a French media holding company. It was formed around the commercial television channel M6, launched on 1 March 1987.",
			"meta": {
				"refs": [
					"https://en.wikipedia.org/wiki/M6_Group"
				]
			},
			"uuid": "17d9bf94-f818-11e9-8f0b-362b9e155667",
			"value": "M6 Group"
		},
		{
			"description": "La Cadena SER is Spain premier radio network in terms of both seniority and audience share. The acronym SER stands for Sociedad Española de Radiodifusion. Cadena SER programmes – which encompass news, sport, talk, entertainment and culture – can be received throughout Spain.",
			"meta": {
				"refs": [
					"https://en.wikipedia.org/wiki/Cadena_SER"
				]
			},
			"uuid": "bd58eea8-0331-11ea-8d71-362b9e155667",
			"value": "La Cadena SER"
		},
		{
			"description": "Entercom Communications Corporation is a publicly traded American broadcasting company and radio network based in Philadelphia, Pennsylvania. Founded in 1968, it is the second largest radio company in the United States, owning 235 radio stations across 48 media markets.",
			"meta": {
				"refs": [
					"https://entercom.com/"
				]
			},
			"uuid": "a940dd04-686c-11ea-bc55-0242ac130003",
			"value": "Entercom Communications Corporation"
		},
		{
			"description": "We are the largest media and content group in the north and northeast of Brazil with operations in 4 areas Television 6 open TV stations affiliated with Rede Globo Radio 4 FM Internet radios 3 portals Events 1 event producer Together our business brings entertainment, culture and information to more than 12 million people. First and only group of open TV stations to cover the entire state.",
			"meta": {
				"refs": [
					"https://www.linkedin.com/company/redebahia/about/"
				]
			},
			"uuid": "f607420e-bc99-11eb-8529-0242ac130003",
			"value": "Rede Bahia"
		},
		{
			"description": "Launched in France in 1981. In Germany you can find us and listen to in Berlin, Hamburg, Munich, Nuremberg, Stuttgart, Saxony & Bremen as well as on www.Energy.De, mobile apps and your smart tv.",
			"meta": {
				"refs": [
					"https://www.linkedin.com/company/radio-energy-deutschland-/?originalSubdomain=de"
				]
			},
			"uuid": "f60744ac-bc99-11eb-8529-0242ac130003",
			"value": "Radio ENERGY (Germany)"
		},
		{
			"description": "Discovery Channel is an American pay television television network and flagship channel owned by Discovery, Inc., a publicly traded company run by CEO David Zaslav.",
			"meta": {
				"refs": [
					"https://www.discovery.com/"
				]
			},
			"uuid": "5621cc80-4b1e-11e9-8646-d663bd873d93",
			"value": "Discovery Channel"
		}
	],
	"version": 7
}
