{
  "category": "BLS-NAICS-81",
  "description": "The Other Services (except Public Administration) sector comprises establishments engaged in providing services not specifically provided for elsewhere in the classification system. Establishments in this sector are primarily engaged in activities, such as equipment and machinery repairing, promoting or administering religious activities, grantmaking, advocacy, and providing drycleaning and laundry services, personal care services, death care services, pet care services, photofinishing services, temporary parking services, and dating services.",
  "name": "BLS-NAICS-81",
  "source": "BLS Industries at a Glance",
  "type": "BLS-NAICS-81",
  "uuid": "54cc3182-4839-11e9-8646-d663bd873d93",
  "values": [
	  {
      "description": "Test place holder",
      "meta": {
        "refs": [
          "https://www.bls.gov/iag/tgs/iag81.htm"
        ]
      },
      "uuid": "3108f4d4-48f6-11e9-8646-d663bd873d93",
      "value": "Test Other Services (except Public Administration) Value"
    },
	{
      "description": "Secure paper shredding service provider.",
      "meta": {
        "refs": [
          "https://shredwise.com/"
        ]
      },
      "uuid": "df228ef4-4ff4-11e9-8647-d663bd873d93",
      "value": "ShredWise"
    },
	{
      "description": "A popular Chinese dating app for gay and queer women.",
      "meta": {
        "refs": [
          "https://itunes.apple.com/us/app/rela-lesbian-social-network/id1086944243?mt=8",
		  "https://www.databreaches.net/rela-a-chinese-lesbian-dating-app-exposed-5-million-user-profiles/"
        ]
      },
      "uuid": "a404d018-5240-11e9-8647-d663bd873d93",
      "value": "Rela"
    },
	{
      "description": "Heyyo is a free dating application, on which you can get to know new people and have more friends. Download now for free and get online.",
      "meta": {
        "refs": [
          "https://heyyodating.com"
        ]
      },
      "uuid": "6528e9fa-e17f-11e9-81b4-2a2ae2dbcce4",
      "value": "Heyyo Social and Dating App"
    },
	{
      "description": "Available in the Google App Store. Meet people in your city, country or around the world, date, flirt, make new contacts, new friends or share your hobbies and interests. On mobifriends you can find love and friendship with men or women. Meet new friends, flirt on the chat, find love online, find a stable partner and get new dates. Look for singles, single women and single men, search for your new boyfriend or new girlfriend, find your ideal partner and see their pictures and profiles.",
      "meta": {
        "refs": [
          "https://play.google.com/store/apps/details?id=com.mobifriends.app&hl=en_US"
        ]
      },
      "uuid": "0b18070a-953b-11ea-bb37-0242ac130002",
      "value": "Mobifriends"
    },
	{
      "description": "Car wash service chain in the state of Texas.",
      "meta": {
        "refs": [
          "https://washtub.com/about-us/"
        ]
      },
      "uuid": "f8b0ced0-2a6d-11eb-adc1-0242ac120002",
      "value": "The Wash Tub (Car Wash Service)"
    },
	{
      "description": "The Nationalist Party is a Christian-democratic, liberal conservative political party in Malta. It is one of two major contemporary political parties in Malta, along with the governing Labour Party. The Nationalist Party is currently in opposition to the Labour Party.",
      "meta": {
        "refs": [
          "https://en.wikipedia.org/wiki/Nationalist_Party_(Malta)"
        ]
      },
      "uuid": "f1c08822-a6a0-11eb-bcbc-0242ac130002",
      "value": "The Nationalist Party, Malta"
    },
	{
      "description": "The Australian Labor Party (New South Wales Branch), also known as NSW Labor and Country Labor in regional areas, is the New South Wales branch of the Australian Labor Party.",
      "meta": {
        "refs": [
          "https://www.nswlabor.org.au/"
        ]
      },
      "uuid": "350ba232-b70a-11eb-8529-0242ac130003",
      "value": "Australian Labor Party (New South Wales Branch)"
    },
	{
      "description": "Health and fitness service provider.  Mainly gyms that patrons can engage in fitness activies.",
      "meta": {
        "refs": [
          "https://www.vivagym.es/"
        ]
      },
      "uuid": "df2291d8-4ff4-11e9-8647-d663bd873d93",
      "value": "VivaGym"
    }
	  ],
	"version": 6
}
