{
  "category": "BLS-NAICS-336",
  "description": "Industries in the Transportation Equipment Manufacturing subsector produce equipment for transporting people and goods. Transportation equipment is a type of machinery. An entire subsector is devoted to this activity because of the significance of its economic size in all three North American countries. ^~Establishments in this subsector utilize production processes similar to those of other machinery manufacturing establishments - bending, forming, welding, machining, and assembling metal or plastic parts into components and finished products. However, the assembly of components and subassemblies and their further assembly into finished vehicles tends to be a more common production process in this subsector than in the Machinery Manufacturing subsector.",
  "name": "BLS-NAICS-336",
  "source": "BLS Industries at a Glance",
  "type": "BLS-NAICS-336",
  "uuid": "87c509a2-4851-11e9-8646-d663bd873d93",
  "values": [
	  {
      "description": "Test place holder",
      "meta": {
        "refs": [
          "https://www.bls.gov/iag/tgs/iag336.htm"
        ]
      },
      "uuid": "81d9c206-4902-11e9-8646-d663bd873d93",
      "value": "Test Transportation Equipment Manufacturing Value"
    },
	{
      "description": "Stadler Rail is a Swiss manufacturer of railway rolling stock, with an emphasis on regional train multiple units and trams. It is headquartered in Bussnang, Switzerland. Stadler Rail is also focused on niche products and is one of the last European manufacturers of rack railway rolling stock.",
      "meta": {
        "refs": [
          "https://www.stadlerrail.com/en/"
        ]
      },
      "uuid": "000c81a4-953d-11ea-bb37-0242ac130002",
      "value": "Stadler Rail"
    },
	{
      "description": "Fincantieri S.p.A. is an Italian shipbuilding company based in Trieste, Italy. Already the largest shipbuilder in Europe, after the acquisition of Vard in 2013 and 50% of STX France in 2018, Fincantieri group doubled in size to become the fourth largest in the world.",
      "meta": {
        "refs": [
          "https://www.fincantieri.com/en/"
        ]
      },
      "uuid": "1c527dce-ab49-11ea-bb37-0242ac130002",
      "value": "Fincantieri S.p.A."
    },
	{
      "description": "Vard Group AS is a designers and shipbuilders of specialized vessels. The Company develops power and automation systems, deck handling equipment, shipbuilding facilities, and vessel accommodation solutions, as well as offers design and engineering services.",
      "meta": {
        "refs": [
          "https://www.vard.com/"
        ]
      },
      "uuid": "935bf62c-b0a1-11ea-b3de-0242ac130004",
      "value": "Vard Group AS"
    },
	{
      "description": "ASCO Industries is a world leader in the design and manufacture of high lift devices, assemblies and major functional components for the aerospace industry.",
      "meta": {
        "refs": [
          "http://www.asco.be/"
        ]
      },
      "uuid": "f6d62ba8-95f1-11e9-bc42-526af7764f64",
      "value": "ASCO Industries"
    }
	  ],
	"version": 3
}
