{
  "category": "BLS-NAICS-713",
  "description": "Industries in the Amusement, Gambling, and Recreation Industries subsector (1) operate facilities where patrons can primarily engage in sports, recreation, amusement, or gambling activities and/or (2) provide other amusement and recreation services, such as supplying and servicing amusement devices in places of business operated by others; operating sports teams, clubs, or leagues engaged in playing games for recreational purposes; and guiding tours without using transportation equipment.",
  "name": "BLS-NAICS-713",
  "source": "BLS Industries at a Glance",
  "type": "BLS-NAICS-713",
  "uuid": "7c23a622-47f1-11e9-b210-d663bd873d93",
  "values": [
	  {
      "description": "Test place holder",
      "meta": {
        "refs": [
          "https://www.bls.gov/iag/tgs/iag713.htm"
        ]
      },
      "uuid": "04b148e8-48bd-11e9-8646-d663bd873d93",
      "value": "Test Amusement, Gambling, and Recreation Industries Value"
    },
	{
      "description": "Cache Creek Casino Resort is owned and operated by the Yocha Dehe Wintun Nation, located in Brooks, California. From its humble beginnings as a bingo hall in 1985, Cache Creek now features over 2,400 slot machines and 122 table games, including a 14-table Poker Room.",
      "meta": {
        "refs": [
          "https://www.linkedin.com/company/cache-creek-casino-resort/about/"
        ]
      },
      "uuid": "dabf8da6-08a0-11eb-adc1-0242ac120002",
      "value": "Cache Creek Casino Resort"
    },
	{
      "description": "Tivoli, also known as Tivoli Gardens, is an amusement park and pleasure garden in Copenhagen, Denmark. The park opened on 15 August 1843 and is the second-oldest operating amusement park in the world, after Dyrehavsbakken in nearby Klampenborg, also in Denmark.",
      "meta": {
        "refs": [
          "https://en.wikipedia.org/wiki/Tivoli_(Copenhagen)"
        ]
      },
      "uuid": "dcfa02cc-c675-11e9-aa8c-2a2ae2dbcce4",
      "value": "Tivoli Gardens"
    }
	  ],
	"version": 2
}
