{
  "category": "BLS-NAICS-335",
  "description": "Industries in the Electrical Equipment, Appliance, and Component Manufacturing subsector manufacture products that generate, distribute and use electrical power. Electric Lighting Equipment Manufacturing establishments produce electric lamp bulbs, lighting fixtures, and parts. Household Appliance Manufacturing establishments make both small and major electrical appliances and parts. Electrical Equipment Manufacturing establishments make goods, such as electric motors, generators, transformers, and switchgear apparatus. Other Electrical Equipment and Component Manufacturing establishments make devices for storing electrical power (e.g., batteries), for transmitting electricity (e.g., insulated wire), and wiring devices (e.g., electrical outlets, fuse boxes, and light switches).",
  "name": "BLS-NAICS-335",
  "source": "BLS Industries at a Glance",
  "type": "BLS-NAICS-335",
  "uuid": "d6fe2164-47fe-11e9-b210-d663bd873d93",
  "values": [
	  {
      "description": "Test place holder",
      "meta": {
        "refs": [
          "https://www.bls.gov/iag/tgs/iag335.htm"
        ]
      },
      "uuid": "4149ad26-48c3-11e9-8646-d663bd873d93",
      "value": "Test Electrical Equipment, Appliance, and Component Manufacturing Value"
    },
	{
      "description": "MaxLinear is an American hardware company. Founded in 2003, it provides highly integrated radio-frequency analog and mixed-signal semiconductor solutions for broadband communications applications. It is a New York Stock Exchange-traded company.",
      "meta": {
        "refs": [
          "https://www.maxlinear.com/"
        ]
      },
      "uuid": "92dd7ed8-b09b-11ea-b3de-0242ac130004",
      "value": "MaxLinear"
    },
	{
      "description": "LG Electronics Inc. is a South Korean multinational electronics company headquartered in Yeouido-dong, Seoul, South Korea.",
      "meta": {
        "refs": [
          "https://www.lg.com/us"
        ]
      },
      "uuid": "069e69c6-bbc4-11ea-b3de-0242ac130004",
      "value": "LG Electronics Inc."
    },
	{
      "description": "Forsee Power provides advanced lithium-ion battery systems for any mobility application. Whatever the charging infrastructure or hybrid mode, we have the right ENERGY and (or) POWER solution.",
      "meta": {
        "refs": [
          "https://www.forseepower.com/"
        ]
      },
      "uuid": "44dc9582-e090-11ea-87d0-0242ac130003",
      "value": "Forsee Power"
    },
	{
      "description": "Tower Semiconductor Ltd., Is an Israeli-American company that manufactures integrated circuits using specialty process technologies, including SiGe, BiCMOS, SOI, mixed-signal and RFCMOS, CMOS image sensors, non-imaging sensors, power management, and non-volatile memory as well as MEMS capabilities.",
      "meta": {
        "refs": [
          "https://towersemi.com/"
        ]
      },
      "uuid": "2ba42a74-f820-11ea-adc1-0242ac120002",
      "value": "Tower Semiconductor Ltd. (TSEM)"
    },
	{
      "description": "SK hynix Inc. is a South Korean memory semiconductor supplier of dynamic random-access memory chips and flash memory chips. Hynix is the world's second-largest memory chipmaker and the world's 3rd-largest semiconductor company.",
      "meta": {
        "refs": [
          "https://www.skhynix.com/"
        ]
      },
      "uuid": "2ba42d08-f820-11ea-adc1-0242ac120002",
      "value": "SK hynix Inc."
    },
	{
      "description": "Razer Inc. is a Singaporean–American multinational technology company that designs, develops, and sells consumer electronics, financial services, and gaming hardware. Founded by Min-Liang Tan and Robert Krakoff, the company is headquartered in Queenstown, Singapore and Irvine, California, United States.",
      "meta": {
        "refs": [
          "https://www.razer.com/"
        ]
      },
      "uuid": "2ba42e20-f820-11ea-adc1-0242ac120002",
      "value": "Razer Inc."
    },
	{
      "description": "The Yaskawa Electric Corporation is a Japanese manufacturer of servos, motion controllers, AC motor drives, switches and industrial robots. Their Motoman robots are heavy duty industrial robots used in welding, packaging, assembly, coating, cutting, material handling and general automation.",
      "meta": {
        "refs": [
          "https://www.yaskawa-global.com/"
        ]
      },
      "uuid": "7c01d898-fda4-11ea-adc1-0242ac120002",
      "value": "The Yaskawa Electric Corporation"
    },
	{
      "description": "Voxx International is an American consumer electronics company founded as Audiovox Corporation in 1960, and renamed Voxx in 2012. It is headquartered in Orlando, Florida.",
      "meta": {
        "refs": [
          "https://www.voxxintl.com/"
        ]
      },
      "uuid": "dabf90c6-08a0-11eb-adc1-0242ac120002",
      "value": "Voxx International"
    },
	{
      "description": "PEI-Genesis is a world leader in the distribution, manufacture and integration of electronic connectors and cable assemblies with a highly evolved system for mass customized solutions. We have a terrific family culture and are a very successful privately held world leader in a niche industry. Our sales offices are located throughout the Americas, Europe and Asia. PEI-Genesis has been in business since 1946 and we have grown consistently year after year. This is a wonderful place to work and we need talented people to join us on our journey.",
      "meta": {
        "refs": [
          "https://www.linkedin.com/company/pei-genesis/about/"
        ]
      },
      "uuid": "d0d3aed2-833c-11eb-8dcd-0242ac130003",
      "value": "PEI-Genesis, Inc."
    },
	{
      "description": "Acer Inc. is a Taiwanese multinational hardware and electronics corporation specializing in advanced electronics technology, headquartered in Xizhi, New Taipei City.",
      "meta": {
        "refs": [
          "https://www.acer.com/ac/en/US/content/home"
        ]
      },
      "uuid": "7d82cd08-8b11-11eb-8dcd-0242ac130003",
      "value": "Acer Inc."
    },
	{
      "description": "Asteelflash Group is a French multinational electronics contract manufacturing company specializing in printed circuit board assembly and also offering design and aftermarket services.",
      "meta": {
        "refs": [
          "https://www.asteelflash.com/"
        ]
      },
      "uuid": "f50255dc-9c6a-11eb-a8b3-0242ac130003",
      "value": "Asteelflash Group"
    },
	{
      "description": "ExaGrid Systems, Inc. is a disk-based backup hardware company that was founded in 2002 and is headquartered in Westborough, Massachusetts, with several satellite offices throughout the United States, Europe and Asia.",
      "meta": {
        "refs": [
          "https://www.exagrid.com/"
        ]
      },
      "uuid": "e2ba9012-c9f4-11eb-b8bc-0242ac130003",
      "value": "ExaGrid Systems, Inc."
    },
	{
      "description": "General Electric Company is an American multinational conglomerate incorporated in New York City and headquartered in Boston.",
      "meta": {
        "refs": [
          "https://www.ge.com/"
        ]
      },
      "uuid": "b83a052a-6eab-11ea-bc55-0242ac130003",
      "value": "General Electric Company"
    }
	  ],
	"version": 3
}
