{
  "category": "BLS-NAICS-21",
  "description": "The Mining sector comprises establishments that extract naturally occurring mineral solids, such as coal and ores; liquid minerals, such as crude petroleum; and gases, such as natural gas. The term mining is used in the broad sense to include quarrying, well operations, beneficiating (e.g., crushing, screening, washing, and flotation), and other preparation customarily performed at the mine site, or as a part of mining activity.",
  "name": "BLS-NAICS-21",
  "source": "BLS Industries at a Glance",
  "type": "BLS-NAICS-21",
  "uuid": "b865df08-482b-11e9-8646-d663bd873d93",
  "values": [
	  {
      "description": "Test place holder",
      "meta": {
        "refs": [
          "https://www.bls.gov/iag/tgs/iag21.htm"
        ]
      },
      "uuid": "c021fb9e-48f0-11e9-8646-d663bd873d93",
      "value": "Test Mining, Quarrying, and Oil and Gas Extraction Value"
    },
	{
      "description": "EVRAZ plc (Russian - ЕВРАЗ) is a multinational vertically integrated steel making and mining company with headquarters in London, United Kingdom. It has operations mainly in Russia, but also in Ukraine, Kazakhstan, Italy, Czech Republic, the United States, Canada and South Africa. It is listed on the London Stock Exchange and is a constituent of the FTSE 100 Index. As of 2015, the ultimate beneficial owners were Roman Abramovich (31.03%), chairman Alexander Abramov (21.59%) and CEO Aleksandr Frolov (10.78%).",
      "meta": {
        "refs": [
          "https://en.wikipedia.org/wiki/Evraz"
        ]
      },
      "uuid": "c86a0c40-686d-11ea-bc55-0242ac130003",
      "value": "EVRAZ plc"
    },
	{
      "description": "Groupement Berkine is a petroleum joint venture between the Algerian Sonatrach and the American Anadarko Petroleum Corporation through its subsidiary Anadarko Algeria Company LLC.",
      "meta": {
        "refs": [
          "https://www.linkedin.com/company/groupement-berkine/about/"
        ]
      },
      "uuid": "4ff29760-7825-11ea-bc55-0242ac130003",
      "value": "Groupement Berkine"
    },
	{
      "description": "PetroBangla is a government-owned national oil company of Bangladesh. It explores, produces, transports, manages and sells oil, natural gas and other mineral resources.",
      "meta": {
        "refs": [
          "https://www.petrobangla.org.bd/"
        ]
      },
      "uuid": "b2cd7e0a-5bfb-11e9-8647-d663bd873d93",
      "value": "Petrobangla"
    }
	  ],
	"version": 4
}
