{
	"category": "BLS-NAICS-54",
	"description": "The Professional, Scientific, and Technical Services sector comprises establishments that specialize in performing professional, scientific, and technical activities for others. These activities require a high degree of expertise and training. The establishments in this sector specialize according to expertise and provide these services to clients in a variety of industries and, in some cases, to households. Activities performed include: legal advice and representation; accounting, bookkeeping, and payroll services; architectural, engineering, and specialized design services; computer services; consulting services; research services; advertising services; photographic services; translation and interpretation services; veterinary services; and other professional, scientific, and technical services.",
	"name": "BLS-NAICS-54",
	"source": "BLS Industries at a Glance",
	"type": "BLS-NAICS-54",
	"uuid": "4fb9f7a0-483f-11e9-8646-d663bd873d93",
	"values": [{
			"description": "Test place holder",
			"meta": {
				"refs": [
					"https://www.bls.gov/iag/tgs/iag54.htm"
				]
			},
			"uuid": "e7b298ae-48f9-11e9-8646-d663bd873d93",
			"value": "Test Professional, Scientific, and Technical Services Value"
		},
		{
			"description": "Elasticsearch is a search engine based on the Lucene library. It provides a distributed, multitenant-capable full-text search engine with an HTTP web interface and schema-free JSON documents. Elasticsearch is developed in Java.",
			"meta": {
				"refs": [
					"https://www.elastic.co/"
				]
			},
			"uuid": "2f0d5bf4-4b38-11e9-8646-d663bd873d93",
			"value": "ElasticSearch"
		},
		{
			"description": "Coinhive is a cryptocurrency mining service that relies on a small chunk of computer code designed to be installed on Web sites. The code uses some or all of the computing power of any browser that visits the site in question, enlisting the machine in a bid to mine bits of the Monero cryptocurrency.",
			"meta": {
				"refs": [
					"https://krebsonsecurity.com/2018/03/who-and-what-is-coinhive/"
				]
			},
			"uuid": "f42daf6a-4b38-11e9-8646-d663bd873d93",
			"value": "Coinhive"
		},
		{
			"description": "HackingTeam is a Milan-based information technology company that sells offensive intrusion and surveillance capabilities to governments, law enforcement agencies and corporations.",
			"meta": {
				"refs": [
					"http://www.hackingteam.it/"
				]
			},
			"uuid": "22ca7fba-4b39-11e9-8646-d663bd873d93",
			"value": "Hacking Team"
		},
		{
			"description": "Automation Anywhere is a developer of robotic process automation software. The company's product, Automation Anywhere Enterprise, caters to enterprises looking to deploy a digital workforce composed of software bots that complete business processes end-to-end.",
			"meta": {
				"refs": [
					"https://www.automationanywhere.com/"
				]
			},
			"uuid": "741bb2a8-4b39-11e9-8646-d663bd873d93",
			"value": "Automation Anywhere"
		},
		{
			"description": "Citrix Systems, Inc. is an American multinational software company that provides server, application and desktop virtualization, networking, software as a service, and cloud computing technologies.",
			"meta": {
				"refs": [
					"https://www.citrix.com/"
				]
			},
			"uuid": "a580b186-4b39-11e9-8646-d663bd873d93",
			"value": "Citrix"
		},
		{
			"description": "Computer & Network Security",
			"meta": {
				"refs": [
					"https://badpackets.net/"
				]
			},
			"uuid": "0f881844-4b3a-11e9-8646-d663bd873d93",
			"value": "Bad Packets LLC"
		},
		{
			"description": "Drupal is a free and open-source content management framework written in PHP and distributed under the GNU General Public License. Drupal provides a back-end framework for at least 2.3% of all web sites worldwide – ranging from personal blogs to corporate, political, and government sites.",
			"meta": {
				"refs": [
					"https://www.drupal.org/"
				]
			},
			"uuid": "50eb035a-4b3a-11e9-8646-d663bd873d93",
			"value": "Drupal"
		},
		{
			"description": "BambooHR is an American technology company that provides human resources software as a service. Founded in 2008 by Ben Peterson and Ryan Sanders, the company is based in Lindon, Utah. BambooHR's services include an applicant tracking system and an employee benefits tracker.",
			"meta": {
				"refs": [
					"https://www.bamboohr.com/"
				]
			},
			"uuid": "84319fa8-4b3a-11e9-8646-d663bd873d93",
			"value": "BambooHR"
		},
		{
			"description": "Very little information is known about this organization at this time.",
			"meta": {
				"refs": [
					"https://krebsonsecurity.com/tag/badges2go-ug/"
				]
			},
			"uuid": "b85e5a28-4b3a-11e9-8646-d663bd873d93",
			"value": "Badges2Go UG"
		},
		{
			"description": "Very little information is known about this organization at this time.",
			"meta": {
				"refs": [
					"https://krebsonsecurity.com/2019/02/crytpo-mining-service-coinhive-to-call-it-quits/"
				]
			},
			"uuid": "2bf3db66-4b3b-11e9-8646-d663bd873d93",
			"value": "Blockchain Future"
		},
		{
			"description": "Facebook, Inc. is an American online social media and social networking service company. It is based in Menlo Park, California. It was founded by Mark Zuckerberg, along with fellow Harvard College students and roommates Eduardo Saverin, Andrew McCollum, Dustin Moskovitz and Chris Hughes.",
			"meta": {
				"refs": [
					"https://www.facebook.com/"
				]
			},
			"uuid": "667d3de0-4b3b-11e9-8646-d663bd873d93",
			"value": "Facebook"
		},
		{
			"description": "Amadeus builds the critical solutions that help airlines and airports, hotels and railways, search engines, travel agencies, tour operators and other travel players to run their operations and improve the travel experience.",
			"meta": {
				"refs": [
					"https://amadeus.com/en"
				]
			},
			"uuid": "fe0c255e-4b3b-11e9-8646-d663bd873d93",
			"value": "Amadeus"
		},
		{
			"description": "Edelman is an American public relations and marketing consultancy firm, founded by and named after Daniel Edelman. It is currently run by his son Richard Edelman.",
			"meta": {
				"refs": [
					"https://www.edelman.com/"
				]
			},
			"uuid": "3d70d2e4-4b3c-11e9-8646-d663bd873d93",
			"value": "Edelman"
		},
		{
			"description": "PointCare is a breakthrough coverage management platform.",
			"meta": {
				"refs": [
					"https://www.pointcare.com/"
				]
			},
			"uuid": "6d388de6-4b3c-11e9-8646-d663bd873d93",
			"value": "PointCare"
		},
		{
			"description": "ZOLL Medical Corporation, an Asahi Kasei Group Company, develops and markets medical devices and software solutions.",
			"meta": {
				"refs": [
					"https://www.zoll.com/"
				]
			},
			"uuid": "1f6cd6a8-4ff6-11e9-8647-d663bd873d93",
			"value": "ZOLL Medical Corporation"
		},
		{
			"description": "Professional Tax & Accounting, AL. provides tax and accounting services to the local community",
			"meta": {
				"refs": [
					"https://www.facebook.com/Professional-Tax-and-Accounting-223728064396/"
				]
			},
			"uuid": "1f6cdd92-4ff6-11e9-8647-d663bd873d93",
			"value": "Professional Tax & Accounting, AL"
		},
		{
			"description": "Elsevier is a Dutch information and analytics company and one of the world's major providers of scientific, technical, and medical information. It was established in 1880 as a publishing company. It is a part of the RELX Group, known until 2015 as Reed Elsevier.",
			"meta": {
				"refs": [
					"https://www.elsevier.com/"
				]
			},
			"uuid": "1f6cdf36-4ff6-11e9-8647-d663bd873d93",
			"value": "Elsevier"
		},
		{
			"description": "Affordable EHR software for ambulatory medical practices.",
			"meta": {
				"refs": [
					"http://www.meditab.com/"
				]
			},
			"uuid": "1f6ce094-4ff6-11e9-8647-d663bd873d93",
			"value": "Meditab"
		},
		{
			"description": "Lex Machina, Inc. is an IP litigation research company and division of LexisNexis that develops legal analytics data and software. The company started as a project at Stanford University within the university's law school and computer science department before launching as a startup in Menlo Park, California.",
			"meta": {
				"refs": [
					"https://lexmachina.com/"
				]
			},
			"uuid": "1f6ce1e8-4ff6-11e9-8647-d663bd873d93",
			"value": "Lex Machina, Inc."
		},
		{
			"description": "Provides legal outsourcing services to law firms and legal departments, including litigation support, transaction support, intellectual property rights.",
			"meta": {
				"refs": [
					"https://www.lexvisio.com/legal-services/lexsphere-pvt-ltd"
				]
			},
			"uuid": "1f6ce328-4ff6-11e9-8647-d663bd873d93",
			"value": "LexSphere"
		},
		{
			"description": "Secur Solutions Group (SSG) is a technology company with solutions in smart, card issuance, identity security and digital engagement.",
			"meta": {
				"refs": [
					"https://www.rsaconference.com/events/ap16/exhibitors-sponsors/exhibitor-list/2640/secur-solutions-group-pte-ltd"
				]
			},
			"uuid": "1f6ce6c0-4ff6-11e9-8647-d663bd873d93",
			"value": "Secur Solutions Group Pte Ltd"
		},
		{
			"description": "Bithumb, the best & most reliable blockchain platform to buy, sell, exchange and trade cryptocurrency.",
			"meta": {
				"refs": [
					"https://en.bithumb.com/"
				]
			},
			"uuid": "bdbff248-5a0c-11e9-8647-d663bd873d93",
			"value": "Bithumb"
		},
		{
			"description": "Cryptocurrency exchange.",
			"meta": {
				"refs": [
					"https://dragonex.io/en-us/"
				]
			},
			"uuid": "0e1dca18-5241-11e9-8647-d663bd873d93",
			"value": "DragonEx"
		},
		{
			"description": "Our grassroots advocacy system is perfect for organizations with small non-technical staff, but is also flexible enough to meet the needs of the most sophisticated operations. Set up and launch campaigns in as little as 5 to 10 minutes. With our streamlined interface, your supporters are alerted to the issue, matched to their correct elected officials, and guided through the message sending process in just seconds.",
			"meta": {
				"refs": [
					"https://info.votervoice.net/what-we-do/"
				]
			},
			"uuid": "4caa648e-5bfc-11e9-8647-d663bd873d93",
			"value": "VoterVoice"
		},
		{
			"description": "Microsoft Corporation is an American multinational technology company with headquarters in Redmond, Washington. It develops, manufactures, licenses, supports and sells computer software, consumer electronics, personal computers, and related services.",
			"meta": {
				"refs": [
					"https://www.microsoft.com/en-us/default.aspx/"
				]
			},
			"uuid": "35d60dae-63d0-11e9-a923-1681be663d3e",
			"value": "Microsoft Corporation"
		},
		{
			"description": "Wipro Limited is an Indian multinational corporation that provides information technology, consulting and business process services. It is headquartered in Bengaluru, Karnataka, India. In 2013, Wipro separated its non-IT businesses into separate companies.",
			"meta": {
				"refs": [
					"https://www.wipro.com/en-US/"
				]
			},
			"uuid": "35d61024-63d0-11e9-a923-1681be663d3e",
			"value": "Wipro Ltd."
		},
		{
			"description": "LD Evans, CPA, provides tax, consulting, and accounting services to a variety of clients and assorted industries throughout California.",
			"meta": {
				"refs": [
					"http://www.ldevanscpa.com/"
				]
			},
			"uuid": "7c545262-65e8-11e9-a923-1681be663d3e",
			"value": "LD Evans, CPA"
		},
		{
			"description": "LinkedIn is a business and employment-oriented service that operates via websites and mobile apps. Founded on December 28, 2002, and launched on May 5, 2003, it is mainly used for professional networking, including employers posting jobs and job seekers posting their CVs.",
			"meta": {
				"refs": [
					"https://www.linkedin.com/"
				]
			},
			"uuid": "7c545780-65e8-11e9-a923-1681be663d3e",
			"value": "LinkedIn"
		},
		{
			"description": "Doctors Management Service has provided a service-oriented medical billing option to the healthcare industry for 25 years in a unique Client's First​ method. Regardless of practice size, we custom tailor your account to what your practice needs. We service sole practitioners with less than 1,000 encounters per year and we service groups with a patient volume over 100,000 per year. There is no account too large or small. Each client receives the individual attention they need, to meet the essential goals of their practice.",
			"meta": {
				"refs": [
					"https://doctorsmanagementservice.org/"
				]
			},
			"uuid": "56d21958-681c-11e9-a923-1681be663d3e",
			"value": "Doctors’ Management Service, Inc."
		},
		{
			"description": "BC Pension Corporation is one of the largest pension plan administrative agents in Canada. Created in 2000, the corporation provides pension administration services on behalf of BC's College, Municipal, Public Service, Teachers and WorkSafeBC pension plans, providing client service to five boards of trustees and their plan members and employers.",
			"meta": {
				"refs": [
					"https://en.wikipedia.org/wiki/BC_Pension_Corporation",
					"https://www.pensionsbc.ca/"
				]
			},
			"uuid": "350317cc-6b56-11e9-a923-1681be663d3e",
			"value": "BC Pension Corporation"
		},
		{
			"description": "Email vendor",
			"meta": {
				"refs": [
					"Verifications.io"
				]
			},
			"uuid": "35031a56-6b56-11e9-a923-1681be663d3e",
			"value": "Verifications.io"
		},
		{
			"description": "Founded in 2002 as a health care value-added intermediary providing clearinghouse services, today Inmediata provides a full suite of software and business process outsourcing solutions for health plans, hospitals, IPAs, and independent physicians. Inmediata leverages its claim adjudication, clearinghouse, practice management, electronic health record and health information exchange services to support administrative simplification and population health.",
			"meta": {
				"refs": [
					"https://www.inmediata.com"
				]
			},
			"uuid": "35031c5e-6b56-11e9-a923-1681be663d3e",
			"value": "Inmediata Health Group, Corp."
		},
		{
			"description": "Docker Hub is the world's easiest way to create, manage, and deliver your teams' container applications. Sign up for Docker Hub Browse Popular Images. Docker Hub is the world's largest. library and community for container images.",
			"meta": {
				"refs": [
					"https://hub.docker.com/"
				]
			},
			"uuid": "35031da8-6b56-11e9-a923-1681be663d3e",
			"value": "Docker Hub"
		},
		{
			"description": "Our emergency medical travel services pick up where traditional insurance leaves off. Global leaders in emergency medical evacuation membership services.",
			"meta": {
				"refs": [
					"https://www.skymed.com/"
				]
			},
			"uuid": "b30b12dc-6cf0-11e9-a923-1681be663d3e",
			"value": "SkyMed"
		},
		{
			"description": "Charles River Laboratories, Inc., is an American corporation specializing in a variety of pre-clinical and clinical laboratory services for the pharmaceutical, medical device and biotechnology industries.",
			"meta": {
				"refs": [
					"https://www.criver.com/"
				]
			},
			"uuid": "b30b158e-6cf0-11e9-a923-1681be663d3e",
			"value": "Charles River Laboratories International, Inc."
		},
		{
			"description": "Since 2003, Ladders has been a leader in the professional-level job search. We've become experts in career management - having conducted many studies on the sociology and culture of the executive job space, including the famous Ladders Eye-Tracking Study. Ladders has also published many books and articles on career-related subjects, and has reviewed over 1.5 million resumes.",
			"meta": {
				"refs": [
					"https://recruit.theladders.com/"
				]
			},
			"uuid": "f4de87ba-7106-11e9-a923-1681be663d3e",
			"value": "Ladders"
		},
		{
			"description": "GitHub is a web-based hosting service for version control using Git. It is mostly used for computer code. It offers all of the distributed version control and source code management functionality of Git as well as adding its own features.",
			"meta": {
				"refs": [
					"https://github.com"
				]
			},
			"uuid": "f4de8b02-7106-11e9-a923-1681be663d3e",
			"value": "GitHub"
		},
		{
			"description": "Bitbucket is a web-based version control repository hosting service owned by Atlassian, for source code and development projects that use either Mercurial or Git revision control systems. Bitbucket offers both commercial plans and free accounts.",
			"meta": {
				"refs": [
					"https://bitbucket.org/"
				]
			},
			"uuid": "f4de8c60-7106-11e9-a923-1681be663d3e",
			"value": "Bitbucket"
		},
		{
			"description": "GitLab is a web-based DevOps lifecycle tool that provides a Git-repository manager providing wiki, issue-tracking and CI/CD pipeline features, using an open-source license, developed by GitLab Inc.",
			"meta": {
				"refs": [
					"https://about.gitlab.com/"
				]
			},
			"uuid": "f4de8e18-7106-11e9-a923-1681be663d3e3",
			"value": "GitLab"
		},
		{
			"description": "Binance is a global cryptocurrency exchange that provides a platform for trading more than 100 cryptocurrencies. Since early 2018, Binance is considered as the biggest cryptocurrency exchange in the world in terms of trading volume.",
			"meta": {
				"refs": [
					"https://www.binance.com/en"
				]
			},
			"uuid": "456d991e-7bd9-11e9-8f9e-2a86e4085a59",
			"value": "Binance"
		},
		{
			"description": "OS inc. is your trusted partner in revenue cycle management. Our efficientC claims management system (SaaS) provides a single solution for denial elimination.",
			"meta": {
				"refs": [
					"https://www.os-healthcare.com/"
				]
			},
			"uuid": "456d9bc6-7bd9-11e9-8f9e-2a86e4085a59",
			"value": "OS inc."
		},
		{
			"description": "Bloodworks Northwest is a blood bank and medical research institute headquartered in Seattle, Washington that serves 90 hospitals in western Washington and Oregon. It has formerly been known as the Puget Sound Blood Center and King County Central Blood Bank.",
			"meta": {
				"refs": [
					"https://www.bloodworksnw.org/"
				]
			},
			"uuid": "456d9d60-7bd9-11e9-8f9e-2a86e4085a59",
			"value": "Bloodworks Northwest"
		},
		{
			"description": "Founded in 1977, AMCA is the leading recovery agency for patient collections. We are one of the Nation’s top high volume lower balance agencies managing over $1BN in annual receivables for a diverse client base. Our employees are trained to provide the highest level of service while delivering the highest recovery rates to our clients.",
			"meta": {
				"refs": [
					"http://www.amcaonline.com/"
				]
			},
			"uuid": "456d9eaa-7bd9-11e9-8f9e-2a86e4085a59",
			"value": "American Medical Collection Agency (AMCA)"
		},
		{
			"description": "Ifficient generates high quality exclusive opt-in leads on a pay-for-performance basis. We make acquisition marketing easy by empowering advertisers to acquire new consumers via highly targeted online & mobile advertising campaigns.",
			"meta": {
				"refs": [
					"http://www.ifficient.com/"
				]
			},
			"uuid": "456da24c-7bd9-11e9-8f9e-2a86e4085a59",
			"value": "Ifficient"
		},
		{
			"description": "Condé Nast Inc. is an American mass media company founded in 1909 by Condé Montrose Nast, based at One World Trade Center and owned by Advance Publications.",
			"meta": {
				"refs": [
					"https://www.condenast.com/"
				]
			},
			"uuid": "456da3b4-7bd9-11e9-8f9e-2a86e4085a59",
			"value": "Condé Nast"
		},
		{
			"description": "Stack Overflow is a question and answer site for professional and enthusiast programmers. It is a privately held website, the flagship site of the Stack Exchange Network, created in 2008 by Jeff Atwood and Joel Spolsky. It features questions and answers on a wide range of topics in computer programming.",
			"meta": {
				"refs": [
					"https://stackoverflow.com/"
				]
			},
			"uuid": "66bf934c-7e36-11e9-8f9e-2a86e4085a59",
			"value": "Stack Overflow"
		},
		{
			"description": "HCL Technologies Limited is an Indian multinational information technology service and consulting company headquartered in Noida, Uttar Pradesh. It is a subsidiary of HCL Enterprise.",
			"meta": {
				"refs": [
					"https://www.hcltech.com/"
				]
			},
			"uuid": "66bf98e2-7e36-11e9-8f9e-2a86e4085a59",
			"value": "HCL Technologies"
		},
		{
			"description": "Instagram is a photo and video-sharing social networking service owned by Facebook, Inc. It was created by Kevin Systrom and Mike Krieger, and launched in October 2010 exclusively on iOS.",
			"meta": {
				"refs": [
					"https://www.instagram.com/?hl=en"
				]
			},
			"uuid": "66bf9b3a-7e36-11e9-8f9e-2a86e4085a59",
			"value": "Instagram"
		},
		{
			"description": "Computacenter plc is a European company that provides computer services to public- and private-sector customers. It is a UK company based in Hatfield, Hertfordshire. The company is listed on the London Stock Exchange and is a constituent of the FTSE 250 Index.",
			"meta": {
				"refs": [
					"https://www.computacenter.com/"
				]
			},
			"uuid": "62fdcf38-8225-11e9-bc42-526af7764f64",
			"value": "Computacenter"
		},
		{
			"description": "Retail travel agencies. Meet the demands of a more informed, tech-savvy customer base with Amadeus industry-leading retail travel agency solutions, helping you unlock new market opportunities, safeguard competitive positioning and maximize revenue.",
			"meta": {
				"refs": [
					"https://amadeus.com/en/industries/retail-travel-agencies"
				]
			},
			"uuid": "62fdd3e8-8225-11e9-bc42-526af7764f64",
			"value": "Amadeus Travel Agency"
		},
		{
			"description": "Canva is a graphic-design tool website, founded in 2012. It uses a drag-and-drop format and provides access to over a million photographs, graphics, and fonts. It is used by non-designers as well as professionals. The tools can be used for both web and print media design and graphics.",
			"meta": {
				"refs": [
					"https://www.canva.com/"
				]
			},
			"uuid": "62fdd55a-8225-11e9-bc42-526af7764f64",
			"value": "Canva"
		},
		{
			"description": "Snapchat is a multimedia messaging app used globally, created by Evan Spiegel, Bobby Murphy, and Reggie Brown, former students at Stanford University, and developed by Snap Inc., originally Snapchat Inc.",
			"meta": {
				"refs": [
					"https://www.snapchat.com/"
				]
			},
			"uuid": "62fdd690-8225-11e9-bc42-526af7764f64",
			"value": "Snapchat"
		},
		{
			"description": "For over 35 years, Perceptics has been the leader in license plate readers, license plate recognition systems and vehicle identification products.",
			"meta": {
				"refs": [
					"https://www.perceptics.com/"
				]
			},
			"uuid": "62fdd7b2-8225-11e9-bc42-526af7764f64",
			"value": "Perceptics LLC"
		},
		{
			"description": "JCrush is a free, location-based dating app for Jewish singles.",
			"meta": {
				"refs": [
					"http://jcrush.com/"
				]
			},
			"uuid": "1202349c-8d43-11e9-bc42-526af7764f64",
			"value": "JCrush"
		},
		{
			"description": "Laboratory Corporation of America Holdings, more commonly known as LabCorp, is an American S&P 500 company headquartered in Burlington, North Carolina. It operates one of the largest clinical laboratory networks in the world, with a United States network of 36 primary laboratories.",
			"meta": {
				"refs": [
					"https://www.labcorp.com/"
				]
			},
			"uuid": "1202394c-8d43-11e9-bc42-526af7764f64",
			"value": "LabCorp"
		},
		{
			"description": "Quest Diagnostics Incorporated is an American clinical laboratory founded in 1967 as Metropolitan Pathology Laboratory, Inc. It became an independent corporation with the Quest name on December 31, 1996. As a Fortune 500 company, Quest operates in the United States, United Kingdom, Mexico, and Brazil.",
			"meta": {
				"refs": [
					"https://www.questdiagnostics.com/"
				]
			},
			"uuid": "12023ab4-8d43-11e9-bc42-526af7764f64",
			"value": "Quest Diagnostics"
		},
		{
			"description": "PayID is an opt-in account addressing scheme that aims to make sharing account details easier, in place of the existing BSB and account number addressing. Currently, phone numbers, email addresses, and ABNs can be used. The BSB and account number addressing scheme will continue to be used in parallel. PayID is planned to be supported by most major financial institutions throughout Australia.",
			"meta": {
				"refs": [
					"https://payid.com.au/"
				]
			},
			"uuid": "12023be0-8d43-11e9-bc42-526af7764f64",
			"value": "PayID"
		},
		{
			"description": "Tech Data Corporation is an American multinational distribution company specializing in IT products and services headquartered in Clearwater, Florida.",
			"meta": {
				"refs": [
					"https://www.techdata.com/"
				]
			},
			"uuid": "12023d0c-8d43-11e9-bc42-526af7764f64",
			"value": "Tech Data Corporation"
		},
		{
			"description": "Evite is a social-planning website for creating, sending, and managing online invitations. Evite was launched in 1998. The website is a free, advertisement-supported service. Evite was co-founded by Al Lieb and Selina Tobaccowala. It was acquired in 2001 by conglomerate IAC/InterActiveCorp.",
			"meta": {
				"refs": [
					"https://www.evite.com/"
				]
			},
			"uuid": "43f0b8c4-95f0-11e9-bc42-526af7764f64",
			"value": "Evite"
		},
		{
			"description": "dba ResiDex Software",
			"meta": {
				"refs": [
					"https://www.leadingagemn.org/directory_bp/step3?CID=9957"
				]
			},
			"uuid": "43f0bb6c-95f0-11e9-bc42-526af7764f64",
			"value": "Tenx Systems, LLC"
		},
		{
			"description": "ResiDex Software is the innovative, integrated, and user-friendly software solution for your Assisted Living center, Group Home, or Adult Day Services location.",
			"meta": {
				"refs": [
					"https://www.residexsoftware.com/"
				]
			},
			"uuid": "43f0bcb6-95f0-11e9-bc42-526af7764f64",
			"value": "ResiDex Software"
		},
		{
			"description": "Order food online with EatStreet. Online food ordering service provider.",
			"meta": {
				"refs": [
					"https://eatstreet.com/"
				]
			},
			"uuid": "43f0be82-95f0-11e9-bc42-526af7764f64",
			"value": "Eatstreet"
		},
		{
			"description": "Talanton AI is a Talant Aggregator. Capture high-quality prospective candidates in one place through our simple search process.",
			"meta": {
				"refs": [
					"http://talanton.ai/"
				]
			},
			"uuid": "43f0bfc2-95f0-11e9-bc42-526af7764f64",
			"value": "Talanton.ai"
		},
		{
			"description": "X Social Media is a Florida-based ad firm that largely uses Facebook to advertise various campaigns for its law firm customers.",
			"meta": {
				"refs": [
					"https://www.xsocialmedia.com/"
				]
			},
			"uuid": "43f0c0e4-95f0-11e9-bc42-526af7764f64",
			"value": "X Social Media"
		},
		{
			"description": "Venmo is a mobile payment service owned by PayPal. Venmo account holders can transfer funds to others via a mobile phone app; both the sender and receiver have to live in the U.S. Venmo is a type of payment rail. It handled $12 billion in transactions in the first quarter of 2018.",
			"meta": {
				"refs": [
					"https://venmo.com/"
				]
			},
			"uuid": "43f0c422-95f0-11e9-bc42-526af7764f64",
			"value": "Venmo"
		},
		{
			"description": "WeTransfer is a cloud-based computer file transfer service. The company was founded in Amsterdam by Bas Beerens and Nalden. The core service is free, with more features available for premium accounts.",
			"meta": {
				"refs": [
					"https://wetransfer.com/"
				]
			},
			"uuid": "43f0c56c-95f0-11e9-bc42-526af7764f64",
			"value": "WeTransfer"
		},
		{
			"description": "Data integration and big data management solutions from Attunity including real-time enterprise data solutions.",
			"meta": {
				"refs": [
					"https://www.attunity.com/"
				]
			},
			"uuid": "ba2ac128-a5d2-11e9-a2a3-2a2ae2dbcce4",
			"value": "Attunity"
		},
		{
			"description": "PCM, Inc. is a direct marketing company that offers technology products and services. The company is based in El Segundo, California. PCM started in 1987 as a direct market catalog via telemarketing, the Internet, direct marketing, print catalogs, and three retail showrooms.",
			"meta": {
				"refs": [
					"http://www.pcm.com/"
				]
			},
			"uuid": "ba2ac3da-a5d2-11e9-a2a3-2a2ae2dbcce4",
			"value": "PCM, Inc."
		},
		{
			"description": "With strength on IoT, AI and cloud computing technologies, ORVIBO provides more secure, energy-saving & comfortable smart home solutions for customers worldwide. ORVIBO provides smart solutions for house, office, apartment hotel. ORVIBO is the pioneer & veteran of IoT technology in China since 2011.",
			"meta": {
				"refs": [
					"https://www.orvibo.com/"
				]
			},
			"uuid": "ba2ac7ae-a5d2-11e9-a2a3-2a2ae2dbcce4",
			"value": "Orvibo"
		},
		{
			"description": "Incorporated in the year 2000, Magnasoft is a leader in the arena of digital geospatial information and services.We provide superlative data processing techniques to capture and display voluminous geospatial data in a comprehensible form.",
			"meta": {
				"refs": [
					"https://www.magnasoft.com/who-we-are/"
				]
			},
			"uuid": "ba2ac902-a5d2-11e9-a2a3-2a2ae2dbcce4",
			"value": "Magnasoft Consulting India"
		},
		{
			"description": "Eurofins is an international group of laboratories headquartered in Brussels, providing testing and support services to the pharmaceutical, food, environmental, agriscience and consumer products industries and to governments.",
			"meta": {
				"refs": [
					"https://www.eurofins.com/"
				]
			},
			"uuid": "ba2aca2e-a5d2-11e9-a2a3-2a2ae2dbcce4",
			"value": "Eurofins Scientific"
		},
		{
			"description": "Zhaopin National Job Network is a national authority to find a job working platform to provide true and accurate information for your National Jobs, every day millions of high-paying jobs jobs for you to choose, finding work Zhaopin.",
			"meta": {
				"refs": [
					"https://www.zhaopin.com/"
				]
			},
			"uuid": "ba2acb5a-a5d2-11e9-a2a3-2a2ae2dbcce4",
			"value": "Zhaopin National Job Network"
		},
		{
			"description": "Japan based cryptocurrency vendor.",
			"meta": {
				"refs": [
					"https://www.bitpoint.co.jp/"
				]
			},
			"uuid": "b029cbee-abc0-11e9-a2a3-2a2ae2dbcce4",
			"value": "BITPoint"
		},
		{
			"description": "Clinical Pathology Laboratories, Inc. (CPL) has served the medical community for more than 70 years and continues to offer the highest quality laboratory services dedicated to the individual needs of practitioners and their patients. More than 1,900 employees work at our 100,000 square foot main laboratory facility and at our regional laboratory operations located across the Southwest.",
			"meta": {
				"refs": [
					"https://www.cpllabs.com/"
				]
			},
			"uuid": "b029ce50-abc0-11e9-a2a3-2a2ae2dbcce4",
			"value": "Clinical Pathology Laboratories, Inc. (CPL)"
		},
		{
			"description": "AavGo is hotel management software that provides excellent engagement and communication between guest & hotel staff.",
			"meta": {
				"refs": [
					"https://aavgo.com/"
				]
			},
			"uuid": "b029cfae-abc0-11e9-a2a3-2a2ae2dbcce4",
			"value": "AavGo"
		},
		{
			"description": "Discord is a proprietary freeware VoIP application and digital distribution platform—designed initially for the video gaming community—that specializes in text, image, video and audio communication between users in a chat channel. Discord runs on Windows, macOS, Android, iOS, Linux, and in web browsers.",
			"meta": {
				"refs": [
					"https://discordapp.com/"
				]
			},
			"uuid": "d9f03dc8-aca6-11e9-a2a3-2a2ae2dbcce4",
			"value": "Discord"
		},
		{
			"description": "Seacoast Pathology, located in Exeter, NH, provides the highest quality, customized pathology laboratory services throughout New England. Since 1981, Seacoast Pathology has supported these physicians and their staffs with expert diagnoses, innovative technologies, and excellent service.",
			"meta": {
				"refs": [
					"http://www.seacoastpathology.com/"
				]
			},
			"uuid": "d9f0402a-aca6-11e9-a2a3-2a2ae2dbcce4",
			"value": "Seacoast Pathology, Inc."
		},
		{
			"description": "Aurora Diagnostics Laboratory of Dermatopathology (ARDX LDP), located in Woodbury, NY, provides the highest quality, customized dermatopathology laboratory services to dermatologists, general practice physicians, family practice physicians, and podiatrists. Since 1972, ARDX LDP has supported these physicians and their staffs with expert diagnoses, innovative technologies, and excellent service.",
			"meta": {
				"refs": [
					"http://www.labofderm.com/"
				]
			},
			"uuid": "d9f0417e-aca6-11e9-a2a3-2a2ae2dbcce4",
			"value": "Laboratory of Dermatopathology ADX, LLC "
		},
		{
			"description": "American Esoteric Laboratories (AEL) is a regional provider of esoteric and clinical laboratory services, focused to provide the unique turnaround time and quality demands for testing services for health care providers. Our laboratory offers an extended test menu of both routine and esoteric testing. AEL uses advanced information technology solutions to automate and streamline electronic assay ordering and result reporting for its customers.",
			"meta": {
				"refs": [
					"https://www.ael.com/"
				]
			},
			"uuid": "d9f042be-aca6-11e9-a2a3-2a2ae2dbcce4",
			"value": "American Esoteric Laboratories"
		},
		{
			"description": "CBLPath, Inc. is a leading provider of sub-specialized anatomic pathology and molecular diagnostic laboratory services. We are committed to partnering with our physician-clients to provide the best possible patient care. Founded in 1988 as Cytopath Biopsy Lab, our landmark laboratory quickly established a reputation for providing definitive diagnoses coupled with extraordinary customer service.",
			"meta": {
				"refs": [
					"https://www.cblpath.com/"
				]
			},
			"uuid": "d9f043ea-aca6-11e9-a2a3-2a2ae2dbcce4",
			"value": "CBLPath, Inc."
		},
		{
			"description": "Natera is a genetic testing company that operates a CLIA-certified laboratory in San Carlos, California.",
			"meta": {
				"refs": [
					"https://www.natera.com/"
				]
			},
			"uuid": "d9f0469c-aca6-11e9-a2a3-2a2ae2dbcce4",
			"value": "Natera, Inc."
		},
		{
			"description": "A cryptocurrency exchange listed in Sweden.",
			"meta": {
				"refs": [
					"https://quickbit.eu/"
				]
			},
			"uuid": "5e129e16-b61b-11e9-a2a3-2a2ae2dbcce4",
			"value": "QuickBit"
		},
		{
			"description": "Invest in stocks, ETFs, options, and cryptocurrencies, all commission-free, right from your phone or desktop.",
			"meta": {
				"refs": [
					"https://robinhood.com/"
				]
			},
			"uuid": "5e12a0d2-b61b-11e9-a2a3-2a2ae2dbcce4",
			"value": "Robbinhood"
		},
		{
			"description": "FormGet is used to make communication easy and powerful between you and your customers. FormGet has been organised to manage all your forms from a single place. You can build contact forms, payments forms, lead capture forms or just about any form you can imagine. Earlier the problem with most of the forms was that they only allowed the users to submit their queries and there were no chances of further communication from the other side. Admin were not able to manage all its forms from a single place. And whenever they want to reply to the queries they need to switch back and forth between email accounts for replying back.",
			"meta": {
				"refs": [
					"https://www.formget.com/"
				]
			},
			"uuid": "5e12a316-b61b-11e9-a2a3-2a2ae2dbcce4",
			"value": "FormGet"
		},
		{
			"description": "Founded in 2001, 1to1help.net is India(s) leading Employee Assistance Program (EAP) provider. We offer Psychological Counselling and comprehensive Wellness solutions that help employees deal with various work-life challenges like stress, anxiety, parenting, relationship issues both pre & post marital, work-life balance, etc. We currently support 300+ clients and cover 1.7 million lives through our team of 250+ counsellors across 55+ locations in India. We also provide services in the areas of Prevention of Sexual Harassment (POSH), Shiftwork Lifestyle Management, Healthy Maternity, Diversity & Inclusion, Diet and Nutrition and other wellness services.",
			"meta": {
				"refs": [
					"https://1to1help.net/"
				]
			},
			"uuid": "5e12a528-b61b-11e9-a2a3-2a2ae2dbcce4",
			"value": "1to1help"
		},
		{
			"description": "Neoclinical matches patients with clinical trials and vise versa.",
			"meta": {
				"refs": [
					"http://neoclinical.com/"
				]
			},
			"uuid": "8f948134-bf85-11e9-9cb5-2a2ae2dbcce4",
			"value": "Neoclinical"
		},
		{
			"description": "3Fun (3FUN) is a location-based mobile online dating application for Android and iOS. It is currently the most widely used dating mobile app for polyamorous couples.",
			"meta": {
				"refs": [
					"https://en.wikipedia.org/wiki/3FUN"
				]
			},
			"uuid": "8f94851c-bf85-11e9-9cb5-2a2ae2dbcce4",
			"value": "3fun"
		},
		{
			"description": "An Android based chatting and photo sharing application with over 10 million users.",
			"meta": {
				"refs": [
					"https://play.google.com/store/apps/details?id=sweetchat.localdatingtinder.meet&hl=en_US"
				]
			},
			"uuid": "8f94868e-bf85-11e9-9cb5-2a2ae2dbcce4",
			"value": "Sweet Chat"
		},
		{
			"description": "Suprema is a leading global provider of biometrics and security. By combining world renowned biometric algorithms with superior engineering, Suprema has introduced a number of technology initiatives and innovations to the security industry over the last couple of decades. Suprema’s extensive range of portfolio includes biometric access control systems, time & attendance solutions, fingerprint live scanners, mobile authentication solutions and embedded fingerprint modules. Suprema has established itself as a premium global brand in physical security industry and has worldwide sales network in over 130 countries. Suprema has no.1 market share in biometric access control in EMEA region and named to the world's top 50 security manufacturer.",
			"meta": {
				"refs": [
					"https://www.supremainc.com/en/main.asp"
				]
			},
			"uuid": "8f9487c4-bf85-11e9-9cb5-2a2ae2dbcce4",
			"value": "Suprema HQ"
		},
		{
			"description": "Imperva is a cyber security software and services company which provides protection to enterprise data and application software. The company is headquartered in Redwood Shores, California.",
			"meta": {
				"refs": [
					"https://www.imperva.com/"
				]
			},
			"uuid": "eca5ffde-cb32-11e9-a32f-2a2ae2dbcce4",
			"value": "Imperva, Inc."
		},
		{
			"description": "We offer a complete technology solution including computers, software, digital equipment, phone systems, and audio solutions for every phase of your practice including the expert support for the life of your equipment.",
			"meta": {
				"refs": [
					"http://www.percsoft.com/"
				]
			},
			"uuid": "eca60240-cb32-11e9-a32f-2a2ae2dbcce4",
			"value": "PerCSoft Dental Technology Consulting"
		},
		{
			"description": "Foxit Software, Inc. develops Portable Document Format software and tools used to create, edit, sign, and secure files and digital documents. It is a software company headquartered in Fremont, California, with offices in Berlin, Beijing, Fuzhou, South Yarra, Australia and other locations.",
			"meta": {
				"refs": [
					"https://www.foxitsoftware.com/"
				]
			},
			"uuid": "703e35e8-cdb6-11e9-a32f-2a2ae2dbcce4",
			"value": "Foxit Software"
		},
		{
			"description": "The world's leading independent advertising platform, Amobee unifies all advertising channels—including TV, programmatic and social—across all formats and devices, providing marketers with streamlined, advanced media planning capabilities powered by in-depth analytics and proprietary audience data.",
			"meta": {
				"refs": [
					"https://www.amobee.com/"
				]
			},
			"uuid": "19641584-ce75-11e9-a32f-2a2ae2dbcce4",
			"value": "Amobee"
		},
		{
			"description": "Subsidiary of Amobee, an advertising company.",
			"meta": {
				"refs": [
					"https://www.linkedin.com/company/adconion-direct/about/"
				]
			},
			"uuid": "196418cc-ce75-11e9-a32f-2a2ae2dbcce4",
			"value": "Adconion Direct"
		},
		{
			"description": "French air travel booking company.",
			"meta": {
				"refs": [
					"https://www.optionway.com"
				]
			},
			"uuid": "19641a20-ce75-11e9-a32f-2a2ae2dbcce4",
			"value": "Option Way"
		},
		{
			"description": "Aliznet is an independent consultancy company from the Retail sector, specialising in project transformation, support and guidance in Business Sectors, Digital and IT.",
			"meta": {
				"refs": [
					"https://en.aliznet.fr/"
				]
			},
			"uuid": "19641b56-ce75-11e9-a32f-2a2ae2dbcce4",
			"value": "Aliznet"
		},
		{
			"description": "Affiliate of HelloTravel. HelloTravel is a marketplace where you get travel packages & holiday deals by trusted travel agents across the world. You may enquire about a trip package or customize your holiday. We connect you with Verified travel agents who provide you best quotes.",
			"meta": {
				"refs": [
					"https://www.hellotravel.com/truly-travels"
				]
			},
			"uuid": "19641c8c-ce75-11e9-a32f-2a2ae2dbcce4",
			"value": "Truly Travels"
		},
		{
			"description": "Monster.com is a global employment website owned and operated by Monster Worldwide, Inc. It was created in 1999 through the merger of The Monster Board and Online Career Center. It is a subsidiary of Randstad Holding, a Dutch multinational human resource consulting firm, and is headquartered in Weston, Massachusetts.",
			"meta": {
				"refs": [
					"https://www.monster.com/"
				]
			},
			"uuid": "63b4930e-d355-11e9-bb65-2a2ae2dbcce4",
			"value": "Monster.com"
		},
		{
			"description": "Our first priority is your customer’s and/or employee’s safety, security, and their positive interaction with our agents. Professionalism means extraordinary execution of service delivery. Alert, capable, energetic, and pleasant Andy Frain staff fully understand they not only represent Andy Frain Services, but our customers as well.",
			"meta": {
				"refs": [
					"https://www.andyfrain.com/"
				]
			},
			"uuid": "63b49598-d355-11e9-bb65-2a2ae2dbcce4",
			"value": "Andy Frain Services"
		},
		{
			"description": "The company was founded to add technological service for our Indian police force who ensure the safety and security of the citizens.Innovative investigation Copseye brings unique image investigation featuresto face recognition product for law enforcement. Agents can find criminal persons quickly and narrow down suspect investigations.",
			"meta": {
				"refs": [
					"https://www.copseye.ai/"
				]
			},
			"uuid": "63b49778-d355-11e9-bb65-2a2ae2dbcce4",
			"value": "COPSEYE | AI - Face recognition"
		},
		{
			"description": "Miracle Systems is a Virginia-based firm with proven record and professional certifications as a Federal contractor. We provide leading edge solutions and outstanding service to our Federal clients. As the most successful OASIS Small Business vendor, we maintain over 100 prime contracts and provide services in the following areas - PMO Support, IT Systems, Financial Consulting, Engineering Services, Training Services, Cyber Mission.",
			"meta": {
				"refs": [
					"https://www.miraclesystems.net/about"
				]
			},
			"uuid": "d6c59030-d587-11e9-bb65-2a2ae2dbcce4",
			"value": "Miracle Systems, LLC"
		},
		{
			"description": "DealerLeads dominates the automotive digital marketing industry with highly used automobile search strings turned into online inventory advertising classified sites, service sites, finance sites etc. Car shoppers have needs, and DealerLeads matches those needs in live searches.",
			"meta": {
				"refs": [
					"https://dealerleads.com"
				]
			},
			"uuid": "193d7e34-db0d-11e9-9d36-2a2ae2dbcce4",
			"value": "Dealer Leads"
		},
		{
			"description": "Plastic (cosmetic) surgeon located in Little Rock, AR.",
			"meta": {
				"refs": [
					"https://littlerockplasticsurgery.com"
				]
			},
			"uuid": "193d80a0-db0d-11e9-9d36-2a2ae2dbcce4",
			"value": "Little Rock Plastic Surgery"
		},
		{
			"description": "Garmin Ltd. is an American multinational technology company founded in 1989 by Gary Burrell and Min Kao in Lenexa, Kansas, United States, with headquarters in Olathe, Kansas. Since 2010, the company is incorporated in Schaffhausen, Switzerland.",
			"meta": {
				"refs": [
					"https://www.garmin.com/en-US/"
				]
			},
			"uuid": "193d81f4-db0d-11e9-9d36-2a2ae2dbcce4",
			"value": "Garmin Ltd."
		},
		{
			"description": "Lumin PDF brings your documents to life with smart editing and markup tools to help you easily annotate PDF documents and images. Add text, images, comments, shapes and signatures. All from your browser.",
			"meta": {
				"refs": [
					"https://www.luminpdf.com"
				]
			},
			"uuid": "540b194a-db0d-11e9-9d36-2a2ae2dbcce4",
			"value": "Lumin PDF"
		},
		{
			"description": "Click2Gov is offered by CentralSquare Technologies, a Lake Mary, Fla.-based company created in September by the merger of several software firms serving the public sector.",
			"meta": {
				"refs": [
					"https://www.digitaltransactions.net/click2gov-payment-application-for-municipalities-cited-in-48-data-breaches/"
				]
			},
			"uuid": "a6c78a8c-dd7f-11e9-8a34-2a2ae2dbcce4",
			"value": "Click2Gov"
		},
		{
			"description": "SGS is a multinational company headquartered in Geneva, Switzerland which provides inspection, verification, testing and certification services. It has more than 97,000 employees and operates over 2,600 offices and laboratories worldwide. It ranked on Forbes Global 2000 in 2015, 2016 and 2017.",
			"meta": {
				"refs": [
					"https://www.sgs.com/"
				]
			},
			"uuid": "c86cdeae-e17f-11e9-81b4-2a2ae2dbcce4",
			"value": "SGS S.A."
		},
		{
			"description": "Buy Bitcoin and Ethereum with credit card in the fastest, easiest and safest way online! Buying BTC and ETH in 3 simple steps at Coinmama.",
			"meta": {
				"refs": [
					"https://www.coinmama.com/"
				]
			},
			"uuid": "c86ce156-e17f-11e9-81b4-2a2ae2dbcce4",
			"value": "Coinmama"
		},
		{
			"description": "Tomo Drug Testing has been providing comprehensive drug and alcohol screening services for DOT compliance and Drug-Free Workplace programs since 1991. Our customized solutions are designed to help organizations promote a safer, more productive workplace. Our quality services make testing and compliance easier. Tomo Drug Testing stands out in the drug testing industry due to our premier quality and customized solutions for our clients. We provide comprehensive drug and alcohol testing solutions for DOT compliance, Drug Free workplace and judicial programs as well as for healthcare providers and labs. Our comprehensive program means we are a full-service provider, from scheduling to results, and everything in between. This means you spend less time worrying about testing, results and compliance, allowing you to remain focused on other priorities.",
			"meta": {
				"refs": [
					"https://www.yourdrugtesting.com/about/"
				]
			},
			"uuid": "76a94be6-e5ff-11e9-81b4-2a2ae2dbcce4",
			"value": "Tomo Drug Testing"
		},
		{
			"description": "Comodo Cybersecurity is a global innovator of cybersecurity solutions, and a division of Comodo Security Solutions Inc.",
			"meta": {
				"refs": [
					"http://www.comodo.com/"
				]
			},
			"uuid": "76a94e48-e5ff-11e9-81b4-2a2ae2dbcce4",
			"value": "Comodo Security Solutions, Inc."
		},
		{
			"description": "Zendesk Inc. is a customer service software company headquartered in San Francisco, California, USA. It is listed on the New York Stock Exchange with the symbol ZEN and is a constituent of the Russell 2000 Index.",
			"meta": {
				"refs": [
					"https://www.zendesk.com/"
				]
			},
			"uuid": "6acb5584-e871-11e9-81b4-2a2ae2dbcce4",
			"value": "Zendesk Inc."
		},
		{
			"description": "Pitney Bowes is a global technology company most known for its postage meters and other mailing equipment and services, and with recent expansions, into global e-commerce, software, and other technologies.",
			"meta": {
				"refs": [
					"https://www.pitneybowes.com/us"
				]
			},
			"uuid": "a1cd2bc4-f81c-11e9-8f0b-362b9e155667",
			"value": "Pitney Bowes"
		},
		{
			"description": "Since 2005, we have connected thousands of creative professionals with great companies and outstanding work opportunities.",
			"meta": {
				"refs": [
					"https://authenticjobs.com/"
				]
			},
			"uuid": "a1cd2e44-f81c-11e9-8f0b-362b9e155667",
			"value": "AuthenticJobs"
		},
		{
			"description": "App in the UK for jobs in retail, restaurants, healthcare, beauty and more.",
			"meta": {
				"refs": [
					"https://sonicjobs.co.uk/"
				]
			},
			"uuid": "a1cd2fa2-f81c-11e9-8f0b-362b9e155667",
			"value": "SonicJobs"
		},
		{
			"description": "Pouring Pounds, established in 2011, is one of UK largest operators of rewards, cashback and voucher websites. We also operate three white label sites in UK viz. BFAWU Rewards, Pa-assistcashback and a site for UK largest newspaper, The Daily Mail.",
			"meta": {
				"refs": [
					"https://pouringpounds.com/"
				]
			},
			"uuid": "a1cd30e2-f81c-11e9-8f0b-362b9e155667",
			"value": "Pouringpounds.com (Pouring Pounds Ltd)"
		},
		{
			"description": "Founded by Swati & Rohan Bhargava in April 2013, CashKaro.com is India Largest Cashback & Coupons site. We are backed by Mr. Ratan Tata and one of India leading VC firms, Kalaari Capital. With over 3.5 million registered users, CashKaro is a one stop destination for savings across 1500 ecommerce sites like Amazon.in, Flipkart, Paytm etc.",
			"meta": {
				"refs": [
					"https://cashkaro.com/"
				]
			},
			"uuid": "a1cd320e-f81c-11e9-8f0b-362b9e155667",
			"value": "CashKaro.com (CashKaro)"
		},
		{
			"description": "Avast Software s.r.o. is a Czech multinational cybersecurity software company headquartered in Prague, Czech Republic that researches and develops computer security software, machine learning and artificial intelligence. Avast has more than 435 million monthly active users and the largest market share among anti-malware application vendors worldwide as of January 2018. The company has approximately 1,700 employees across its 25 offices worldwide. Avast was founded by Pavel Baudis and Eduard Kucera in 1988 as a cooperative. It had been a private company since 2010 and had its IPO in May 2018. In July 2016, Avast acquired competitor AVG Technologies for 1.3 billion USD. At the time, AVG was the third-ranked antivirus product. It is dual-listed on the Prague Stock Exchange and on the London Stock Exchange and is a constituent of the FTSE 250 Index.",
			"meta": {
				"refs": [
					"https://en.wikipedia.org/wiki/Avast"
				]
			},
			"uuid": "9836e194-f81d-11e9-8f0b-362b9e155667",
			"value": "Avast Software s.r.o."
		},
		{
			"description": "We build mission-critical and user-friendly software for hospitality communities. Our customers are supported 24-7 by our courteous and dedicated staff, all with hands-on professional experience in the hospitality industry. AutoClerk is endorsed by Red Lion Hotels, with over 1,200 properties in North America, and Best Western Hotels & Resorts, which has over 4,000 hotels worldwide. AutoClerk is also a preferred AAHOA PMS provider. Our property management solutions have been serving hoteliers for decades. In 2003, we became one of the first in the industry to launch a successful web-booking tool for hoteliers, and myHMS pioneered web-based property management solutions.",
			"meta": {
				"refs": [
					"https://www.autoclerk.com/"
				]
			},
			"uuid": "9836e3e2-f81d-11e9-8f0b-362b9e155667",
			"value": "AutoClerk, Inc."
		},
		{
			"description": "Pilz GmbH & Co. KG is an automation technology company in Ostfildern, Germany. In addition to the head office in Germany, Pilz is represented in 40 subsidiaries and branches on all continents. The company was founded as a glass-blowing business by Hermann Pilz in Esslingen in 1948.",
			"meta": {
				"refs": [
					"https://www.pilz.com/en-US"
				]
			},
			"uuid": "9836e52c-f81d-11e9-8f0b-362b9e155667",
			"value": "Pilz GmbH & Co. KG"
		},
		{
			"description": "As the leading provider of order-to-cash solutions, Billtrust has always focused on making it easier for companies to get paid. Through consistent evolution, our integrated, cloud-based AR platform drives customer efficiencies, grows revenue and increases profitability for businesses across several industries. With more than 18 years experience and expertise – and a culture dedicated to our customers – we help businesses implement AR best practices, resulting in greater operational efficiency, accelerated cash flow and most importantly, happier customers.",
			"meta": {
				"refs": [
					"https://www.billtrust.com/"
				]
			},
			"uuid": "9836e658-f81d-11e9-8f0b-362b9e155667",
			"value": "Billtrust"
		},
		{
			"description": "Adobe Inc. is an American multinational computer software company headquartered in San Jose, California. It has historically focused upon the creation of multimedia and creativity software products, with a more recent foray towards digital marketing software.",
			"meta": {
				"refs": [
					"https://www.adobe.com/"
				]
			},
			"uuid": "a6132c66-0338-11ea-8d71-362b9e155667",
			"value": "Adobe Inc."
		},
		{
			"description": "TrialWorks case management software is designed to work seamlessly with law firms of any size and practice type.",
			"meta": {
				"refs": [
					"https://www.trialworks.com/"
				]
			},
			"uuid": "a6132ec8-0338-11ea-8d71-362b9e155667",
			"value": "TrialWorks LLC"
		},
		{
			"description": "Campaigner was founded in 1999 when the internet and email were just beginning to reach the masses. Since then, Campaigner has remained at the forefront of the evolution of email as a marketing channel.",
			"meta": {
				"refs": [
					"https://www.campaigner.com/"
				]
			},
			"uuid": "a6133012-0338-11ea-8d71-362b9e155667",
			"value": "Campaigner"
		},
		{
			"description": "Utah Valley Eye Center is a leader in providing quality, comprehensive eye care services in Provo, Utah since 1980.",
			"meta": {
				"refs": [
					"https://utahvalleyeye.com/"
				]
			},
			"uuid": "a6133148-0338-11ea-8d71-362b9e155667",
			"value": "Utah Valley Eye Center"
		},
		{
			"description": "Vedantu is an interactive online tutoring platform where teachers provide school tuitions to students over the internet, using a real-time virtual learning environment named WAVE, a technology built in-house.",
			"meta": {
				"refs": [
					"https://www.vedantu.com/"
				]
			},
			"uuid": "a613327e-0338-11ea-8d71-362b9e155667",
			"value": "Vedantu"
		},
		{
			"description": "Perth Anaesthetic Group was established by some of Perths most progressive specialist anaesthetists in 1952, to allow private practice anaesthetists to share costs and run a professional business while practicing independently. We have grown and adapted to changes in the delivery of hospital care, but still believe in the pursuit of high quality, personalised care. Past members have contributed significantly to the medical community, with representation to the Australian and New Zealand College of Anaesthetists, The Australian Society of Anaesthetists, and the AMA. There are usually 14-16 full group members at any one time, and 7-8 associated anaesthetists who are mainly in the large public hospitals. Our anaesthetists work widely throughout Perths expanding hospital network, with many of Perths most respected surgeons, providing comprehensive services to patients undergoing a wide variety of procedures. This includes patients of all ages, and often quite unwell patients needing intensive anaesthesia care and the experience that goes with it. All of our anaesthetists are required to maintain high levels of continuing professional development, and participate in relevant workshops and simulations. This is combined with quality assurance and peer review. Combined with the high levels of training involved to become a specialist after medical school, this reflects that Australia has the reputation of providing the safest level of anaesthesia care in the world.",
			"meta": {
				"refs": [
					"http://perthag.com.au/"
				]
			},
			"uuid": "50b39fa2-0339-11ea-8d71-362b9e155667",
			"value": "Perth Anaesthetic Group"
		},
		{
			"description": "everis is an NTT DATA Company, dedicated to consulting and outsourcing in all sectors, with a turnover of EUR 1.17 billion in the last financial year. We are a large family with 24,500 professionals across Europe, USA and Latin America. In 2014 everis joined NTT DATA Group, the sixth-largest IT services company in the world with 100,000 professionals and with offices in Asia-Pacific, the Middle East, Europe, Latin America and North America. Above all, everis believes in its people, their ongoing development and their talent. We are firmly committed to talent and our main goal is to nurture high performing professionals by creating an environment of responsible freedom.",
			"meta": {
				"refs": [
					"https://www.everis.com/global/en"
				]
			},
			"uuid": "50b3a4a2-0339-11ea-8d71-362b9e155667",
			"value": "everis"
		},
		{
			"description": "Set up in 2005, VTS Media is an actively growing company of young, ambitious and motivated IT professionals with the aim of creating truly innovative solutions in online security, broadcast, web acceleration and video streaming. We develop high-quality apps and services with up-to-date methods and technologies that offer limitless opportunities to your business.",
			"meta": {
				"refs": [
					"https://www.vtsmedia.com/"
				]
			},
			"uuid": "50b3a60a-0339-11ea-8d71-362b9e155667",
			"value": "Vts Media S.L."
		},
		{
			"description": "Trend Micro Inc. is a multinational cyber security and defense company with global headquarters in Tokyo, Japan, with regional headquarters and R&D centers in Asia, Europe, and North America.",
			"meta": {
				"refs": [
					"https://www.trendmicro.com/en_us/business.html"
				]
			},
			"uuid": "50b3a7fe-0339-11ea-8d71-362b9e155667",
			"value": "Trend Micro Inc."
		},
		{
			"description": "Main Street Clinical Associates, P.A., founded in 1984, is an interdisciplinary private practice group providing comprehensive mental health services to the Triangle.",
			"meta": {
				"refs": [
					"http://www.mainstreetclinical.com/"
				]
			},
			"uuid": "6754f1f4-096d-11ea-8d71-362b9e155667",
			"value": "Main Street Clinical Associates, P.A."
		},
		{
			"description": "Veritas Genetics is a personal genomics startup based in Danvers, Massachusetts. It was co-founded in 2014 by George M. Church, Mirza Cifric, Preston Estep, and Jonathan Zhao.",
			"meta": {
				"refs": [
					"https://www.veritasgenetics.com/"
				]
			},
			"uuid": "6754f442-096d-11ea-8d71-362b9e155667",
			"value": "Veritas Genetics"
		},
		{
			"description": "Prank call website. Send pre-recorded prank calls from a disguised number, then download and share the recorded audio.",
			"meta": {
				"refs": [
					"https://www.prankdial.com/"
				]
			},
			"uuid": "6754f83e-096d-11ea-8d71-362b9e155667",
			"value": "PrankDial"
		},
		{
			"description": "Toondoo lets you create comic strips and cartoons easily with just a few clicks, drags and drops.",
			"meta": {
				"refs": [
					"http://www.toondoo.com/"
				]
			},
			"uuid": "6754f9ba-096d-11ea-8d71-362b9e155667",
			"value": "ToonDoo"
		},
		{
			"description": "Choice Cancer Care, a North Texas cancer oncology center uses latest radiation therapy for prostate, breast, colon, lung and skin cancer treatment.",
			"meta": {
				"refs": [
					"https://choicecancercare.com/"
				]
			},
			"uuid": "8cfe347e-0c88-11ea-9a9f-362b9e155667",
			"value": "Choice Cancer Care"
		},
		{
			"description": "ZoneAlarm is an internet security software company that provides consumer antivirus and firewall products. ZoneAlarm was developed by Zone Labs, which was acquired in March 2004 by Check Point.",
			"meta": {
				"refs": [
					"https://www.zonealarm.com/"
				]
			},
			"uuid": "8cfe374e-0c88-11ea-9a9f-362b9e155667",
			"value": "ZoneAlarm"
		},
		{
			"description": "Liver Wellness is an innovative model of care which offers patients a private and confidential service in the assessment, treatment and personalised management of liver health issues.",
			"meta": {
				"refs": [
					"https://liverwellness.ie/"
				]
			},
			"uuid": "8cfe38a2-0c88-11ea-9a9f-362b9e155667",
			"value": "Liver Wellness"
		},
		{
			"description": "Adele is a 9 to 12 month residential alcohol & drug rehabilitation treatment program for men aged over 18 years, who are homeless or at risk of being homeless.",
			"meta": {
				"refs": [
					"https://adelehouse.org/"
				]
			},
			"uuid": "8cfe39d8-0c88-11ea-9a9f-362b9e155667",
			"value": "Adele House Alcohol & Drug Rehab"
		},
		{
			"description": "The world's safest all-in-one RuneScape Bot.",
			"meta": {
				"refs": [
					"https://www.epicbot.com/"
				]
			},
			"uuid": "8cfe3d5c-0c88-11ea-9a9f-362b9e155667",
			"value": "EpicBot"
		},
		{
			"description": "PayMyTab is the fastest, most secure and best way to discover, review, split and pay for your check at leading restaurants and venues.",
			"meta": {
				"refs": [
					"http://www.paymytab.com/"
				]
			},
			"uuid": "8cfe3eb0-0c88-11ea-9a9f-362b9e155667",
			"value": "PayMyTab"
		},
		{
			"description": "Chinese FinTech company.",
			"meta": {
				"refs": [
					"https://www.ft.com/content/93451b98-da12-11e9-8f9b-77216ebe1f17"
				]
			},
			"uuid": "a460617a-0d5d-11ea-8d71-362b9e155667",
			"value": "Kaola Credit"
		},
		{
			"description": "Government technology company. A central square is a place where citizens interact with their government, whether it be at city hall, police or fire station, or a hospital. To square is designed to communicate taking communities to the next level, and the four corners of a square refer to the four businesses that came together to form CentralSquare. CentralSquare emphasizes putting citizens at the center of everything we offer. We partner with more than 7,500 public sector agencies across North America, bringing together two primary drivers for improving people’s lives—technology and government.",
			"meta": {
				"refs": [
					"https://www.centralsquare.com/"
				]
			},
			"uuid": "4f79ae16-0fb3-11ea-8d71-362b9e155667",
			"value": "CentralSquare Technologies"
		},
		{
			"description": "French hotel booking firm.",
			"meta": {
				"refs": [
					"https://www.gekko-group.de/en/"
				]
			},
			"uuid": "4f79b08c-0fb3-11ea-8d71-362b9e155667",
			"value": "Gekko Group"
		},
		{
			"description": "We work with thousands of data science teams as their engineering focused people data partner. These include enterprises like adidas, eBay, and Acxiom, as well as startups like Madison Logic, Zoho, and Workable. We are a deeply technical company, and are backed by two leading engineering venture capital firms - Founders Fund and 8VC.",
			"meta": {
				"refs": [
					"https://www.peopledatalabs.com/"
				]
			},
			"uuid": "4f79b1ea-0fb3-11ea-8d71-362b9e155667",
			"value": "People Data Labs (PDL)"
		},
		{
			"description": "IT outsourcing and consulting company that specializes in supporting healthcare related IT needs.",
			"meta": {
				"refs": [
					"https://www.vcpi.com/"
				]
			},
			"uuid": "4f79b320-0fb3-11ea-8d71-362b9e155667",
			"value": "Virtual Care Provider Inc. (VCPI)"
		},
		{
			"description": "Comprehensive Sleep Care Center with eight locations in Virginia and Maryland are experts in diagnosing and treating the many causes of sleep disorders in both children and adults. Sleep disorders and sleep apnea can have more than one cause, so we offer more than one treatment.",
			"meta": {
				"refs": [
					"https://comprehensivesleepcare.com/"
				]
			},
			"uuid": "d28e1902-1537-11ea-8d71-362b9e155667",
			"value": "Loudoun Medical Group Comprehensive Sleep Care Center (CSCC)"
		},
		{
			"description": "Ivy Rehab Network is made up of 197 physical therapy clinics dedicated to providing exceptional care and personalized treatment to get you feeling better, faster.",
			"meta": {
				"refs": [
					"https://www.ivyrehab.com/"
				]
			},
			"uuid": "d28e1bc8-1537-11ea-8d71-362b9e155667",
			"value": "The Ivy Rehab Network"
		},
		{
			"description": "Prosegur Compania de Seguridad, S.A is a multinational security company, headquartered in Madrid, Spain.",
			"meta": {
				"refs": [
					"https://www.prosegur.com/en/"
				]
			},
			"uuid": "d28e2032-1537-11ea-8d71-362b9e155667",
			"value": "Prosegur Compania de Seguridad, S.A."
		},
		{
			"description": "Magento, an Adobe company, is a leading provider of cloud commerce innovation to merchants and brands across B2C and B2B industries and was recently named a leader in the 2018 Gartner Magic Quadrant for Digital Commerce. In addition to its flagship digital commerce platform, Magento Commerce boasts a strong portfolio of cloud-based omnichannel solutions that empower merchants to successfully integrate digital and physical shopping experiences. Magento Commerce is the #1 provider to the Internet Retailer Top 1000, the B2B 300 and the Top 500 Guides for Europe and Latin America. Magento Commerce is supported by a vast global network of solution and technology partners, a highly active global developer community and the largest eCommerce marketplace for extensions available for download on the Magento Marketplace. More information can be found at www.magento.com.",
			"meta": {
				"refs": [
					"http://www.magento.com/"
				]
			},
			"uuid": "d28e21a4-1537-11ea-8d71-362b9e155667",
			"value": "Magento, an Adobe Company"
		},
		{
			"description": "Business SMS Solutions. Enterprise-grade SMS Texting designed for businesses, universities and colleges. Mass SMS texting solution. Short code texting.",
			"meta": {
				"refs": [
					"https://www.truedialog.com/"
				]
			},
			"uuid": "d28e22e4-1537-11ea-8d71-362b9e155667",
			"value": "TrueDialog.com"
		},
		{
			"description": "The Monash IVF Group is a specialist assisted reproductive technology (ART) and tertiary level diagnostic ultrasound business created through acquisition and growth.The business commenced in 2008 with the purchase of Repromed located in South Australia and the Northern Territory. In 2009, the footprint was expanded significantly in Australia through the acquisition of Monash IVF located in Victoria and Queensland. In 2012 the business expanded into Asia through the acquisition of KL Fertility in Malaysia.  More recently the Monash IVF Group has acquired Fertility East in Bondi Sydney as well as Sydney’s leading provider of tertiary level diagnostic ultrasound, Sydney Ultrasound for Women.",
			"meta": {
				"refs": [
					"http://www.monashivfgroup.com.au/"
				]
			},
			"uuid": "489027f0-16c1-11ea-8d71-362b9e155667",
			"value": "Monash IVF Group"
		},
		{
			"description": "An integrated marketing communications agency based in Atlanta.",
			"meta": {
				"refs": [
					"https://www.linkedin.com/company/deardorff-communications/about/"
				]
			},
			"uuid": "26370046-17b3-11ea-8d71-362b9e155667",
			"value": "Deardorff Communications"
		},
		{
			"description": "HackerOne is a vulnerability coordination and bug bounty platform that connects businesses with penetration testers and cybersecurity researchers.",
			"meta": {
				"refs": [
					"https://www.hackerone.com/"
				]
			},
			"uuid": "6ed183b4-1b67-11ea-978f-2e728ce88125",
			"value": "HackerOne"
		},
		{
			"description": "We are a Pediatric Home Health Agency in the Austin, Dallas Ft. Worth, San Antonio & Houston Victoria areas, and we LOVE kids!!! Our mission is to (1) provide the highest quality pediatric home health therapy services for children in need, and (2) foster an environment that empowers patients, parents and caregivers into higher levels of hope, independence and success. We look forward to helping your child achieve optimum levels of health.",
			"meta": {
				"refs": [
					"http://riverkidstexas.com/"
				]
			},
			"uuid": "6ed18760-1b67-11ea-978f-2e728ce88125",
			"value": "RiverKids Pediatric Home Health"
		},
		{
			"description": "Southeastern Minnesota Oral & Maxillofacial Surgery Associates, providing dental implants, wisdom tooth removal, and more.",
			"meta": {
				"refs": [
					"https://www.semoms.com/"
				]
			},
			"uuid": "5c7f35c0-184d-11ea-8d71-362b9e155667",
			"value": "Southeastern Minnesota Oral & Maxillofacial Surgery"
		},
		{
			"description": "Spartan Technology Solutions offers configurable, flexible case management software solutions for a wide variety of legal applications.  By offering the most user-friendly case flow management solutions in the industry, Spartan is sure to exceed your expectations. Our comprehensive case management solutions automate best practices, mitigate risk of mistakes, save time by creating organized systems for case flow, and save money by reducing necessary resources to manage case loads. Additionally, customized solutions are offered to match specific needs for individual implementations.",
			"meta": {
				"refs": [
					"http://www.spartantechnology.com/"
				]
			},
			"uuid": "ce9b8330-1f8b-11ea-a5e8-2e728ce88125",
			"value": "Spartan Technology Solutions"
		},
		{
			"description": "Epiq, a global leader in the legal services industry, takes on large-scale, increasingly complex tasks for corporate counsel, law firms, and business professionals with efficiency, clarity, and confidence. Clients rely on Epiq to streamline the administration of business operations, class action and mass tort, court reporting, eDiscovery, regulatory, compliance, restructuring, and bankruptcy matters. Epiq subject-matter experts and technologies create efficiency through expertise and deliver confidence to high-performing clients around the world. Learn more at www.epiqglobal.com. ",
			"meta": {
				"refs": [
					"https://www.linkedin.com/company/epiqglobal/",
					"https://www.epiqglobal.com/en-us"
				]
			},
			"uuid": "534ea954-6316-11ea-bc55-0242ac130003",
			"value": "Epiq Global"
		},
		{
			"description": "Antheus Tecnologia Ltda was founded in April 1996 with the objective of developing and placing Brazilian technology on the market in the area of ​​AFIS Systems (Automated Fingerprint Identification Systems). The technological core was obtained from the results of master's theses developed within the Post-Graduate Course in Electrical Engineering and Industrial Informatics at UTFPR - Federal Technological University of Parana.",
			"meta": {
				"refs": [
					"https://www.linkedin.com/company/antheus-tecnologia-ltda./about/"
				]
			},
			"uuid": "1e906dee-686e-11ea-bc55-0242ac130003",
			"value": "Antheus Tecnologia Ltda."
		},
		{
			"description": "Northeast Radiology is the regional leader in high quality, high value outpatient medical imaging. With offices in NY and CT, we offer the full range of diagnostic imaging services including MRI, CT, PET(CT), Mammography, Ultrasound, X-Ray, Biopsies & more.",
			"meta": {
				"refs": [
					"https://www.facebook.com/pg/northeastradiology/about/?ref=page_internal"
				]
			},
			"uuid": "1e90705a-686e-11ea-bc55-0242ac130003",
			"value": "Northeast Radiology"
		},
		{
			"description": "WhisperText LLC develops mobile applications. The Company develops and manages applications that allows users to share their secrets and meet new people. WhisperText operates in California, USA.",
			"meta": {
				"refs": [
					"https://www.bloomberg.com/profile/company/0861925D:US",
					"https://en.wikipedia.org/wiki/Whisper_(app)"
				]
			},
			"uuid": "1e90715e-686e-11ea-bc55-0242ac130003",
			"value": "WhisperText LLC"
		},
		{
			"description": "Consulting services. Brooks International, an award-winning, global professional services firm, delivers significantly enhanced profits and predictable business performance to our CEO clients. We do so by creating and delivering Execution Excellence. We achieve our clients' strategic imperatives by linking financial and operational models.",
			"meta": {
				"refs": [
					"https://brooksint.com/"
				]
			},
			"uuid": "ef6e7556-6d22-11ea-bc55-0242ac130003",
			"value": "Brooks International"
		},
		{
			"description": "Online marketing network that uses affiliations and subscription to generate revenue.",
			"meta": {
				"refs": [
					"https://www.tamodo.com/"
				]
			},
			"uuid": "27da31b6-6eac-11ea-bc55-0242ac130003",
			"value": "Tamodo Marketing Network"
		},
		{
			"description": "HMR is a Contract Research Organisation (CRO). We specialise in and can provide a full service for phase 1 and early phase 2 studies. Our premises are spacious (5995 m²) and have 145 beds, a sleep unit for polysomnography, facilities for volunteers, laboratories, a pharmacy, including an aseptic unit and radiopharmacy, and offices. We have over 250 staff – 10 physicians, 35 nurses or nurse graduates, and over 200 graduates or PhD. We have done over 850 studies since 1993. HMR is one of the largest early-phase CROs in Europe.",
			"meta": {
				"refs": [
					"https://www.linkedin.com/company/hammersmith-medicines-research-ltd",
					"http://www.hmrlondon.com"
				]
			},
			"uuid": "27da3440-6eac-11ea-bc55-0242ac130003",
			"value": "Hammersmith Medicines Research Ltd."
		},
		{
			"description": "Tupperware Brands Corporation, formerly Tupperware Corporation, is an American multinational multi-level marketing company. Its main focus is kitchen and household products, particularly plastic containers for food storage and preparation.",
			"meta": {
				"refs": [
					"https://www.tupperware.com/"
				]
			},
			"uuid": "cb6cab9a-729b-11ea-bc55-0242ac130003",
			"value": "Tupperware Brands Corporation"
		},
		{
			"description": "Dueling Network (commonly abbreviated DN) was an online, unofficial Adobe Flash–based simulation of the Yu-Gi-Oh! Trading Card Game (TCG). It was created by Christopher Salvarani on March 3, 2006 and officially released on May 17, 2011. Its popularity grew quickly and it had gained more than four million registered users. The site was run by in-game volunteer administrators and moderators. At its peak, its server allowed for 9,100 players to be online at the same time. Dueling Network started on May 8, 2011 and officially released on May 17, 2011. After the release, the site's popularity grew quickly, and as of 2013, had acquired more than three million registered users. The site provided users with various in-game messaging systems. From the main menu, players were able to access the Duel Room, construct Decks, check players' rankings and profiles, edit their own profiles and change their account passwords. The game was intended to be a simulation of the real-life card game and as such, was set to be played manually with little in-game automation. It followed official Konami policy as closely as possible.",
			"meta": {
				"refs": [
					"https://en.wikipedia.org/wiki/Dueling_Network"
				]
			},
			"uuid": "cb6cadd4-729b-11ea-bc55-0242ac130003",
			"value": "Dueling Network"
		},
		{
			"description": "BetUS.com.pa is a privately held online gaming company offering sports betting, casino games, and horse racing. As of June 2015, BetUS is a C- rated sportsbook at SportsBookReview.com.",
			"meta": {
				"refs": [
					"https://www.betus.com.pa/"
				]
			},
			"uuid": "cb6caece-729b-11ea-bc55-0242ac130003",
			"value": "BetUS.com.pa"
		},
		{
			"description": "10x Genomics is an American biotechnology company that designs and manufactures gene sequencing technology used in scientific research. It was founded in 2012 by Serge Saxonov, Ben Hindson and Kevin Ness.",
			"meta": {
				"refs": [
					"https://www.10xgenomics.com/"
				]
			},
			"uuid": "fe3c2be6-7754-11ea-bc55-0242ac130003",
			"value": "10x Genomics Inc."
		},
		{
			"description": "Gannett Co., Inc. is an American mass media holding company headquartered in McLean, Virginia in Greater Washington DC. It is the largest U.S. newspaper publisher as measured by total daily circulation. Its assets include the national newspaper USA Today, as well as several local newspapers, including the Detroit Free Press, The Indianapolis Star, The Cincinnati Enquirer, The Tennessean in Nashville, Tennessee, The Courier-Journal in Louisville, Kentucky, the Democrat and Chronicle in Rochester, New York, The Des Moines Register, The Arizona Republic in Phoenix, Arizona, The News-Press in Fort Myers, the Milwaukee Journal Sentinel, and the Great Falls Tribune.",
			"meta": {
				"refs": [
					"https://en.wikipedia.org/wiki/Gannett"
				]
			},
			"uuid": "bdfc7d84-79b0-11ea-bc55-0242ac130003",
			"value": "Gannett, Inc."
		},
		{
			"description": "Key Ring is a smartphone application owned by Gannett, Inc. that allows users to digitally store loyalty cards, enroll in new loyalty programs, receive localized offers on their smartphone, browse weekly sales circulars, and create digital shopping lists.",
			"meta": {
				"refs": [
					"https://en.wikipedia.org/wiki/Key_Ring_(software)"
				]
			},
			"uuid": "bdfc7faa-79b0-11ea-bc55-0242ac130003",
			"value": "Key Ring Mobile App"
		},
		{
			"description": "Email.it Srl ( www.email.it ) is the leading Italian company in the provision of professional e-mail services in the cloud both by subscription (with guaranteed service level) and free of charge, for companies, organizations, free professionals and individuals. The e-mail service on domain @ email.it was launched on the market in March 2001 by DWeb Spa. Email.it srl was established a year later, as a spin-off of the internet activities of Dweb Spa. The shareholders of Email. it are all private Italian citizens and include both the founders, who hold the majority, and the shareholders of pure capital.",
			"meta": {
				"refs": [
					"https://www.email.it/chi-siamo.php"
				]
			},
			"uuid": "bdfc80ae-79b0-11ea-bc55-0242ac130003",
			"value": "Email.it Srl"
		},
		{
			"description": "EVERSANA combines the leading global life science services into an integrated, independent and intelligent commercialization platform. With services rooted in the patient experience and spanning global pricing, market access, marketing, patient support, channel distribution, and consulting, we create value for patients, prescribers and payers at all stages of the product lifecycle.",
			"meta": {
				"refs": [
					"https://www.linkedin.com/company/eversana/about/"
				]
			},
			"uuid": "4eb3663a-7d85-11ea-bc55-0242ac130003",
			"value": "EVERSANA Pharmaceuticals"
		},
		{
			"description": "Brandywine Urology Consultants was established in 1987 and has been serving the urology needs of patients in Delaware, Maryland, Pennsylvania and New Jersey ever since.",
			"meta": {
				"refs": [
					"https://brandywineuc.com/"
				]
			},
			"uuid": "4eb3684c-7d85-11ea-bc55-0242ac130003",
			"value": "Brandywine Urology Consultants"
		},
		{
			"description": "Committed to bringing you the most state of the art imaging in a caring environment. The facility is approximately 8,000 sq. ft. which offers state of the art equipment including CT, MRI, CT Bone Mineral Analysis, Ultrasound, Diagnostic X-ray, Fluoroscopy, and Mammogram. In fact, we have just completed our beautiful Women's Center that includes the Philips Micro-dose Full-Field Digital Mammography unit which uses half the dose of traditional mammography units. Our professionally trained staff is ready to guide you through any imaging services you may require. At Stockdale Radiology we want you to feel at home in a relaxed atmosphere.",
			"meta": {
				"refs": [
					"https://stockdalerad.com/"
				]
			},
			"uuid": "4eb3693c-7d85-11ea-bc55-0242ac130003",
			"value": "Stockdale Radiology"
		},
		{
			"description": "Zoom Video Communications, Inc., otherwise known as Zoom, is an American communications technology company incorporated in Delaware and headquartered in San Jose, California. It provides video, phone, and chat services through a cloud-based and peer-to-peer software platform.",
			"meta": {
				"refs": [
					"https://zoom.us/"
				]
			},
			"uuid": "b065c4fa-7fdc-11ea-bc55-0242ac130003",
			"value": "Zoom Video Communications, Inc."
		},
		{
			"description": "AST is an award-winning full-service enterprise systems integrator, serving clients in the Public and Commercial Sectors for more than two decades.  Clients look to AST for leadership and assistance in systems integration, business process redesign, project management, systems administration, and training.  From on-premise applications to modern cloud technology, AST’s services encompass all aspects of Enterprise Resource Planning, Business Intelligence, Enterprise Performance Management, Customer Experience, and Middleware.  AST also offers flexible Managed Services, supporting the needs of over 200 Public Sector and Commercial customers around the globe.",
			"meta": {
				"refs": [
					"https://www.linkedin.com/company/astllc/"
				]
			},
			"uuid": "8880e9c4-83d8-11ea-bc55-0242ac130003",
			"value": "Applications Software Technology LLC"
		},
		{
			"description": "MNP (previously known as Meyers Norris Penny) is one of the largest full-service chartered accountancy and business advisory firms in Canada. MNP's head office is in Calgary, Alberta, and has offices from Vancouver Island to Halifax. With over 4,500 staff, MNP is currently ranked as one of the largest professional service firms in Canada.",
			"meta": {
				"refs": [
					"https://en.wikipedia.org/wiki/MNP_LLP"
				]
			},
			"uuid": "8880ef78-83d8-11ea-bc55-0242ac130003",
			"value": "MNP LLP"
		},
		{
			"description": "Aptoide is a software marketplace application for installing mobile applications which runs on the Android operating system.[1] In Aptoide, unlike the Android-default Google Play Store, there is not a unique and centralized store; instead, each user manages their own store. The software package is published by Aptoide S.A., a for-profit company incorporated in November 2011 and headquartered in Lisbon, Portugal. There are several versions of the Aptoide app - Aptoide for smartphones and tablets, Aptoide TV – an edition for smart TVs and STBs, Aptoide VR and Aptoide Kids – developed for children's devices. The Android application used to access the stores is open source, and there are several forks such as F-Droid. The communication between the client and servers is done using an open protocol based on XML. The concept is inspired by the APT packaging manager, which can work with multiple sources (repositories). When the user wants a package, they can use the client to search for sources where the application is stored. The name Aptoide is formed from the words APT (the Debian package manager) and oide (the last syllable of Android). As of 2017, the Aptoide platform software had been downloaded about 6 billion times, was used by about 200 million users, and was available in about 40 languages. In the various stores, it is possible to find about 1 million Android apps.",
			"meta": {
				"refs": [
					"https://en.wikipedia.org/wiki/Aptoide"
				]
			},
			"uuid": "8880ec30-83d8-11ea-bc55-0242ac130003",
			"value": "Aptoide S.A."
		},
		{
			"description": "Cognizant is an American multinational corporation that provides IT services, including digital, technology, consulting, and operations services. It is headquartered in Teaneck, New Jersey, United States. Cognizant is part of the NASDAQ-100 and trades under CTSH.",
			"meta": {
				"refs": [
					"https://www.cognizant.com/"
				]
			},
			"uuid": "8880ed2a-83d8-11ea-bc55-0242ac130003",
			"value": "Cognizant"
		},
		{
			"description": "Brandywine Counseling & Community Services (BCCS) is a trusted provider of behavioral health treatment, and prevention, early intervention, and education. Located in Wilmington, DE.",
			"meta": {
				"refs": [
					"https://www.brandywinecounseling.com/"
				]
			},
			"uuid": "8880f04a-83d8-11ea-bc55-0242ac130003",
			"value": "Brandywine Counseling & Community Services (BCCS)"
		},
		{
			"description": "Valve Corporation, also known as Valve Software, is an American video game developer, publisher, and digital distribution company headquartered in Bellevue, Washington.",
			"meta": {
				"refs": [
					"https://en.wikipedia.org/wiki/Valve_Corporation"
				]
			},
			"uuid": "eb7ec75e-8aee-11ea-bc55-0242ac130003",
			"value": "Valve Corporation"
		},
		{
			"description": "SeaChange International is a global, public supplier of video delivery software. SeaChange's Framework includes video processing, back-office, media asset management, dynamic advertisement insertion, analytics and a user interface.",
			"meta": {
				"refs": [
					"https://en.wikipedia.org/wiki/SeaChange_International"
				]
			},
			"uuid": "eb7ec998-8aee-11ea-bc55-0242ac130003",
			"value": "SeaChange International"
		},
		{
			"description": "Nintendo Co., Ltd. is a Japanese multinational consumer electronics and video game company headquartered in Kyoto. Its international branches, Nintendo of America and Nintendo of Europe, are respectively headquartered in Redmond, Washington, and Frankfurt, Germany.",
			"meta": {
				"refs": [
					"https://en.wikipedia.org/wiki/Nintendo"
				]
			},
			"uuid": "eb7ecc4a-8aee-11ea-bc55-0242ac130003",
			"value": "Nintendo Co., Ltd."
		},
		{
			"description": "STAT Informatic Solutions was founded in 2007 by Brian Verhagen - President/CEO, Adam Henderson - COO, and Rosaira Acosta - CBO based on their experience and expertise of document management in the healthcare industry. They recognized the need and importance for a document management company that truly understood the business side of healthcare and how vitally important it is to get the information to the stakeholders in the most timely fashion. The company changed names in 2017 to STAT Informatic Solutions to more broadly and accurately reflect the service offerings of Enterprise Content Management, Release of Information, Revenue Cycle Management, Courier Services and Coding Solutions. STAT Informatic Solutions provides service exclusively to healthcare and truly understands and focuses on the revenue cycle component of record management.",
			"meta": {
				"refs": [
					"https://www.statisllc.com/"
				]
			},
			"uuid": "fbf3c07c-8b06-11ea-bc55-0242ac130003",
			"value": "STAT Informatic Solutions, LLC"
		},
		{
			"description": "Sydney Day Surgery-Prince Alfred is a private free-standing medical facility, providing high quality elective same-day surgery at a reasonable cost. Our goal is to provide a safe, efficient, caring and economical alternative for those people whose surgical needs do not routinely require an overnight hospital stay. Sydney Day Surgery - Prince Alfred provides quality care in a warm personalised setting.",
			"meta": {
				"refs": [
					"http://www.curagroup.com.au/sydney-day-surgery-prince-alfred"
				]
			},
			"uuid": "898ddf3e-8aef-11ea-bc55-0242ac130003",
			"value": "Sydney Day Surgery Prince Alfred Pty. Ltd."
		},
		{
			"description": "Huiying Medical Technology (Beijing) Co., Ltd. researches, develops, manufactures, and distributes medical imaging devices. The Company provides chest radiography devices, aorta AI cloud platform, X-ray fracture devices, CT lung nodule aided diagnosis devices, and other products. Huiying Medical Technology (Beijing) markets its products across worldwide.",
			"meta": {
				"refs": [
					"https://www.bloomberg.com/profile/company/1552847D:CH"
				]
			},
			"uuid": "898de164-8aef-11ea-bc55-0242ac130003",
			"value": "Huiying Medical Technology (Beijing) Co., Ltd."
		},
		{
			"description": "CivicSmart is recognized as a leading global Smart Parking innovator.  With installations in thousands of cities across five continents, we have an 80-year track record of market leadership and earned trust.  Innovation has been at the core of our corporate DNA since Duncan’s founding in 1936, and the last several years have seen a wave of innovation at CivicSmart that is delivering the promise of Smart Parking to cities of all sizes.​",
			"meta": {
				"refs": [
					"https://www.civicsmart.com/"
				]
			},
			"uuid": "898de25e-8aef-11ea-bc55-0242ac130003",
			"value": "CivicSmart, Inc"
		},
		{
			"description": "ExecuPharm, a Parexel Company, is a Global Functional Service Division of the Contract Research Organization, who provides clinical research support services for the pharmaceutical industry.",
			"meta": {
				"refs": [
					"http://www.execupharm.com/"
				]
			},
			"uuid": "898de3da-8aef-11ea-bc55-0242ac130003",
			"value": "ExecuPharm"
		},
		{
			"description": "Architectural firm run by Zaha Hadid, a world renow architect.",
			"meta": {
				"refs": [
					"https://en.wikipedia.org/wiki/Zaha_Hadid"
				]
			},
			"uuid": "dce470c4-8fce-11ea-bc55-0242ac130003",
			"value": "Zaha Hadid Architects (ZHA)"
		},
		{
			"description": "Online research resource.",
			"meta": {
				"refs": [
					"https://www.mail.ee/?language=en"
				]
			},
			"uuid": "dce47416-8fce-11ea-bc55-0242ac130003",
			"value": "Mail.ee"
		},
		{
			"description": "Tokopedia is an Indonesian technology company specializing in e-commerce. It was founded in 2009 by William Tanuwijaya and Leontinus Alpha Edison. It is an Indonesian unicorn along with ride hailing company Gojek, travel service firm Traveloka, e-commerce Bukalapak and fintech company OVO.",
			"meta": {
				"refs": [
					"https://www.tokopedia.com/"
				]
			},
			"uuid": "dce47524-8fce-11ea-bc55-0242ac130003",
			"value": "Tokopedia"
		},
		{
			"description": "Small business accounting firm located in the United Kingdom.",
			"meta": {
				"refs": [
					"https://www.facebook.com/pages/category/Accountant/M-J-Payne-Ltd-165926847330912/"
				]
			},
			"uuid": "dce475f6-8fce-11ea-bc55-0242ac130003",
			"value": "M J Payne Ltd."
		},
		{
			"description": "PeroxyChem is a leading global manufacturer and supplier of hydrogen peroxide, peracetic acid, persulfates and adjacent technologies.",
			"meta": {
				"refs": [
					"http://www.peroxychem.com/"
				]
			},
			"uuid": "dce476be-8fce-11ea-bc55-0242ac130003",
			"value": "PeroxyChem LLC"
		},
		{
			"description": "Elanic is a Bangalore-based E-commerce startup. Bangalore, Karnataka, India.",
			"meta": {
				"refs": [
					"https://www.crunchbase.com/organization/elanic"
				]
			},
			"uuid": "dce4777c-8fce-11ea-bc55-0242ac130003",
			"value": "Elanic"
		},
		{
			"description": "Roblox is an online game platform and game creation system that allows users to design their own games and play a wide variety of different games created by other users.",
			"meta": {
				"refs": [
					"http://corp.roblox.com/"
				]
			},
			"uuid": "dce47844-8fce-11ea-bc55-0242ac130003",
			"value": "Roblox Corporation"
		},
		{
			"description": "Plastic sugeon center that specializes in Oculoplastic and Facial Cosmetic surgery. Bellevue, WA.",
			"meta": {
				"refs": [
					"https://www.kristintarbetmd.com/"
				]
			},
			"uuid": "dce4790c-8fce-11ea-bc55-0242ac130003",
			"value": "Kristin J. Tarbet, MD"
		},
		{
			"description": "Moorestown Visiting Nurses & Hospice provides comprehensive health home care programs to residents of Burlington, Camden and Gloucester Counties in NJ.",
			"meta": {
				"refs": [
					"https://www.moorestownvna.org/"
				]
			},
			"uuid": "73a5de46-953b-11ea-bb37-0242ac130002",
			"value": "Moorestown Visiting Nurse Association"
		},
		{
			"description": "Grubman Shire Meiselas & Sacks is universally recognized as one of the premier entertainment and media law firms in the country, representing the most prominent companies, talent and executives.  As a transactional law firm specializing in all areas of entertainment and media – including music, film, television, live theater, books and magazines, fashion and sports – our ability to advise and service clients in all aspects of their careers and businesses is unparalleled.",
			"meta": {
				"refs": [
					"https://www.linkedin.com/company/grubman-indursky-&-shire-p.c./about/"
				]
			},
			"uuid": "73a5e08a-953b-11ea-bb37-0242ac130002",
			"value": "Grubman Shire Meiselas & Sacks, P.C."
		},
		{
			"description": "Diebold Nixdorf is an American multinational financial and retail technology company that specializes in the sale, manufacture, installation and service of self-service transaction systems (such as ATMs and currency processing systems), point-of-sale terminals, physical security products, and software and related services for global financial, retail, and commercial markets.",
			"meta": {
				"refs": [
					"https://www.dieboldnixdorf.com/"
				]
			},
			"uuid": "73a5e1a2-953b-11ea-bb37-0242ac130002",
			"value": "Diebold Nixdorf"
		},
		{
			"description": "Chatbooks offers photo books which automatically pull photos from Instagram, Facebook, and Camera Roll.",
			"meta": {
				"refs": [
					"https://www.crunchbase.com/organization/chatbooks#section-overview"
				]
			},
			"uuid": "73a5e27e-953b-11ea-bb37-0242ac130002",
			"value": "Chatbooks, Inc."
		},
		{
			"description": "Aeries Software is the benchmark in delivering industry leading student data management system software while providing unequaled customer service and innovative solutions for K-12 education.",
			"meta": {
				"refs": [
					"https://www.aeries.com/about"
				]
			},
			"uuid": "73a5e508-953b-11ea-bb37-0242ac130002",
			"value": "Aeries Student Information System"
		},
		{
			"description": "Ulmon - the maker of TicketLens & CityMaps2Go. TicketLens.com is a powerful price comparison site for attraction tickets, tours, and activities. Find awesome things to do in Rome, Paris, Dubai, and many more. CityMaps2Go offers users offline maps, wishlists and discovery tools to plan their trips.",
			"meta": {
				"refs": [
					"https://www.linkedin.com/company/ulmon/about/"
				]
			},
			"uuid": "08eb2dee-95f0-11ea-bb37-0242ac130002",
			"value": "Ulmon GmbH"
		},
		{
			"description": "Our team is dedicated to the care and treatment of patients in pain. New patients are seen on physician referral only. To help us diagnose and treat, we must have relevant medical records, x-rays, and test reports. We accept most major health insurance plans.",
			"meta": {
				"refs": [
					"https://nspaincare.com/"
				]
			},
			"uuid": "6a92bb52-9acd-11ea-bb37-0242ac130002",
			"value": "North Shore Pain Management"
		},
		{
			"description": "The smartest, simplest contacts app.",
			"meta": {
				"refs": [
					"https://www.crunchbase.com/organization/covve"
				]
			},
			"uuid": "6a92be36-9acd-11ea-bb37-0242ac130002",
			"value": "Covve"
		},
		{
			"description": "As a premier provider for Detroit Wayne Integrated Health Network (DWIHN), PsyGenics offers a full array of services for you or your loved one. PsyGenics believes in the highest quality standards and has earned full accreditation by the Commission on Accreditation of Rehabilitation Facilities (CARF). Services include Supports Coordination, psychological and psychiatric care, behavior modification, peer mentoring, and primary care. PsyGenics offers occupational therapy, speech therapy, individual and family therapy. We also coordinate and assist with supportive housing, skill building, respite services, community living supports as well as guardianship and power of attorney.",
			"meta": {
				"refs": [
					"https://www.psygenics.org/"
				]
			},
			"uuid": "6a92bfb2-9acd-11ea-bb37-0242ac130002",
			"value": "PsyGenics, Inc."
		},
		{
			"description": "Edison Software is a consumer technology company creating artificial intelligence to transform the way people communicate. Based in San Jose, California, Edison is backed by Mayfield and U.S. Venture Partners.",
			"meta": {
				"refs": [
					"https://www.linkedin.com/company/edison-software/about/"
				]
			},
			"uuid": "6a92c12e-9acd-11ea-bb37-0242ac130002",
			"value": "Edison Mail (Edison Software)"
		},
		{
			"description": "Serco Group plc's roots go back to 1929, becoming Serco Limited in 1987 and in 1988 was listed on the London Stock Exchange. Serco specialise in the delivery of essential public services, with over 50,000 people working in defence, transport, justice, immigration, healthcare and other citizen services across our four regions - UK & Europe, North America, Asia Pacific and Middle East.",
			"meta": {
				"refs": [
					"https://www.serco.com/"
				]
			},
			"uuid": "6a92c28c-9acd-11ea-bb37-0242ac130002",
			"value": "Serco Group plc"
		},
		{
			"description": "Japan's largest notebook app with calendar, todo, notebook and diary.",
			"meta": {
				"refs": [
					"https://www.crunchbase.com/organization/lifebear"
				]
			},
			"uuid": "5c02ec6a-a045-11ea-bb37-0242ac130002",
			"value": "Lifebear"
		},
		{
			"description": "The Northwest Atlantic Fisheries Organization is an intergovernmental organization with a mandate to provide scientific advice and management of fisheries in the northwestern part of the Atlantic Ocean. NAFO is headquartered in Dartmouth, Nova Scotia, Canada.",
			"meta": {
				"refs": [
					"https://www.nafo.int/"
				]
			},
			"uuid": "5c02ef4e-a045-11ea-bb37-0242ac130002",
			"value": "The Northwest Atlantic Fisheries Organization"
		},
		{
			"description": "Arbonne International, LLC, known as Arbonne is an international multi-level marketing company founded in 1980 in the United States by Norwegian entrepreneur Petter Morck. Its product lines include vegan skincare, cosmetics, and nutrition. The company had an estimated annual sales revenue of 544 million USD in 2017.",
			"meta": {
				"refs": [
					"https://www.arbonne.com/"
				]
			},
			"uuid": "5c02f048-a045-11ea-bb37-0242ac130002",
			"value": "Arbonne International, LLC"
		},
		{
			"description": "Minted is an online marketplace of independent artists and designers. The company crowdsources art and graphic design through monthly design challenges. The public votes for the winning entries, and Minted produces the winning work as stationery, wall art, and decor.",
			"meta": {
				"refs": [
					"https://www.minted.com/"
				]
			},
			"uuid": "6193295c-a5cb-11ea-bb37-0242ac130002",
			"value": "Minted"
		},
		{
			"description": "Tellus, LLC., is the leading EVV provider/software manufacturer and founding member of the National EVV Association (NEVVA - serving as an industry voice and resource for news, regulatory information, expertise and advocacy efforts related to EVV), providing EVV software and claims processing technology designed specifically for the home health and long-term care markets. We are also contracted directly with multiple states, with exclusivity in Florida. Our clients include several managed care companies including Anthem, Aetna and UnitedHealth Group, amongst others.  Our comprehensive, cloud-based solutions work to simplify, streamline and quickly and easily verify care delivery tasks and process claim data right at the point of care. That means agencies, caregivers and patients can focus their time and attention on what matters most — improved care delivery with better outcomes, greater efficiency and cost reduction.",
			"meta": {
				"refs": [
					"https://4tellus.com/",
					"https://www.linkedin.com/company/4tellus/about/"
				]
			},
			"uuid": "61932bd2-a5cb-11ea-bb37-0242ac130002",
			"value": "Tellus LLC"
		},
		{
			"description": "True Software Scandinavia AB provides application software products. The Company designs and develops mobile applications that enables users to share their phone books, including numbers of pre-paid phones, to create a relevant global directory. True Software Scandinavia primarily operates in Sweden. Truecaller is a smartphone application that has features of caller-identification, call-blocking, flash-messaging, call-recording (on Android up to version 8), Chat & Voice by using the internet. It requires users to provide a standard cellular mobile number for registering with the service. The app is available for Android and iOS.",
			"meta": {
				"refs": [
					"https://en.wikipedia.org/wiki/Truecaller",
					"https://www.truecaller.com/",
					"https://www.bloomberg.com/profile/company/0609540D:SS"
				]
			},
			"uuid": "61932ccc-a5cb-11ea-bb37-0242ac130002",
			"value": "True Software Scandinavia AB (Truecaller)"
		},
		{
			"description": "Joomla is an award-winning content management system (CMS), which enables you to build Web sites and powerful online applications. Joomla is the mobile-ready and user-friendly way to build your website. Choose from thousands of features and designs. Joomla is free and open source. Joomla is an open source project and is freely available to anyone. Our mission is to provide a flexible platform for digital publishing and collaboration.",
			"meta": {
				"refs": [
					"https://www.linkedin.com/company/joomla/about/"
				]
			},
			"uuid": "61932e02-a5cb-11ea-bb37-0242ac130002",
			"value": "Joomla"
		},
		{
			"description": "A global IT services company and excel in cross-border IT services, such as 24 x 7 IT support, IMAC (install, moves, additions, changes) with particular expertise in Telepresence deployments, international network router or switch configuration, installation and troubleshooting, and also specialists in End User Support services.   Many  of our clients are Technology Manufacturers,  IT Service Providers or Systems Integrators who wish to extend the global delivery & support capability.",
			"meta": {
				"refs": [
					"https://www.linkedin.com/company/excis-ltd/about/"
				]
			},
			"uuid": "61932eca-a5cb-11ea-bb37-0242ac130002",
			"value": "Excis Ltd"
		},
		{
			"description": "BHIM is a Indian mobile payment App developed by the National Payments Corporation of India, based on the Unified Payments Interface. Named after B. R.",
			"meta": {
				"refs": [
					"https://www.bhimupi.org.in/"
				]
			},
			"uuid": "1b20223c-a674-11ea-bb37-0242ac130002",
			"value": "BHIM (Bharat Interface for Money)"
		},
		{
			"description": "Marketing company that specializes in lead generation. Munich, Bavaria.",
			"meta": {
				"refs": [
					"https://www.linkedin.com/company/lead.hunter.kg/about/"
				]
			},
			"uuid": "3ffa3ab6-ab47-11ea-bb37-0242ac130002",
			"value": "LEADHUNTER KG"
		},
		{
			"description": "Digital Management, LLC is a provider of mobile enterprise, business intelligence and cybersecurity services. It is headquartered in Bethesda, Maryland, United States. DMI’s clients include several Fortune 1000 commercial enterprises and all U.S. federal government agencies.",
			"meta": {
				"refs": [
					"https://dminc.com/"
				]
			},
			"uuid": "3ffa3ec6-ab47-11ea-bb37-0242ac130002",
			"value": "Digital Management, LLC"
		},
		{
			"description": "Direct mail marketing company. Mequon, WI.",
			"meta": {
				"refs": [
					"http://www.centralfileinc.com/DirectMailContact"
				]
			},
			"uuid": "3ffa3fca-ab47-11ea-bb37-0242ac130002",
			"value": "Central Files, Inc"
		},
		{
			"description": "Zoomcar, is a Indian self-drive car rental company, headquartered in Bangalore, India. The company was founded in 2013 by David Back and Greg Moran. As of April, the company operates in 45 cities across the country.",
			"meta": {
				"refs": [
					"https://www.zoomcar.com/"
				]
			},
			"uuid": "3ffa409c-ab47-11ea-bb37-0242ac130002",
			"value": "Zoomcar"
		},
		{
			"description": "Conduent Inc. is an American business process services company headquartered in New Jersey. It was formed in 2017 as a divestiture from Xerox.",
			"meta": {
				"refs": [
					"https://www.conduent.com/"
				]
			},
			"uuid": "3ffa4164-ab47-11ea-bb37-0242ac130002",
			"value": "Conduent"
		},
		{
			"description": "Chartered Professional Accountants of Canada is the national organization representing the Canadian accounting profession through the unification of the three largest accounting organizations.",
			"meta": {
				"refs": [
					"https://www.cpacanada.ca/"
				]
			},
			"uuid": "000abde4-ab48-11ea-bb37-0242ac130002",
			"value": "Chartered Professional Accountants of Canada"
		},
		{
			"description": "Since opening in 1995, Aeries Software has successfully implemented the Aeries® Student Information System in over 600 California public school districts and education agencies becoming the state's most popular SIS software. Founded by industry pioneer, Jerry D. Lloyd, our unmatched experience in the development, implementation, and support of California K-12 SIS applications enables us to provide superior and cost-effective products and services. Aeries is constantly enhanced to include new features and functionality to meet the needs of California K-12 education.",
			"meta": {
				"refs": [
					"https://www.linkedin.com/company/aeries-software/about/"
				]
			},
			"uuid": "000abfec-ab48-11ea-bb37-0242ac130002",
			"value": "Aeries Software"
		},
		{
			"description": "Government contracting services in test and evaluation, range operations, security management, technical, and administrative support services for DoD and DOE.",
			"meta": {
				"refs": [
					"https://www.linkedin.com/company/westech-international-inc./about/"
				]
			},
			"uuid": "000ac17c-ab48-11ea-bb37-0242ac130002",
			"value": "Westech International, Inc."
		},
		{
			"description": "Our primary goal has remained steadfast over the last 44+ years - to provide the highest quality, exceptional eye care by the most qualified physicians and staff in a compassionate and caring manner. As an independent multi specialty ophthalmic group consisting of 13 ophthalmologists and 3 optometrists, we strive to make your eye care journey to be a comprehensive, informative and a frustration-free experience. Our physicians and staffs work together to bring patients the best and most comprehensive high quality eye care in over 10 conveniently located offices, throughout the tristate area.",
			"meta": {
				"refs": [
					"https://www.everett-hurite.com/"
				]
			},
			"uuid": "000ac262-ab48-11ea-bb37-0242ac130002",
			"value": "Everett & Hurite Ophthalmic Association"
		},
		{
			"description": "Keepnet is a cyber-security awareness and defence platform that provides a holistic approach to people, process and technology to reduce risk.",
			"meta": {
				"refs": [
					"https://www.linkedin.com/company/keepnetlabs/about/"
				]
			},
			"uuid": "af1d6900-b0a0-11ea-b3de-0242ac130004",
			"value": "Keepnet Labs"
		},
		{
			"description": "Property inventory software developer.",
			"meta": {
				"refs": [
					"https://www.inventoryhive.co.uk/"
				]
			},
			"uuid": "af1d6c98-b0a0-11ea-b3de-0242ac130004",
			"value": "Inventory Hive"
		},
		{
			"description": "Threadstone Advisors, LLC operates as a brokerage firm. The Company buys and sells securities such as stocks, bonds, mutual funds, and other investment products. Threadstone Advisors serves customers in the United States.",
			"meta": {
				"refs": [
					"https://www.bloomberg.com/profile/company/1376603D:US#:~:text=Threadstone%20Advisors%20LLC,customers%20in%20the%20United%20States."
				]
			},
			"uuid": "af1d6dc4-b0a0-11ea-b3de-0242ac130004",
			"value": "Threadstone Advisors LLC"
		},
		{
			"description": "Symbotic has developed proprietary and innovative robotics and software to deliver an advanced automation solution to make the supply chain faster, more efficient and more profitable for manufacturers, distributors and retailers of all sizes.",
			"meta": {
				"refs": [
					"https://www.linkedin.com/company/symbotic/about/"
				]
			},
			"uuid": "af1d6ea0-b0a0-11ea-b3de-0242ac130004",
			"value": "Symbotic LLC"
		},
		{
			"description": "DevERP is founded in 2008 and we serve different kinds of IT services. Our company providing professional level software development, customized ERP solution.",
			"meta": {
				"refs": [
					"https://www.linkedin.com/in/deverp-solutions-pvt-ltd-company-286598181/?originalSubdomain=in"
				]
			},
			"uuid": "af1d6f72-b0a0-11ea-b3de-0242ac130004",
			"value": "DevERP Solutions Pvt. Ltd. Company"
		},
		{
			"description": "Avon Products, Inc. is a multi-level marketing company in beauty, household, and personal care categories. Avon had annual sales of $4.7 billion worldwide in 2019. It is the fourteenth-largest beauty company and, with 6.4 million representatives, is the second largest direct-selling enterprise in the world.",
			"meta": {
				"refs": [
					"https://www.avon.com/"
				]
			},
			"uuid": "af1d7044-b0a0-11ea-b3de-0242ac130004",
			"value": "Avon Products, Inc."
		},
		{
			"description": "ARIIX is an international opportunity company that creates superior, exclusively branded products marketed through independent representatives. To promote healthy living, ARIIX develops toxin-free products through collaboration with world-renowned experts in the health, wellness, and fitness industries.",
			"meta": {
				"refs": [
					"https://www.linkedin.com/company/ariix/about/"
				]
			},
			"uuid": "9e0f8bf4-b6e8-11ea-b3de-0242ac130004",
			"value": "ARIIX"
		},
		{
			"description": "Established in 2007, SBTech is an industry-leading provider of interactive sports betting solutions and services to tier 1 operators in regulated markets across online, mobile and land-based channels. The complete offering includes an innovative, dynamic and highly customisable suite of turnkey and fully managed solutions. Our award-winning sportsbook and in-play betting products, comprehensive iGaming platform and premium casino and live casino selection deliver an unparalleled experience.",
			"meta": {
				"refs": [
					"https://www.linkedin.com/company/sbtech/about/"
				]
			},
			"uuid": "9e0f8e56-b6e8-11ea-b3de-0242ac130004",
			"value": "SBTech"
		},
		{
			"description": "Netsential.com Inc provides web site development and promotion services. The Company also provides services such as ongoing support, maintenance, training, and upgradation of the applications.",
			"meta": {
				"refs": [
					"https://www.bloomberg.com/profile/company/1086437D:US"
				]
			},
			"uuid": "9e0f8f5a-b6e8-11ea-b3de-0242ac130004",
			"value": "Netsential.com Inc"
		},
		{
			"description": "As one of Florida’s largest orthopaedic groups, Florida Orthopaedic Institute’s mission is to provide patients with world-class orthopaedic care, achieving exceptional outcomes through continuing research and specialty expertise. All surgeons are fellowship trained, providing a level of care unattainable elsewhere in Tampa Bay.",
			"meta": {
				"refs": [
					"https://www.floridaortho.com/about-us/"
				]
			},
			"uuid": "9e0f902c-b6e8-11ea-b3de-0242ac130004",
			"value": "Florida Orthopaedic Institute"
		},
		{
			"description": "Frost & Sullivan is a business consulting firm involved in market research and analysis, growth strategy consulting, and corporate training across multiple industries. It is headquartered in Mountain View, California, and has 40 offices on six continents.",
			"meta": {
				"refs": [
					"https://ww2.frost.com/"
				]
			},
			"uuid": "9e0f90f4-b6e8-11ea-b3de-0242ac130004",
			"value": "Frost & Sullivan"
		},
		{
			"description": "Preen.Me is a social research, strategy and activation firm providing solutions to CPG CEOs, brand teams, and their investors.",
			"meta": {
				"refs": [
					"https://www.linkedin.com/company/preen-me/about/"
				]
			},
			"uuid": "c2c6ca8a-bbc4-11ea-b3de-0242ac130004",
			"value": "Preen.Me"
		},
		{
			"description": "Xerox Holdings Corporation is an American corporation that sells print and digital document products and services in more than 160 countries. Xerox is headquartered in Norwalk, Connecticut, though its largest population of employees is based around Rochester, New York, the area in which the company was founded.",
			"meta": {
				"refs": [
					"https://www.xerox.com/"
				]
			},
			"uuid": "c2c6cca6-bbc4-11ea-b3de-0242ac130004",
			"value": "Xerox Holdings Corporation "
		},
		{
			"description": "South African based app company that specializes in medical payments and billing.",
			"meta": {
				"refs": [
					"https://logbox.co.za/#/"
				]
			},
			"uuid": "96ed951a-c1e6-11ea-b3de-0242ac130004",
			"value": "LogBox (South Africa)"
		},
		{
			"description": "Xchanging is a provider of technology-enabled business processing, technology and procurement services internationally to customers across many industry sectors.",
			"meta": {
				"refs": [
					"http://www.xchanging.com/about-us"
				]
			},
			"uuid": "96ed9740-c1e6-11ea-b3de-0242ac130004",
			"value": "Xchanging"
		},
		{
			"description": "Zipari. We've pioneered consumer experience technology for health insurance with the power to change an industry. Our platform offers unparalleled insights of every member touchpoint, the most accessible and comprehensive member profiles, and configurable solutions that build on your current technology.",
			"meta": {
				"refs": [
					"https://www.linkedin.com/company/zipari/about/"
				]
			},
			"uuid": "58889674-cce2-11ea-87d0-0242ac130003",
			"value": "Zipari, Inc."
		},
		{
			"description": "Digital design company.",
			"meta": {
				"refs": [
					"https://www.linkedin.com/company/hamilton-brown/about/"
				]
			},
			"uuid": "588898a4-cce2-11ea-87d0-0242ac130003",
			"value": "Hamilton-Brown"
		},
		{
			"description": "Swvl is the premium alternative to public transportation in Egypt. Through our app, you can book fixed rate affordable rides on our existing routes. We offer affordable, quality, convenient and reliable everyday bus rides.",
			"meta": {
				"refs": [
					"https://swvl.com/"
				]
			},
			"uuid": "58889a52-cce2-11ea-87d0-0242ac130003",
			"value": "Swvl, LLC"
		},
		{
			"description": "Twilio is a cloud communications platform as a service company based in San Francisco, California. Twilio allows software developers to programmatically make and receive phone calls, send and receive text messages, and perform other communication functions using its web service APIs.",
			"meta": {
				"refs": [
					"https://www.twilio.com/"
				]
			},
			"uuid": "5ea11e4a-d337-11ea-87d0-0242ac130003",
			"value": "Twilio"
		},
		{
			"description": "Nielsen Holdings plc is an American information, data and measurement firm. Nielsen operates in over 100 countries and employs approximately 44,000 people worldwide. The company is listed on the New York Stock Exchange and is currently a component of the S&P 500.",
			"meta": {
				"refs": [
					"https://en.wikipedia.org/wiki/Nielsen_Holdings"
				]
			},
			"uuid": "5ea12084-d337-11ea-87d0-0242ac130003",
			"value": "Nielsen Holdings plc"
		},
		{
			"description": "Couchsurfing is the world’s premier social travel platform, with over 12 million members in nearly every country in the world. Couchsurfing changes people’s lives. Hearing the stories of Couchsurfers whose lives have been transformed by travel is the greatest reward for doing what we do.",
			"meta": {
				"refs": [
					"https://www.linkedin.com/company/couchsurfing/about/"
				]
			},
			"uuid": "5ea12192-d337-11ea-87d0-0242ac130003",
			"value": "Couchsurfing International"
		},
		{
			"description": "ADIF is a Spanish state-owned railway infrastructure manager under the responsibility of the Ministry of Development, charged with the management of most of Spain's railway infrastructure, that is the track, signaling and stations.",
			"meta": {
				"refs": [
					"https://www.adif.org/"
				]
			},
			"uuid": "5ea12264-d337-11ea-87d0-0242ac130003",
			"value": "Administrador de Infraestructuras Ferroviarias"
		},
		{
			"description": "Promo.com offers access to over 23 million premium video clips and images, ready-made templates, pre-edited licensed music, UNLIMITED clips, UNLIMITED downloads, and an award winning user-friendly online editor.",
			"meta": {
				"refs": [
					"https://www.linkedin.com/company/promodotcom/about/"
				]
			},
			"uuid": "5ea1244e-d337-11ea-87d0-0242ac130003",
			"value": "Promo.com"
		},
		{
			"description": "Waydev analyzes your codebase from Github, Gitlab & Bitbucket, Azure DevOps to help you bring out the best in your engineers work.",
			"meta": {
				"refs": [
					"https://www.linkedin.com/company/waydev/about/"
				]
			},
			"uuid": "f4af88f4-d337-11ea-87d0-0242ac130003",
			"value": "Waydev"
		},
		{
			"description": "We were born in 2011 and today we are the lead online travel agency in Brazil. We are the most influential fanpage in the world, in the travel segment, with over 12 million followers. Despite everything we have built - and we are very proud of what we have already done - we are fully aware that we are just getting started.",
			"meta": {
				"refs": [
					"https://www.linkedin.com/company/hurb/about/"
				]
			},
			"uuid": "f4af8b06-d337-11ea-87d0-0242ac130003",
			"value": "Hurb"
		},
		{
			"description": "Havenly is a convenient, personal and affordable way to redecorate your home room by room. Collaborate with our professional interior designers on our online platform. This is interior design for real people.",
			"meta": {
				"refs": [
					"https://www.linkedin.com/company/havenly/about/"
				]
			},
			"uuid": "9385c7ba-d7eb-11ea-87d0-0242ac130003",
			"value": "Havenly"
		},
		{
			"description": "Appen Limited is a publicly traded company listed on the Australian Securities Exchange under the code APX. Appen provides or improves data used for the development of machine learning and artificial intelligence products.",
			"meta": {
				"refs": [
					"https://appen.com/"
				]
			},
			"uuid": "9385ca08-d7eb-11ea-87d0-0242ac130003",
			"value": "Appen Limited"
		},
		{
			"description": "At PaperlessPay Corporation, we have created the most secure and comprehensive online pay advice portal available in today’s market. Our enhanced delivery technology gives you the capability to provide your employees with multiple secure delivery options - all while saving your company significant operational expense dollars. PaperlessPay Corporation is an outgrowth of a software business founded in 1994 by W. Mark Broughton that was sold in 2008 and became On-Pay Solutions, which still operates today serving large corporations with electronic payments solutions and sservices.",
			"meta": {
				"refs": [
					"http://www.paperlesspaycorp.com/aboutus.html"
				]
			},
			"uuid": "9385cb02-d7eb-11ea-87d0-0242ac130003",
			"value": "PaperlessPay Corporation"
		},
		{
			"description": "Elkins Rehabilitation & Care Center is a special place for a loved one to stay and receive complete compassionate care as they recover from an injury or illness or enter the stages of life in which they are unable to care for themselves. We pride ourselves on the level of care our facility and team provide to ensure that your family member maintains a healthy and full life while they are in our home.",
			"meta": {
				"refs": [
					"https://www.ercc.biz/"
				]
			},
			"uuid": "9385cbd4-d7eb-11ea-87d0-0242ac130003",
			"value": "Elkins Rehabilitation & Care Center"
		},
		{
			"description": "For forward-thinking companies that breathe life into our wardrobes, car interiors, furniture and more, Lectra is committed to crafting the premium technologies they desire. Facilitating the digital transformation of their industry, Lectra empowers brands and manufacturers from design to production, providing them with the market respect and peace of mind they deserve. Founded in 1973, today Lectra has 34 subsidiaries across the globe serving customers in over 100 countries.",
			"meta": {
				"refs": [
					"https://www.linkedin.com/company/lectra/about/"
				]
			},
			"uuid": "9385cca6-d7eb-11ea-87d0-0242ac130003",
			"value": "Lectra"
		},
		{
			"description": "The Blacklist Alliance offers a comprehensive compliance and risk management solution to the lead generation industry and other companies engaged in direct response marketing campaigns - an intensely regulated activity fraught with legal pitfalls. Our proprietary suite of high-performance applications features a robust Litigation Firewall® that reduces the risk and expense of TCPA litigation, dedicated legal support, online compliance training, and sophisticated tools that increase efficiency and enhance compliance. Our company was founded by experienced marketing attorneys and industry professionals, who together created a robust and remarkably effective solution that offers bullet-proof security against predatory litigation, along with a unique online compliance training platform that empowers your employees and sets a new standard in quality.",
			"meta": {
				"refs": [
					"https://www.blacklistalliance.com/"
				]
			},
			"uuid": "ce9368bc-e092-11ea-87d0-0242ac130003",
			"value": "The Blacklist Alliance"
		},
		{
			"description": "The British Dental Association is the professional association and registered trade union organisation for dentists in the United Kingdom. Its stated mission is to promote the interests of members, advance the science, arts and ethics of dentistry and improve the nation’s oral health.",
			"meta": {
				"refs": [
					"https://bda.org/"
				]
			},
			"uuid": "ce936b32-e092-11ea-87d0-0242ac130003",
			"value": "The British Dental Association (BDA)"
		},
		{
			"description": "Sonicbids is the only platform dedicated to helping musicians get gigs.  Festivals, bars, clubs, non-profits and more list opportunities on Sonicbids to have a single, streamlined view of their applicants.  Bands can create their EPK, find replacements for band roles and more for free.  With a subscription, bands can quickly and easily apply to gigs ranging from the biggest festivals to venues around the corner. Backstage, LLC - owner of Backstage.com, Backstage Magazine and Sonicbids.com - is the leading subscription-based digital platform for performing artists - providing tools and content to help performing artists and creative professionals manage their careers, market themselves and open up new opportunities. We are experiencing significant growth and are looking to add a talented members to our team. The company is private equity-backed and has offices in New York City and Los Angeles.",
			"meta": {
				"refs": [
					"https://www.linkedin.com/company/sonicbids/about/"
				]
			},
			"uuid": "3732cbce-e2e1-11ea-87d0-0242ac130003",
			"value": "Sonicbids"
		},
		{
			"description": "The Physical system allows full control over the activities of the sports center, helps maintain contact with those interested and customers, closely monitors entries, purchases, payments, classes, employees, access control and more, using the world's innovative technological means. Physical is the oldest system in Israel (since 1994, with thousands of satisfied users from the north of the country to Eilat. Physical system has current experience in the largest and most professional sports clubs in Israel, as well as international experience in the field of sports club computerization. Management and control of large sports clubs, and computer systems in general, including an in-depth understanding of database management, electronic identification system, electric gates, etc. Physical has replaced dozens of sites and with great success, all systems competing in the Israeli market, while automatically converting data and saving history. The customer at all stages of the upgrade, While emphasizing deep guidance and assimilation at the customer's site, and even advising on improving and streamlining the operation and management of the club, while utilizing the many tools that the system provides. If it is not simple it just will not be.",
			"meta": {
				"refs": [
					"https://www.linkedin.com/company/fizikal/about/"
				]
			},
			"uuid": "3732cdd6-e2e1-11ea-87d0-0242ac130003",
			"value": "Fizikal"
		},
		{
			"description": "Find here at Catho the best job openings. We have more than 150,000 vacancies throughout Brazil. Access Catho and find the perfect spot for you.",
			"meta": {
				"refs": [
					"https://www.catho.com.br/"
				]
			},
			"uuid": "3732ced0-e2e1-11ea-87d0-0242ac130003",
			"value": "Catho"
		},
		{
			"description": "Tandem is an ingenious, fast-moving workforce design and delivery company. We transform the usual service outcomes of large businesses, into exceptional experiences.",
			"meta": {
				"refs": [
					"https://www.linkedin.com/company/isgm---isg-management-pty-ltd-/about/"
				]
			},
			"uuid": "5e9fe6b2-eec9-11ea-adc1-0242ac120002",
			"value": "Tandem Corp"
		},
		{
			"description": "Richard Lugar Center for Public Health Research is a research center based on the National Center for Disease Control and Public Health, which was opened in 2011 and fully exploited in August 2013.",
			"meta": {
				"refs": [
					"https://en.wikipedia.org/wiki/Lugar_Research_Center"
				]
			},
			"uuid": "c7f526e6-f369-11ea-adc1-0242ac120002",
			"value": "Richard Lugar Center for Public Health Research"
		},
		{
			"description": "Cygilant, Inc, is a Boston-based security software-as-a-service company focused on information security and compliance objectives.",
			"meta": {
				"refs": [
					"https://www.cygilant.com/"
				]
			},
			"uuid": "c7f5293e-f369-11ea-adc1-0242ac120002",
			"value": "Cygilant"
		},
		{
			"description": "10 Years of Inmate Communications We are a leading provider of secure inmate communication systems including phones, tablets, investigator tools, video visits, content and more. Telmate serves over 300 correctional facilities in the U.S. and Canada.",
			"meta": {
				"refs": [
					"https://www.telmate.com/"
				]
			},
			"uuid": "c7f52a38-f369-11ea-adc1-0242ac120002",
			"value": "Telmate LLC"
		},
		{
			"description": "Listed on the Singapore Stock Exchange (SGX) in 2003, Silverlake Axis creates technologies to enable the Digital Economy. What sets us apart is the foundation for our computing principles, which are grounded on mathematical models. Through the years, Silverlake Axis has evolved using mathematics to refine, expand and invent technologies, broadening into new industries and markets at the same time.",
			"meta": {
				"refs": [
					"http://www.silverlakeaxis.com/",
					"https://www.linkedin.com/company/silverlake-axis-ltd/about/"
				]
			},
			"uuid": "e8f8c660-f821-11ea-adc1-0242ac120002",
			"value": "Silverlake Axis"
		},
		{
			"description": "SoftServe, Inc., founded in 1993 in Lviv, Ukraine, is a technology company specializing in consultancy services and software development. SoftServe provides services in the fields of Big data, Internet of Things, cloud computing, DevOps, e-commerce, security, and experience design.",
			"meta": {
				"refs": [
					"https://www.softserveinc.com/en-us"
				]
			},
			"uuid": "e8f8c89a-f821-11ea-adc1-0242ac120002",
			"value": "SoftServe, Inc."
		},
		{
			"description": "Artech Information Systems is an IT staffing firm.",
			"meta": {
				"refs": [
					"https://www.artech.com/"
				]
			},
			"uuid": "e8f8c9a8-f821-11ea-adc1-0242ac120002",
			"value": "Artech Information Systems"
		},
		{
			"description": "Automated Retention Marketing Platform.",
			"meta": {
				"refs": [
					"https://www.linkedin.com/company/mailfire"
				]
			},
			"uuid": "57f818ca-fda6-11ea-adc1-0242ac120002",
			"value": "Mailfire"
		},
		{
			"description": "ArbiterSports is the sports officiating software company of the National Collegiate Athletic Association, and is a venture between two NCAA subsidiaries, Arbiter LLC and eOfficials LLC. The company is based in Sandy, Utah.",
			"meta": {
				"refs": [
					"http://www.arbitersports.com/"
				]
			},
			"uuid": "57f819c4-fda6-11ea-adc1-0242ac120002",
			"value": "ArbiterSports"
		},
		{
			"description": "Tyler Technologies, Inc., based in Plano, Texas, is the largest provider of software to the United States public sector. Tyler Technologies has offices in 17 states and one in Toronto, Ontario, Canada.",
			"meta": {
				"refs": [
					"https://www.tylertech.com/"
				]
			},
			"uuid": "423dc520-0323-11eb-adc1-0242ac120002",
			"value": "Tyler Technologies, Inc."
		},
		{
			"description": "Stone Refurb is part of the Stone Group. Supplying IT solutions to Public and Private Sector for over 25 years.",
			"meta": {
				"refs": [
					"https://www.stonerefurb.co.uk/"
				]
			},
			"uuid": "423dc61a-0323-11eb-adc1-0242ac120002",
			"value": "Stone Refurb"
		},
		{
			"description": "ERT is a global company specializing in clinical services and customizable medical devices to biopharmaceutical and healthcare organizations.",
			"meta": {
				"refs": [
					"https://www.ert.com/"
				]
			},
			"uuid": "d5353af0-08a2-11eb-adc1-0242ac120002",
			"value": "eResearchTechnology, Inc."
		},
		{
			"description": "Snewpit is an online platform making news more available, more relevant and more immediate for everyone.",
			"meta": {
				"refs": [
					"https://www.linkedin.com/company/snewpit/about/"
				]
			},
			"uuid": "efd91f98-0e1a-11eb-adc1-0242ac120002",
			"value": "Snewpit"
		},
		{
			"description": "Chowbus is an online and mobile food-ordering platform that curates daily featured dishes from select ethnic restaurants and delivers them hot and fresh directly to your home or office. What makes Chowbus different is the dish-centric ordering experience so consumers can easily explore authentic ethnic food.",
			"meta": {
				"refs": [
					"https://www.linkedin.com/company/chowbus/about/"
				]
			},
			"uuid": "efd9227c-0e1a-11eb-adc1-0242ac120002",
			"value": "Chowbus"
		},
		{
			"description": "Dr. Lal PathLabs Limited is an international service provider of diagnostic and related healthcare tests. Based in Delhi, the company offers a broad range of tests on blood, urine and other human body viscera.",
			"meta": {
				"refs": [
					"https://www.lalpathlabs.com/"
				]
			},
			"uuid": "efd92376-0e1a-11eb-adc1-0242ac120002",
			"value": "Dr. Lal PathLabs Limited"
		},
		{
			"description": "Founded in 1969, Software AG is an enterprise software company with over 10,000 enterprise customers in over 70 countries. The company is the second largest software vendor in Germany, and the seventh largest in Europe.",
			"meta": {
				"refs": [
					"https://www.softwareag.com/en_corporate.html"
				]
			},
			"uuid": "efd92448-0e1a-11eb-adc1-0242ac120002",
			"value": "Software AG"
		},
		{
			"description": "HomeWAV is the leader in providing simple, secure inmate communication solutions. Our patented platform is the first of its kind to satisfy the growing demands in the correctional industry. We partner with detention facilities to deliver flexible solutions that reduce security risks, ease administrative burdens, and deliver much needed revenue streams during a time of heightened regulation.",
			"meta": {
				"refs": [
					"https://www.linkedin.com/company/homewav/about/"
				]
			},
			"uuid": "efd9252e-0e1a-11eb-adc1-0242ac120002",
			"value": "HomeWAV"
		},
		{
			"description": "Online document signing application.",
			"meta": {
				"refs": [
					"https://www.docsketch.com/"
				]
			},
			"uuid": "efd927d6-0e1a-11eb-adc1-0242ac120002",
			"value": "Docsketch"
		},
		{
			"description": "IT solutions company based in Malta.",
			"meta": {
				"refs": [
					"https://www.crunchbase.com/organization/c-planet-malta"
				]
			},
			"uuid": "d5d7483c-1472-11eb-adc1-0242ac120002",
			"value": "C-Planet IT Solutions LTD"
		},
		{
			"description": "Seyfarth Shaw LLP is an international AmLaw 100 law firm headquartered in Chicago, Illinois. Founded in Chicago in 1945 by Henry Seyfarth, Lee Shaw, and Owen Fairweather, Seyfarth Shaw originally focused on the area of labor and employment law.",
			"meta": {
				"refs": [
					"https://www.seyfarth.com/"
				]
			},
			"uuid": "d5d74aa8-1472-11eb-adc1-0242ac120002",
			"value": "Seyfarth Shaw LLP"
		},
		{
			"description": "At The Health and Wellness Clinic we listen first. Our goal is to truly understand why you’re here, look at you as a whole person with many components and recommend and deliver the most conservative and effective natural care. Our diverse collection of practitioners are able to inter-refer if another skill set will assist on your journey to health and wellness. From gut health to low back pain, pregnancy to hormone imbalance and babies to elderly our practitioners can assist with a natural solution. Let us be a part of your journey. Wellness begins with us.",
			"meta": {
				"refs": [
					"https://thehealthandwellnessclinic.com/"
				]
			},
			"uuid": "d5d74bac-1472-11eb-adc1-0242ac120002",
			"value": "The Health And Wellness Clinic"
		},
		{
			"description": "Proctortrack is the only automated proctoring solution that continuously verifies the identity of online test takers.",
			"meta": {
				"refs": [
					"https://www.linkedin.com/showcase/proctortrack/about/"
				]
			},
			"uuid": "d5d74c7e-1472-11eb-adc1-0242ac120002",
			"value": "ProctorTrack"
		},
		{
			"description": "At Verificient Technologies, we utilize artificial intelligence, machine learning, computer visioning and biometrics in forming our Trusted Identity-as-a-Service (TIaaS),a platform for identity verification and authentication. Over the last 5 years, we've become a leader in the industry to deliver continuous identity verification and digital remote monitoring. Weaving these advanced technologies together with user-centered design and award-winning customer service, our patented automated approach, pairs usability with accurate results and true scalability.",
			"meta": {
				"refs": [
					"https://www.linkedin.com/company/verificient-technologies/about/"
				]
			},
			"uuid": "d5d74d46-1472-11eb-adc1-0242ac120002",
			"value": "Verificient Technologies"
		},
		{
			"description": "Ubisoft Entertainment SA is a French video game company headquartered in Montreuil with several development studios across the world. It publishes games for several video game franchises, including Rayman, Raving Rabbids, Prince of Persia, Assassin's Creed, Far Cry, Just Dance, and the Tom Clancy's series.",
			"meta": {
				"refs": [
					"https://www.ubisoft.com/en-us/"
				]
			},
			"uuid": "eacda0c0-1476-11eb-adc1-0242ac120002",
			"value": "Ubisoft Entertainment SA"
		},
		{
			"description": "Crytek GmbH is a German video game developer and software developer based in Frankfurt. Founded by the Yerli brothers in Coburg in 1999 and moved to Frankfurt in 2006, Crytek also operates further studios in Kyiv, Ukraine and Istanbul, Turkey.",
			"meta": {
				"refs": [
					"https://www.crytek.com/"
				]
			},
			"uuid": "eacda37c-1476-11eb-adc1-0242ac120002",
			"value": "Crytek GmbH"
		},
		{
			"description": "Stats Perform is a Chicago-based sports data and analytics company. The company is involved in sports data collection and predictive analysis, and maintains sports-oriented wire services. The company has also been increasingly involved in artificial intelligence and machine learning.",
			"meta": {
				"refs": [
					"https://www.statsperform.com/"
				]
			},
			"uuid": "eacdaaac-1476-11eb-adc1-0242ac120002",
			"value": "Stats Perform"
		},
		{
			"description": "Passavant Memorial Homes (Created in 1895) - A a private, non-profit 501(c)(3), human services provider organization whose mission is to empower individuals with intellectual disabilities and behavioral health needs to live successfully in the community by providing services such as long term structured residences, housing support, adult training facilities, and children's programs.",
			"meta": {
				"refs": [
					"https://www.linkedin.com/company/pmhfos/about/"
				]
			},
			"uuid": "5e66afd8-192a-11eb-adc1-0242ac120002",
			"value": "Passavant Memorial Homes Family of Services"
		},
		{
			"description": "Pfizer Inc. is an American multinational pharmaceutical corporation headquartered in New York City. In 2012, it was one of the world's largest pharmaceutical companies and ranked 57 on the 2018 Fortune 500 list of the largest United States corporations by total revenue.",
			"meta": {
				"refs": [
					"https://www.pfizer.com/"
				]
			},
			"uuid": "5e66b258-192a-11eb-adc1-0242ac120002",
			"value": "Pfizer Inc."
		},
		{
			"description": "MoPub, a Twitter company, is the leading ad server and programmatic exchange for smartphones. We offer a comprehensive monetization platform for mobile app publishers that combines real-time bidding, ad serving, cross-promotional capabilities and ad network mediation into one easy-to-use platform. As a pioneer in real-time bidding for mobile, we built the first transparent market that enables advertisers and other demand side buyers to access billions of ad impressions with hyper-targeted data from app publishers. On MoPub Marketplace, publishers get complete control over their inventory and transparency into their ad revenue.",
			"meta": {
				"refs": [
					"https://www.linkedin.com/company/mopub/about/"
				]
			},
			"uuid": "5e66b3e8-192a-11eb-adc1-0242ac120002",
			"value": "MoPub"
		},
		{
			"description": "Centerstone is a not-for-profit health system providing mental health and substance use disorder treatments. Services are available nationally through the operation of outpatient clinics, residential programs, the use of telehealth and an inpatient hospital. Centerstone also features specialized programs for the military community, therapeutic foster care, children’s services and employee assistance programs. Centerstone’s Research Institute provides guidance through research and technology, leveraging the best practices for use in all our communities. Centerstone’s Foundation secures philanthropic resources to support the work and mission of delivering care that changes people’s lives. For more information, visit www.centerstone.org.",
			"meta": {
				"refs": [
					"https://www.linkedin.com/company/centerstone/about/"
				]
			},
			"uuid": "5e66b53c-192a-11eb-adc1-0242ac120002",
			"value": "Centerstone of Tennessee, Inc."
		},
		{
			"description": "Shionogi & Company, Limited is a Japanese pharmaceutical company best known for developing Crestor. Medical supply and brand name also uses Shionogi. Shionogi has business roots that date back to 1878, and was incorporated in 1919.",
			"meta": {
				"refs": [
					"https://www.shionogi.com/global/en/"
				]
			},
			"uuid": "5e66b6b8-192a-11eb-adc1-0242ac120002",
			"value": "Shionogi & Company, Limited"
		},
		{
			"description": "Dr. Reddy's Laboratories is an Indian multinational pharmaceutical company located in Hyderabad, Telangana, India. The company was founded by Anji Reddy, who previously worked in the mentor institute Indian Drugs and Pharmaceuticals Limited.",
			"meta": {
				"refs": [
					"https://www.drreddys.com/"
				]
			},
			"uuid": "f9070038-192a-11eb-adc1-0242ac120002",
			"value": "Dr. Reddy's Laboratories"
		},
		{
			"description": "Sopra Steria Group SA is a European information technology consultancy established in September 2014 upon the merger of Sopra Group SA and Groupe Steria SCA. Technically, Sopra was the company to adopt the new name, retaining its legal personality.",
			"meta": {
				"refs": [
					"https://www.soprasteria.com/"
				]
			},
			"uuid": "f907025e-192a-11eb-adc1-0242ac120002",
			"value": "Sopra Steria Group SA"
		},
		{
			"description": "ANSA McAL Limited is one of Trinidad and Tobago's largest conglomerates, with several diversified companies in the Caribbean, Europe and North America. It is also traded on the Trinidad and Tobago Stock Exchange as AMCL.",
			"meta": {
				"refs": [
					"https://ansamcal.com/"
				]
			},
			"uuid": "f907034e-192a-11eb-adc1-0242ac120002",
			"value": "ANSA McAL Limited"
		},
		{
			"description": "In 2005, Nitro disrupted the PDF industry by offering the first and leading alternative to Adobe Acrobat. Today, we’re an award-winning global leader in document productivity, digital transformation, and change management. And we’re just getting started.",
			"meta": {
				"refs": [
					"https://www.gonitro.com/about"
				]
			},
			"uuid": "3db5a1b0-1ea5-11eb-adc1-0242ac120002",
			"value": "Nitro Software, Inc."
		},
		{
			"description": "Established in 1951, Fragomen has grown from a respected domestic U.S. immigration law practice to a truly global organization. Our expansion has been a direct result of our strategic decision to establish offices in the markets where our clients would benefit from our on-the-ground presence.",
			"meta": {
				"refs": [
					"https://www.fragomen.com/about"
				]
			},
			"uuid": "3db5a430-1ea5-11eb-adc1-0242ac120002",
			"value": "Fragomen, Del Rey, Bernsen & Loewy, LLP"
		},
		{
			"description": "Helping you get more from your Apple devices and data.",
			"meta": {
				"refs": [
					"https://www.linkedin.com/company/reincubate/about/"
				]
			},
			"uuid": "3db5a52a-1ea5-11eb-adc1-0242ac120002",
			"value": "Reincubate"
		},
		{
			"description": "Technology Management Resources develops and supports CITATION i-Remit lockbox payment processing solutions with integrated receivables reporting for community and regional banks and business banking accounts.  We offer fully in-house, complete outsource and TMR's unique hybrid payment processing solutions. All include our exclusive Business Builder sales and marketing support from payment and banking specialists.",
			"meta": {
				"refs": [
					"https://www.linkedin.com/company/technology-management-resources/about/"
				]
			},
			"uuid": "3db5a606-1ea5-11eb-adc1-0242ac120002",
			"value": "Technology Management Resources"
		},
		{
			"description": "Gunnebo is a multinational corporation headquartered in Gothenburg, Sweden, specialising in security products, services and solutions mainly in the areas of cash management, entrance control, safe storage and integrated security.",
			"meta": {
				"refs": [
					"https://www.gunnebo.com/"
				]
			},
			"uuid": "3db5a6ce-1ea5-11eb-adc1-0242ac120002",
			"value": "Gunnebo Group"
		},
		{
			"description": "Eatigo – Winner of several start up awards and recognized as the Number 1 discounted restaurant reservations platform in South East Asia, Eatigo is the number 1 restaurant reservations platform in South East Asia. We currently have operations in Thailand, Singapore, Malaysia, Hong Kong, India, Philippines, Indonesia and South Korea.",
			"meta": {
				"refs": [
					"https://www.linkedin.com/company/eatigo/about/"
				]
			},
			"uuid": "3db5a94e-1ea5-11eb-adc1-0242ac120002",
			"value": "Eatigo"
		},
		{
			"description": "Gaming Partners International (GPI), a full-service supplier of gaming furniture and equipment for casinos worldwide, was created from joining three of the world’s leading gaming suppliers, Bourgogne et Grasset (BG), Paul-Son Gaming Supplies, and The Bud Jones Company. Gaming Partners International Corporation was formed in 2002 through a reverse merger between Paul-Son Gaming and B&G.  In 2014, GPI acquired Gemaco Inc. further expanding the depth of its product offerings and market reach.  In 2015, GPI purchased the gaming currency portfolio and manufacturing equipment of Dolphin Products Limited and assumed the manufacture and sale of Dolphin branded gaming chips and plaques.",
			"meta": {
				"refs": [
					"https://www.linkedin.com/company/gaming-partners-international-corporation/about/"
				]
			},
			"uuid": "3a6e6e7e-1ec3-11eb-adc1-0242ac120002",
			"value": "Gaming Partners International"
		},
		{
			"description": "DaVita Inc. is a Fortune 500 health care provider focused on transforming care delivery to improve quality of life for patients around the globe. The company is the largest provider of kidney care services in the U.S. and has been a leader in clinical quality and innovation for 20 years. DaVita proudly provides life-saving kidney care for more than 200,000 patients at 2,664 outpatient dialysis centers in the United States. The company also operates 241 outpatient dialysis centers in nine countries across the world.",
			"meta": {
				"refs": [
					"https://www.linkedin.com/company/davita/about/"
				]
			},
			"uuid": "17ab6058-1ec4-11eb-adc1-0242ac120002",
			"value": "DaVita Florissant Dialysis"
		},
		{
			"description": "Alamance Skin Center, the Triad's premier location for high-quality Dermatological Skin Care and Skin Rejuvenation treatments.",
			"meta": {
				"refs": [
					"http://www.alamanceskincenter.com/"
				]
			},
			"uuid": "f9eeed3c-243b-11eb-adc1-0242ac120002",
			"value": "Alamance Skin Center"
		},
		{
			"description": "Lupin Limited is an Indian multinational pharmaceutical company based in Mumbai, Maharashtra, India. It is one of the largest generic pharmaceutical companies by revenue globally. The company's key focus areas include paediatrics, cardiovascular, anti-infectives, diabetology, asthma and anti-tuberculosis.",
			"meta": {
				"refs": [
					"https://www.lupin.com/"
				]
			},
			"uuid": "f9eeef62-243b-11eb-adc1-0242ac120002",
			"value": "Lupin Limited"
		},
		{
			"description": "X-Cart is a commercial open source shopping cart platform distributed through the SaaS solution, or via download package. It was originally released in 2000 by Creative Technologies LLC, a Russian web development company that later worked on Ecwid. Upon release, it was the world's first PHP shopping cart software.",
			"meta": {
				"refs": [
					"https://www.x-cart.com/"
				]
			},
			"uuid": "f9eef05c-243b-11eb-adc1-0242ac120002",
			"value": "X-Cart"
		},
		{
			"description": "Nexia International is a leading, global network of independent accounting and consulting firms, providing a comprehensive portfolio of audit, accountancy, tax and advisory services.",
			"meta": {
				"refs": [
					"https://www.linkedin.com/company/nexia-international/about/"
				]
			},
			"uuid": "1b413228-2a6e-11eb-adc1-0242ac120002",
			"value": "Nexia International"
		},
		{
			"description": "Software developers specialized in management and marketing solutions for tourist establishments. Traditional installation and cloud computing projects. PMS modules, Central Reservations, Channels Manager, Web Booking Engine, Management of Golf Courses and Wellness Centers. Solutions on mobile devices: hotels and restaurants. With extensive experience in the implementation of management systems in hotel organizations of all types and sizes. Offices in Madrid and Barcelona.",
			"meta": {
				"refs": [
					"https://www.linkedin.com/company/prestige-software-s.l./about/"
				]
			},
			"uuid": "1b41357a-2a6e-11eb-adc1-0242ac120002",
			"value": "Prestige Software SL"
		},
		{
			"description": "Dure Technologies mission is to work towards a widespread democratization of data, collecting any form of digital information and making it accessible and useful.",
			"meta": {
				"refs": [
					"https://www.linkedin.com/company/dure-technologies/about/"
				]
			},
			"uuid": "1b4136ec-2a6e-11eb-adc1-0242ac120002",
			"value": "Dure Technologies"
		},
		{
			"description": "Vertafore is the leader in creating modern insurance technology. Every day thousands of insurance agencies, carriers and states use a breadth of Vertafore solutions to grow their businesses, process claims for their customers and much more.",
			"meta": {
				"refs": [
					"https://www.linkedin.com/company/vertafore/about/"
				]
			},
			"uuid": "1b413836-2a6e-11eb-adc1-0242ac120002",
			"value": "Vertafore, Inc."
		},
		{
			"description": "Miltenyi Biotec is a global biotechnology company headquartered near Cologne in Bergisch Gladbach, Germany. The company is a provider of products and services that support scientists, clinical researchers, and physicians across basic research, translational research, and clinical applications.",
			"meta": {
				"refs": [
					"https://www.miltenyibiotec.com/US-en/"
				]
			},
			"uuid": "1b4139c6-2a6e-11eb-adc1-0242ac120002",
			"value": "Miltenyi Biotec"
		},
		{
			"description": "Qualys, Inc. provides cloud security, compliance and related services and is based in Foster City, California.",
			"meta": {
				"refs": [
					"https://www.qualys.com/"
				]
			},
			"uuid": "a3b75c0a-7ebe-11eb-9439-0242ac130002",
			"value": "Qualys, Inc."
		},
		{
			"description": "Netgain is a strategic IT business partner to organizations in the healthcare, financial and legal verticals that require stringent regulatory-compliance adherence. Netgain delivers industry-leading IT security, reliability, mobility, stability and compliance, and also deep vertical expertise to anticipate the unique challenges of your industry.",
			"meta": {
				"refs": [
					"https://www.linkedin.com/company/netgain-technology/"
				]
			},
			"uuid": "a3b75cf0-7ebe-11eb-9439-0242ac130002",
			"value": "Netgain Technology, LLC"
		},
		{
			"description": "SITA is a multinational information technology company providing IT and telecommunication services to the air transport industry. The company provides its services to around 400 members and 2,800 customers worldwide, which it claims is about 90% of the world's airline business.",
			"meta": {
				"refs": [
					"https://www.sita.aero/"
				]
			},
			"uuid": "601174c2-8341-11eb-8dcd-0242ac130003",
			"value": "SITA"
		},
		{
			"description": "Law office located in Essex, United Kingdom.",
			"meta": {
				"refs": [
					"https://www.localsolicitors.com/firm/windsor-croft-solicitors"
				]
			},
			"uuid": "601175b2-8341-11eb-8dcd-0242ac130003",
			"value": "Windsor Croft Solicitors"
		},
		{
			"description": "Verkada builds modern security solutions that help enterprises run safer, smarter buildings. Our mission  Modernize the world of enterprise building security. Verkada’s enterprise security solution combines easy to install security cameras and access control with intelligent, cloud-based software—all in a scalable, user-friendly system. More than 4,500 organizations, including 30 Fortune 500 companies, use Verkada to protect people and assets, secure facilities, and gain new insights that improve the efficiency of their operations. Verkada’s vision is to be the operating system that runs every building in the world. The company was founded by computer scientists and security experts from Stanford University, and Hans Robertson, the former co-founder and COO of Cisco Meraki. Verkada is headquartered in San Mateo, CA with offices in London and Sydney.",
			"meta": {
				"refs": [
					"https://www.linkedin.com/company/verkada/about/"
				]
			},
			"uuid": "6011767a-8341-11eb-8dcd-0242ac130003",
			"value": "Verkada Inc."
		},
		{
			"description": "the7stars is a media agency based in the United Kingdom. Clients include Iceland, Warner Music, Ladbrokes Coral Group, Nintendo and Suzuki. In 2017, Campaign Magazine ranked the7stars the 12th biggest media agency in Britain.",
			"meta": {
				"refs": [
					"https://www.the7stars.co.uk/"
				]
			},
			"uuid": "60117742-8341-11eb-8dcd-0242ac130003",
			"value": "the7stars"
		},
		{
			"description": "From the boardroom to the courtroom, at the seats of government or at a community association meeting, Sachs Sax Caplan, P.L. offers effective legal and business solutions to individuals, businesses, not-for-profit organizations, government agencies and community associations who call Florida home. We have built a significant presence in Florida through dedicated, active involvement and leadership in the professional, legislative and civic communities.",
			"meta": {
				"refs": [
					"https://ssclawfirm.com/about-us/who-we-are"
				]
			},
			"uuid": "519e5cb2-872d-11eb-8dcd-0242ac130003",
			"value": "Sachs Sax Caplan , P.L."
		},
		{
			"description": "Founded in 2009, SEO-Küche Internet Marketing GmbH & Co. KG is one of the 100 leading agencies for online marketing in Germany (iBusiness visibility evaluation). In addition to search engine optimization, our core competencies are in the areas of search engine marketing (SEA), affiliate marketing and social media marketing. We develop innovative and diverse online marketing concepts for a customer group of many satisfied companies from various industries and sizes and implement them successfully and sustainably. Over 100 permanent online marketing experts with specialist knowledge in the areas of SEO, AdWords and Bing, affiliate marketing and social media marketing implement highly complex projects every day. Each of our customers has a permanent contact person, who knows both the project and the customer. Because we attach great importance to short distances as well as fast and individual solutions. Online marketing is subject to very rapid development and constant changes. Through continuous further education, training and certification, our team is always up to date with the latest developments and can thus get the best result for your company. The headquarters of the SEO kitchen in the idyllic Kolbermoor can be reached quickly from both Rosenheim and Munich. We are also available for our customers and interested parties in Munich, Starnberg, Dresden, Erfurt, Berlin, Bochum and Hürth. Our modern office space gives us plenty of space to develop innovative ideas for your company. Just get to know us! We have been a signatory to the Diversity Charter since 2017. This means that good togetherness as well as mutual acceptance and tolerance in the company are important to us. SEO-Küche Internet Marketing GmbH & Co. KG convinces as an employer or partner with a diverse corporate culture and a work environment free of prejudices.",
			"meta": {
				"refs": [
					"https://www.linkedin.com/company/seokueche/about/"
				]
			},
			"uuid": "519e6126-872d-11eb-8dcd-0242ac130003",
			"value": "SEO-Kuche"
		},
		{
			"description": "Medical diagnostic company 2750 Ashton Blvd, Lehi, UT 84043.",
			"meta": {
				"refs": [
					"https://www.bls.gov/iag/tgs/iag54.htm"
				]
			},
			"uuid": "519e6234-872d-11eb-8dcd-0242ac130003",
			"value": "Premier Diagnostics - Lehi"
		},
		{
			"description": "Mobile Anesthesiologists (MA) is the leader in safe, state-of-the-art anesthesia and recovery services for office-based surgical procedures throughout the country.  We provide a Board-Certified/Eligible Anesthesiologists, critical care trained nurses for pre-op and recovery, all anesthesia related drugs, supplies and equipment for the procedure and any possible emergencies.  Our anesthesiologists carry full liability coverage and do not require supervision.  MA provides a customized, turnkey anesthesia service, increasing the quality of care you provide your patients while minimizing unnecessary risk during procedures that require anesthesia.",
			"meta": {
				"refs": [
					"https://www.linkedin.com/company/mobile-anesthesiologist/about/"
				]
			},
			"uuid": "519e6310-872d-11eb-8dcd-0242ac130003",
			"value": "Mobile Anesthesiologists"
		},
		{
			"description": "We rethink and redesign mobility global and holistic. Always with the claim to make the mobility of tomorrow a bit better. For this, we combine German engineering with a high degree of innovation and perception for future topics. The result is exclusive mobility solutions. At 60 locations worldwide, recognised experts develop vehicles and production facilities across national and technical borders and optimise mechanical and technical processes. For the success of our customers.",
			"meta": {
				"refs": [
					"https://www.edag.com/en/"
				]
			},
			"uuid": "d6094a5a-8b12-11eb-8dcd-0242ac130003",
			"value": "EDAG Engineering Group"
		},
		{
			"description": "LINE Corporation is a Tokyo-based subsidiary of Softbank Group and Naver Corporation. The company's business is mainly associated with the development of mobile applications and Internet services, particularly the Line communication app.",
			"meta": {
				"refs": [
					"https://linecorp.com/"
				]
			},
			"uuid": "d6094c9e-8b12-11eb-8dcd-0242ac130003",
			"value": "LINE Corporation"
		},
		{
			"description": "Mimecast Limited is a Jersey-domiciled, UK-headquartered company specializing in cloud-based email management for Microsoft Exchange and Microsoft Office 365, including security, archiving, and continuity services to protect business mail. The company is listed on the NASDAQ.",
			"meta": {
				"refs": [
					"https://www.mimecast.com/"
				]
			},
			"uuid": "d6094d98-8b12-11eb-8dcd-0242ac130003",
			"value": "Mimecast Limited"
		},
		{
			"description": "In order to achieve its objectives, CELG GT conducts studies, prepares projections, researches, plans, builds and operates electricity generation facilities, regardless of the source used and the networks and substations linked to the generation, necessary for connection to the accessed electrical system (transmission or distribution); and transmission facilities, whether or not they belong to the Basic Network, in compliance with specific regulations regarding classification and classification as transmission. Vision To be a company of excellence in the energy generation and transmission business. Mission To act in an entrepreneurial and innovative way in the areas of generation, commercialization and transmission of energy, promoting sustainable development.",
			"meta": {
				"refs": [
					"https://www.linkedin.com/company/celg-gt/about/"
				]
			},
			"uuid": "d6094e6a-8b12-11eb-8dcd-0242ac130003",
			"value": "Celg GT"
		},
		{
			"description": "Edsembli empowers school boards and individual schools to rethink existing processes, reallocate resources to the classroom, and reimagine the student learning experience.",
			"meta": {
				"refs": [
					"https://www.linkedin.com/company/edsembli/about/"
				]
			},
			"uuid": "835d506c-8f36-11eb-8dcd-0242ac130003",
			"value": "edsembli Inc."
		},
		{
			"description": "DeCotiis, FitzPatrick, Cole & Giblin, LLP, is a 60-plus-lawyer, full-service firm headquartered in Teaneck, New Jersey. We are a group of exceptionally skilled, experienced attorneys, who practice in a wide variety of specialties. A partial list of our practice areas includes real estate, labor law, public procurement, litigation, environmental law, public finance, tax, municipal law, government and regulatory affairs, health care law, corporate law, banking, and bankruptcy.",
			"meta": {
				"refs": [
					"https://www.decotiislaw.com/about/"
				]
			},
			"uuid": "835d52ec-8f36-11eb-8dcd-0242ac130003",
			"value": "DeCotiis, FitzPatrick, Cole & Giblin, LLP"
		},
		{
			"description": "Elector Software is a technology company that developed a voting system for Election Campaigns.",
			"meta": {
				"refs": [
					"https://www.crunchbase.com/organization/elector-software"
				]
			},
			"uuid": "9708beee-8f36-11eb-8dcd-0242ac130003",
			"value": "Elector Software"
		},
		{
			"description": "Telsolutions On-Demand, integrated Multi-Channel communications and Cloud based Contact Centre solutions, enable clients to achieve superior business results.",
			"meta": {
				"refs": [
					"https://www.linkedin.com/company/telsolutions-ltd/about/"
				]
			},
			"uuid": "835d55c6-8f36-11eb-8dcd-0242ac130003",
			"value": "Telsolutions Ltd"
		},
		{
			"description": "Jefit is an award winning social workout tracking platform that keeps gym goers stay motivated by tracking and analyzing their fitness goals. Jefit has been downloaded over 8 million times in over 50 countries across the iOS and Android apps and grown to be one of the top health and fitness apps in the app store.",
			"meta": {
				"refs": [
					"https://www.linkedin.com/company/jefit-inc-/about/"
				]
			},
			"uuid": "e02cfbc4-9631-11eb-a8b3-0242ac130003",
			"value": "Jefit Inc."
		},
		{
			"description": "Computer Information Concepts, Inc. is a growing software and professional services firm based in Northern Colorado.  CIC has 35 years of experience servicing and supporting 500 K-12 Education, City and County Government customers from coast to coast.",
			"meta": {
				"refs": [
					"https://www.linkedin.com/company/computer-information-concepts-inc-/about/"
				]
			},
			"uuid": "e02cfdfe-9631-11eb-a8b3-0242ac130003",
			"value": "Computer Information Concepts, Inc."
		},
		{
			"description": "TriTech Software Systems, formerly known as American Tritech, is a public safety software company based in San Diego, California, with offices in San Ramon, California; Hillsboro, Oregon; Decorah, Iowa; Castle Hayne, North Carolina; Melville, New York; Marlborough, Massachusetts; and Montreal, Quebec, Canada.",
			"meta": {
				"refs": [
					"https://www.tritech.com/"
				]
			},
			"uuid": "9f8b5d32-4b3c-11e9-8646-d663bd873d93",
			"value": "TriTech"
		}
	],
	"version": 70
}
