{
	"category": "BLS-NAICS-52",
	"description": "The Finance and Insurance sector comprises establishments primarily engaged in financial transactions (transactions involving the creation, liquidation, or change in ownership of financial assets) and/or in facilitating financial transactions. Three principal types of activities are identified: 1. Raising funds by taking deposits and/or issuing securities and, in the process, incurring liabilities. Establishments engaged in this activity use raised funds to acquire financial assets by making loans and/or purchasing securities. Putting themselves at risk, they channel funds from lenders to borrowers and transform or repackage the funds with respect to maturity, scale, and risk. This activity is known as financial intermediation. 2. Pooling of risk by underwriting insurance and annuities. Establishments engaged in this activity collect fees, insurance premiums, or annuity considerations; build up reserves; invest those reserves; and make contractual payments. Fees are based on the expected incidence of the insured risk and the expected return on investment. 3. Providing specialized services facilitating or supporting financial intermediation, insurance, and employee benefit programs. In addition, monetary authorities charged with monetary control are included in this sector.",
	"name": "BLS-NAICS-52",
	"source": "BLS Industries at a Glance",
	"type": "BLS-NAICS-52",
	"uuid": "ed40c9ee-47ff-11e9-b210-d663bd873d93",
	"values": [{
			"description": "Test place holder",
			"meta": {
				"refs": [
					"https://www.bls.gov/iag/tgs/iag52.htm"
				]
			},
			"uuid": "8467c15a-48c4-11e9-8646-d663bd873d93",
			"value": "Test Finance and Insurance Value"
		},
		{
			"description": "The ING Group is a Dutch multinational banking and financial services corporation headquartered in Amsterdam. Its primary businesses are retail banking, direct banking, commercial banking, investment banking, asset management, and insurance services. ING is an abbreviation for Internationale Nederlanden Groep.",
			"meta": {
				"refs": [
					"https://www.ing.com/Home.htm"
				]
			},
			"uuid": "7879b744-4b22-11e9-8646-d663bd873d93",
			"value": "ING Bank"
		},
		{
			"description": "FirstBank, sometimes referred to as 1STBank, is a Colorado-based and privately held bank and financial services company that owns over 115 FirstBank locations in three states in the Southwestern U.S. - Colorado, Arizona, and California.",
			"meta": {
				"refs": [
					"https://www.efirstbank.com/"
				]
			},
			"uuid": "26396d9c-7bd5-11e9-8f9e-2a86e4085a59",
			"value": "FirstBank Holding Co"
		},
		{
			"description": "First American Financial Corporation is a United States financial services company and is a leading provider of title insurance and settlement services to the real estate and mortgage industries.",
			"meta": {
				"refs": [
					"http://www.firstam.com/index.html"
				]
			},
			"uuid": "5d2fff78-8224-11e9-bc42-526af7764f64",
			"value": "First American Financial Corporation"
		},
		{
			"description": "GateHub is a platform for the Internet of Value, built on XRP Ledger protocol. It allows everyone to send, receive, trade and manage any type of assets.",
			"meta": {
				"refs": [
					"https://gatehub.net/"
				]
			},
			"uuid": "2bcac306-8d40-11e9-bc42-526af7764f64",
			"value": "GateHub"
		},
		{
			"description": "Westpac Banking Corporation, commonly known as Westpac, is an Australian bank and financial-services provider headquartered at Westpac Place in Sydney. ",
			"meta": {
				"refs": [
					"https://www.westpac.com.au/"
				]
			},
			"uuid": "2bcac734-8d40-11e9-bc42-526af7764f64",
			"value": "Westpac Banking Corporation"
		},
		{
			"description": "The Desjardins Group is a Canadian cooperative that is the largest federation of credit unions in North America, and is counted among the Worlds Strongest Banks according to the Banker magazine. It was founded in 1900 in Levis, Quebec by Alphonse Desjardins.",
			"meta": {
				"refs": [
					"https://www.desjardins.com/ca/index.jsp"
				]
			},
			"uuid": "30dc2162-95ee-11e9-bc42-526af7764f64",
			"value": "Desjardins Group"
		},
		{
			"description": "Dominion National offers Select dental plans (same as a DHMO), PPO plans, ePPO plans and dual-choice coverage. In addition, Dominion National also provides full administrative support for strategic partnerships, health plans and Third Party Administrators (TPAs). Dominion National selection of vision plans offers coverage for a wide range of budgets.",
			"meta": {
				"refs": [
					"https://www.dominionnational.com/"
				]
			},
			"uuid": "30dc23f6-95ee-11e9-bc42-526af7764f64",
			"value": "Dominion National"
		},
		{
			"description": "Philadelphia Federal Credit Union is a credit union headquartered in Philadelphia. It is chartered and regulated under the National Credit Union Administration. PFCU is the sixth largest credit union in Philadelphia. PFCU has more than $900 million USD in assets, and over 112,000 members.",
			"meta": {
				"refs": [
					"https://www.pfcu.com/"
				]
			},
			"uuid": "b6e41c86-a5cc-11e9-a2a3-2a2ae2dbcce4",
			"value": "Philadelphia Federal Credit Union"
		},
		{
			"description": "National Australia Bank is one of the four largest financial institutions in Australia in terms of market capitalisation, earnings and customers.",
			"meta": {
				"refs": [
					"https://www.nab.com.au/"
				]
			},
			"uuid": "f6113f3c-b617-11e9-a2a3-2a2ae2dbcce4",
			"value": "National Australia Bank Ltd."
		},
		{
			"description": "Banco Pan, is a Brazilian midsize commercial bank headquartered in São Paulo. The bank main focus is granting consumer loans to individuals of lower to medium income brackets, such as consumer loans, payroll deduction loans, credit cards branded as Visa or MasterCard, insurance products, leasing, and group financial activities.",
			"meta": {
				"refs": [
					"https://www.bancopan.com.br/"
				]
			},
			"uuid": "f6114202-b617-11e9-a2a3-2a2ae2dbcce4",
			"value": "Banco Pan"
		},
		{
			"description": "The Single lending platform where you can get crypto credits, convert or buy crypto. Leverage crypto assets without selling them!",
			"meta": {
				"refs": [
					"https://www.youhodler.com/"
				]
			},
			"uuid": "f611436a-b617-11e9-a2a3-2a2ae2dbcce4",
			"value": "YouHodler"
		},
		{
			"description": "Capital One Financial Corporation is a bank holding company specializing in credit cards, auto loans, banking and savings accounts headquartered in McLean, Virginia. Capital One is ranked 10th on the list of largest banks in the United States by assets.",
			"meta": {
				"refs": [
					"https://www.capitalone.com/"
				]
			},
			"uuid": "f61144aa-b617-11e9-a2a3-2a2ae2dbcce4",
			"value": "Capital One Financial Corporation"
		},
		{
			"description": "Aegon Life Insurance Company is an Indian life insurance provider founded in 2008 with headquarters in Mumbai, offering individual and group insurance online and offline.",
			"meta": {
				"refs": [
					"https://www.aegonlife.com/"
				]
			},
			"uuid": "f6114874-b617-11e9-a2a3-2a2ae2dbcce4",
			"value": "Aegon Life Insurance Company"
		},
		{
			"description": "Monzo Bank Ltd, is a digital, mobile-only bank based in the United Kingdom. Originally operating through a mobile app and a prepaid debit card, in April 2017 their UK banking licence restrictions were lifted, enabling them to offer a current account.",
			"meta": {
				"refs": [
					"https://monzo.com/"
				]
			},
			"uuid": "328bf01a-bf82-11e9-9cb5-2a2ae2dbcce4",
			"value": "Monzo Bank Ltd"
		},
		{
			"description": "State Farm is a large group of insurance and financial services companies throughout the United States with corporate headquarters in Bloomington, Illinois.",
			"meta": {
				"refs": [
					"https://www.statefarm.com/"
				]
			},
			"uuid": "328bf29a-bf82-11e9-9cb5-2a2ae2dbcce4",
			"value": "State Farm"
		},
		{
			"description": "The European Central Bank is the central bank for the euro and administers monetary policy within the Eurozone, which comprises 19 member states of the European Union and is one of the largest monetary areas in the world.",
			"meta": {
				"refs": [
					"https://www.ecb.europa.eu/"
				]
			},
			"uuid": "b0f18ee2-c676-11e9-aa8c-2a2ae2dbcce4",
			"value": "European Central Bank"
		},
		{
			"description": "Mastercard Incorporated is an American multinational financial services corporation headquartered in the Mastercard International Global Headquarters in Purchase, New York, United States. The Global Operations Headquarters is located in O'Fallon, Missouri, United States, a municipality of St. Charles County, Missouri.",
			"meta": {
				"refs": [
					"https://www.mastercard.us/en-us.html"
				]
			},
			"uuid": "b0f19162-c676-11e9-aa8c-2a2ae2dbcce4",
			"value": "Mastercard "
		},
		{
			"description": "Invest in stocks, ETFs, options, and cryptocurrencies, all commission-free, right from your phone or desktop.",
			"meta": {
				"refs": [
					"https://robinhood.com/"
				]
			},
			"uuid": "e87f39be-cb2f-11e9-a1ac-2a2ae2dbcce4",
			"value": "Robinhood Financial LLC"
		},
		{
			"description": "Welcome to Providence Health Plan, a part of the integrated delivery system of Providence Health & Services. We provide or administer health coverage to more than 650,000 members nationwide. We continue to respond to the needs of the community by offering insurance for commercial groups, Medicare, Medicaid, individuals and families. We work with your physicians, hospitals and pharmacies to keep you healthy, and we strive to make your health care affordable.",
			"meta": {
				"refs": [
					"https://healthplans.providence.org/landing/"
				]
			},
			"uuid": "06a6b380-cdb6-11e9-a32f-2a2ae2dbcce4",
			"value": "Providence Health Plan"
		},
		{
			"description": "The American Express Company, also known as Amex, is an American multinational financial services corporation headquartered in Three World Financial Center in New York City. The company was founded in 1850 and is one of the 30 components of the Dow Jones Industrial Average.",
			"meta": {
				"refs": [
					"https://www.americanexpress.com/"
				]
			},
			"uuid": "3d0edb86-e86f-11e9-81b4-2a2ae2dbcce4",
			"value": "American Express"
		},
		{
			"description": "Humana Inc. is a for-profit American health insurance company based in Louisville, Kentucky. As of 2014 Humana had over 13 million customers in the U.S., reported a 2013 revenue of US 41.3 billion, and had 51,600 employees.",
			"meta": {
				"refs": [
					"https://www.humana.com/"
				]
			},
			"uuid": "3d0edf1e-e86f-11e9-81b4-2a2ae2dbcce4",
			"value": "Humana Inc."
		},
		{
			"description": "PJSC Sberbank is a state-owned Russian banking and financial services company headquartered in Moscow. The company was known as Sberbank of Russia until 2015. Sberbank has operations in several European and post-Soviet countries.",
			"meta": {
				"refs": [
					"https://www.sberbank.ru/"
				]
			},
			"uuid": "e472ead8-eea6-11e9-81b4-2a2ae2dbcce4",
			"value": "Sberbank of Russia"
		},
		{
			"description": "Geisinger Health Plan offers a variety of health insurance plans that meet your needs.",
			"meta": {
				"refs": [
					"https://www.geisinger.org/health-plan"
				]
			},
			"uuid": "7f87840a-f818-11e9-8f0b-362b9e155667",
			"value": "Geisinger Health Plan"
		},
		{
			"description": "Wells Fargo & Company is an American multinational financial services company headquartered in San Francisco, California, with central offices throughout the United States. It is the worlds fourth-largest bank by market capitalization and the fourth largest bank in the US by total assets.",
			"meta": {
				"refs": [
					"https://www.wellsfargo.com/"
				]
			},
			"uuid": "7f8786d0-f818-11e9-8f0b-362b9e155667",
			"value": "Wells Fargo & Company"
		},
		{
			"description": "UniCredit S.p.A. is an Italian global banking and financial services company. Its network spans 50 markets in 17 countries, with more than 8,500 branches and over 147,000 employees. Its strategic position in Western and Eastern Europe gives the group one of the region's highest market shares.",
			"meta": {
				"refs": [
					"https://www.unicreditgroup.eu/en.html"
				]
			},
			"uuid": "0845e94c-0333-11ea-8d71-362b9e155667",
			"value": "UniCredit S.p.A."
		},
		{
			"description": "Delta Dental covers 892,000 smiles in Arizona—more than any other dental benefits carrier in the state. With the largest network of dentists locally and nationally, we offer a full-range of plans to fit any budget and any size company. We're part of the Delta Dental Plans Association, the largest dental benefits carrier in the U.S.",
			"meta": {
				"refs": [
					"https://www.deltadentalaz.com/"
				]
			},
			"uuid": "162ac458-096c-11ea-8d71-362b9e155667",
			"value": "Delta Dental of Arizona"
		},
		{
			"description": "Part of the Blue Cross and Blue Shield Association, Florida Blue offers affordable health insurance to Individuals, Businesses, and Medicare.",
			"meta": {
				"refs": [
					"https://www.floridablue.com/"
				]
			},
			"uuid": "162ac7e6-096c-11ea-8d71-362b9e155667",
			"value": "Blue Cross and Blue Shield of Florida"
		},
		{
			"description": "Cayman National Corporation has been providing financial services in the Cayman Islands, locally and internationally to our clients for over thirty years.",
			"meta": {
				"refs": [
					"https://www.caymannational.com/"
				]
			},
			"uuid": "0af2eaf4-1144-11ea-9a9f-362b9e155667",
			"value": "Cayman National Corporation"
		},
		{
			"description": "Upbit is a South Korean cryptocurrency exchange.",
			"meta": {
				"refs": [
					"https://sg.upbit.com/"
				]
			},
			"uuid": "483dfa18-1534-11ea-8d71-362b9e155667",
			"value": "UPbit"
		},
		{
			"description": "Trident Crypto Fund is a crypto investment index fund. Trident Investment strategy is based on well researched Index Strategy and invests exclusively into top 10 underlying crypto assets with the highest market capitalization. Trident Investment strategy has been tested on historical data. With this strategy Trident index got more than 1400% returns in 2017 in comparison of bitcoin's return of near about 800%.",
			"meta": {
				"refs": [
					"https://tridentcryptofund.com/"
				]
			},
			"uuid": "60098318-6315-11ea-bc55-0242ac130003",
			"value": "Trident Crypto Fund"
		},
		{
			"description": "Efficient, dedicated and interactive enrollment. Submit an application to receive the best deals for your merchants. Fast approvals and same day funding. We value our partnerships and offer an unmatched level of professionalism. Contact us today for investment opportunities. Advantage experts work around the clock to bring you the best funding solutions.",
			"meta": {
				"refs": [
					"http://www.advantagecapitalfunding.com/about-us/"
				]
			},
			"uuid": "f9251e0c-691b-11ea-bc55-0242ac130003",
			"value": "Advantage Capital Funding"
		},
		{
			"description": "At Argus Capital Funding, our number one priority is to provide fast working capital to businesses without the hassle and delays of dealing with a traditional bank. We provide solutions for business owners who require capital for their business’ day-to-day operations and expansion opportunities. We help our clients get approved for financing. Many business owners have been denied traditional loans by their banks and other lending institutions. When reviewing your application, we concentrate on your business’s present revenue, future potential and growth, not your personal credit score. We are located in Lower Manhattan, NY. Contact us today to learn more about receiving a Merchant Cash Advance from Argus Capital Funding. With no collateral required, our approval rates for applicants is over 90% and most businesses are funded within 24-72 hours or less.",
			"meta": {
				"refs": [
					"http://www.arguscapitalfunding.com/#aboutus"
				]
			},
			"uuid": "f9252078-691b-11ea-bc55-0242ac130003",
			"value": "Argus Capital Funding"
		},
		{
			"description": "Meezan Bank is the first and largest Islamic commercial Bank of Pakistan. The Bank is headquartered in Meezan House - Karachi, Pakistan. It has a network of over 660 branches in more than 159 cities of Pakistan.",
			"meta": {
				"refs": [
					"https://www.meezanbank.com/"
				]
			},
			"uuid": "913656ca-4b22-11e9-8646-d663bd873d93",
			"value": "Meezan Bank"
		}
	],
	"version": 20
}
