{
  "category": "BLS-NAICS-22",
  "description": "The Utilities sector comprises establishments engaged in the provision of the following utility services: electric power, natural gas, steam supply, water supply, and sewage removal. Within this sector, the specific activities associated with the utility services provided vary by utility: electric power includes generation, transmission, and distribution; natural gas includes distribution; steam supply includes provision and/or distribution; water supply includes treatment and distribution; and sewage removal includes collection, treatment, and disposal of waste through sewer systems and sewage treatment facilities.",
  "name": "BLS-NAICS-22",
  "source": "BLS Industries at a Glance",
  "type": "BLS-NAICS-22",
  "uuid": "66bedebc-4852-11e9-8646-d663bd873d93",
  "values": [
	  {
      "description": "Test place holder",
      "meta": {
        "refs": [
          "https://www.bls.gov/iag/tgs/iag22.htm"
        ]
      },
      "uuid": "634b22a2-4903-11e9-8646-d663bd873d93",
      "value": "Test Utilities Value"
    },
	{
      "description": "Telangana State Power Generation Corporation Limited is a power generating organization of Telangana. It has ceased to do power trading and has retained with powers of controlling system operations of Power Generation after formation of Telangana state.",
      "meta": {
        "refs": [
          "https://www.tssouthernpower.com/"
        ]
      },
      "uuid": "a8180054-7107-11e9-a923-1681be663d3e",
      "value": "Telangana State Power Generation Corporation Limited"
    },
	{
      "description": "LTI Power Systems is a privately held corporation centrally located near Lake Erie in Elyria, OH. LTI Power Systems is a manufacturer of Uninterruptible Power Supplies (UPS).  Our highly experienced staff designs, manufactures, sells and supports our complete product line of single and three phase UPS, Inverters, Rectifiers, Frequency Converters, Static Switches and other power protection equipment.",
      "meta": {
        "refs": [
          "https://www.ltipowersystems.com/"
        ]
      },
      "uuid": "f013e910-6eac-11ea-bc55-0242ac130003",
      "value": "LTI Power Systems"
    },
	{
      "description": "EDP - Energias de Portugal is a Portuguese electric utilities company, headquartered in Lisbon. It was founded in 1976 through the merger of 14 nationalised electricity companies.",
      "meta": {
        "refs": [
          "https://www.edp.com/en"
        ]
      },
      "uuid": "e8e73908-7fdc-11ea-bc55-0242ac130003",
      "value": "Energias de Portugal"
    },
	{
      "description": "The Northwest Territories Power Corporation was established about 1988 to acquire and operate the former Northern Canada Power Commission assets within the Northwest Territories, which at that time also included Nunavut. Seventy-six percent of NTPC's electrical generation is in the form of Hydro electricity.",
      "meta": {
        "refs": [
          "https://www.ntpc.com/"
        ]
      },
      "uuid": "0e2a1380-8fd1-11ea-bc55-0242ac130003",
      "value": "Northwest Territories Power Corporation"
    },
	{
      "description": "Elexon Ltd. provides electricity trading arrangements. The Company offers energy consulting, managing energy systems, and energy services in wholesale electricity market. Elexon operates in the United Kingdom. ELEXON compares how much electricity generators and suppliers say they will produce or consume with actual volumes. We work out a price for the difference and transfer funds. This involves taking 1.25 million meter readings every day.",
      "meta": {
        "refs": [
          "https://www.elexon.co.uk/",
		  "https://www.bloomberg.com/profile/company/3893366Z:LN"
        ]
      },
      "uuid": "210462d6-9acf-11ea-bb37-0242ac130002",
      "value": "Elexon Ltd."
    },
	{
      "description": "Light S.A. is a private public utility company of Rio de Janeiro, Brazil. Founded in 1904 in Toronto, Ontario, Canada by The Rio de Janeiro Tramway, Light and Power Co. Ltd., it was authorized to operate in Brazil in 1905. Research activities of generation, distribution and sale of electricity and each of these areas is represented by a different company. Currently the controlling stake in Light is owned by CEMIG, an electric company based in Belo Horizonte.",
      "meta": {
        "refs": [
          "https://en.wikipedia.org/wiki/Light_S.A."
        ]
      },
      "uuid": "efebd280-c1e6-11ea-b3de-0242ac130004",
      "value": "Light S.A."
    },
	{
      "description": "EDP Renewables North America and its subsidiaries develop, construct, own, and operate wind farms and solar parks throughout North America.",
      "meta": {
        "refs": [
          "https://www.edprnorthamerica.com/"
        ]
      },
      "uuid": "efebd488-c1e6-11ea-b3de-0242ac130004",
      "value": "EDP Renewables North America (EDPR NA)"
    },
	{
      "description": "K-Electric is a Pakistani investor-owned utility managing all three key stages – generation, transmission and distribution – of producing and delivering energy to consumers. This is a Pakistani electric supply company, based in Karachi, Sindh, Pakistan.",
      "meta": {
        "refs": [
          "https://www.ke.com.pk/"
        ]
      },
      "uuid": "62be5e74-f822-11ea-adc1-0242ac120002",
      "value": "K-Electric"
    },
	{
      "description": "An independent renewable energy producer, Albioma is committed to the energy transition thanks to biomass, photovoltaics and geothermal energy.",
      "meta": {
        "refs": [
          "https://www.linkedin.com/company/albioma/about/"
        ]
      },
      "uuid": "c6879e94-b70c-11eb-8529-0242ac130003",
      "value": "Albioma"
    },
	{
      "description": "Andhra Pradesh Power Generation Corporation Limited is power generating organization in Andhra Pradesh. It undertakes operation and maintenance of the power plants and also setting up new power projects alongside upgrading the project's capacity.",
      "meta": {
        "refs": [
          "https://en.wikipedia.org/wiki/Andhra_Pradesh_Power_Generation_Corporation"
        ]
      },
      "uuid": "a81802f2-7107-11e9-a923-1681be663d3e",
      "value": "Andhra Pradesh Power Generation Corporation Limited"
    }
	  ],
	"version": 7
}
