{
	"category": "BLS-NAICS-561",
	"description": "Industries in the Administrative and Support Services subsector group establishments engaged in activities that support the day-to-day operations of other organizations. The processes employed in this sector (e.g., general management, personnel administration, clerical activities, cleaning activities) are often integral parts of the activities of establishments found in all sectors of the economy. The establishments classified in this subsector have specialization in one or more of these activities and can, therefore, provide services to clients in a variety of industries and, in some cases, to households. The individual industries of this subsector are defined on the basis of the particular process that they are engaged in and the particular services they provide.",
	"name": "BLS-NAICS-561",
	"source": "BLS Industries at a Glance",
	"type": "BLS-NAICS-561",
	"uuid": "fb32e1b0-477b-11e9-b210-d663bd873d93",
	"values": [{
			"description": "Test place holder",
			"meta": {
				"refs": [
					"https://www.bls.gov/iag/tgs/iag561.htm"
				]
			},
			"uuid": "78ee7538-477c-11e9-b210-d663bd873d93",
			"value": "Test Administrative and Support Services Value"
		},
		{
			"description": "Wolverine’s core business is to provide solutions that support strategic growth. Our clients utilize our deep knowledge and experience in business-critical communications to connect with their target market – whether business-to-business or business-to-consumer. We advise on the most effective ways to inform their audience – so they will act. We call this conversion. Conversion is the process of target identification, conversation and retention. We simplify processes to create efficient exchanges between our client and their target. We do this by supporting their communications strategy to create, maintain, or expand the consumer relationship.",
			"meta": {
				"refs": [
					"http://www.wolverinemail.com/"
				]
			},
			"uuid": "ff480ba0-4b1c-11e9-8646-d663bd873d93",
			"value": "Wolverine Solutions Group"
		},
		{
			"description": "MiraMed partners with hospitals, health networks, physician practices and related industry service organizations to provide a broad portfolio of customizable solutions to uncover and capitalize on hidden financial opportunities, improve productivity and ultimately increase profits.",
			"meta": {
				"refs": [
					"https://www.miramedgs.com/"
				]
			},
			"uuid": "ff480ea2-4b1c-11e9-8646-d663bd873d93",
			"value": "MiraMed Global Services"
		},
		{
			"description": "MiraMed Revenue Group or MRG is a multinational corporation that specializes in accounts receivable management (ARM), business process outsourcing (BPO), and third-party debt collection. Miramed received consumer complaints alleging violations of the Fair Debt Collection Practices Act (FDCPA), including the use of false or misleading language and threatening to take actions that cannot legally be taken.",
			"meta": {
				"refs": [
					"https://www.lemberglaw.com/miramed-revenue-group-mrg-collections-complaints-calls/"
				]
			},
			"uuid": "ff481136-4b1c-11e9-8646-d663bd873d93",
			"value": "Miramed Revenue Group"
		},
		{
			"description": "We create and deliver solutions to self-insured plans that reduce prescription program expenses and lower drug costs, while providing convenience to patients and improving health outcomes.",
			"meta": {
				"refs": [
					"https://directscripts.com/"
				]
			},
			"uuid": "ff481384-4b1c-11e9-8646-d663bd873d93",
			"value": "Direct Scripts"
		},
		{
			"description": "Organization that helps high schools automate and organize the AP, PSAT/NMSQT and IB exam registration processes since 2007. Our services allow students to register for their high school's tests using an online form customized for their school.",
			"meta": {
				"refs": [
					"https://www.totalregistration.net/"
				]
			},
			"uuid": "20a8d74a-7b4a-11e9-8f9e-2a86e4085a59",
			"value": "Total Registration"
		},
		{
			"description": "Medico, Inc. is a business associate that provides services such as medical billing, medical transcription, medical coding and compliance audits to HIPAA-covered entities. Their medical billing service is advertised as processing 100,000 claims processed monthly for 400+ active healthcare providers and 100+ practices.",
			"meta": {
				"refs": [
					"https://medicoinc.com/"
				]
			},
			"uuid": "5cbcc9aa-abbd-11e9-a2a3-2a2ae2dbcce4",
			"value": "Medico, Inc."
		},
		{
			"description": "Naviance is an American college and career readiness software provider that partners with high schools and other K–12 institutions to provide students with college planning and career assessment tools. The company reports that its products reach more than 7 million students at nearly 8,500 schools in 100 countries.",
			"meta": {
				"refs": [
					"https://www.naviance.com/"
				]
			},
			"uuid": "977cad70-f817-11e9-8f0b-362b9e155667",
			"value": "Naviance"
		},
		{
			"description": "Click2Mail easy to use direct mail tools enable businesses of all sizes to send marketing mail, business mail, personal mail, invoices, postcards and more.",
			"meta": {
				"refs": [
					"https://click2mail.com"
				]
			},
			"uuid": "977cb072-f817-11e9-8f0b-362b9e155667",
			"value": "Click2Mail"
		},
		{
			"description": "Allied Universal is a privately owned facility services company based in the United States. It also offers security systems, janitorial services and staffing. It is a combination of earlier companies - Barton Protective Services, Spectaguard, Initial and Allied Security.",
			"meta": {
				"refs": [
					"https://www.aus.com/"
				]
			},
			"uuid": "41540a12-0fb2-11ea-8d71-362b9e155667",
			"value": "Allied Universal"
		},
		{
			"description": "Started in 2009, Complete Technology Solutions is a complete technology solution provider.  We are one hundred percent committed to making sure business owners have the most reliable and professional IT service. Our team of talented IT professionals can solve your IT nightmares once and for all.",
			"meta": {
				"refs": [
					"https://www.systemconfidence.com/"
				]
			},
			"uuid": "33094c62-1b63-11ea-978f-2e728ce88125",
			"value": "Complete Technology Solutions, CTS, CTS Telecom (Colorado)"
		},
		{
			"description": "Medical billing service in Nether Providence Township, Pennsylvania.",
			"meta": {
				"refs": [
					"https://www.hapusa.com/"
				]
			},
			"uuid": "33094ff0-1b63-11ea-978f-2e728ce88125",
			"value": "Healthcare Administrative Partners"
		},
		{
			"description": "Canon Business Process Services helps clients enable business agility, digital transformation and lead an increasingly evolving workforce. We solve these challenges by leveraging our experienced team backed by Six Sigma expertise and best-in-class technology. With professionals across the US and in the Philippines, we have been named a Global Outsourcing 100 Leader in 2018 by IAOP for the twelfth straight year. Canon Business Process Services is a wholly owned subsidiary of Canon U.S.A., Inc.",
			"meta": {
				"refs": [
					"https://www.linkedin.com/company/canon-business-process-services-inc/"
				]
			},
			"uuid": "59985a26-6eab-11ea-bc55-0242ac130003",
			"value": "Canon Business Process Services"
		},
		{
			"description": "Reportaclaim.net is the gateway for stand alone companies, PEOs, staffing companies, and their clients to submit their First Report of Injury (FROI). Reportaclaim.net was started by risk and claims professionals who have worked in the staffing industry for over 20 years. Having done it right for multiple staffing companies for so long, it was time to create a stand alone business that efficiently handles claims with in the complex framework of a staffing company.",
			"meta": {
				"refs": [
					"http://reportaclaim.net/about.php"
				]
			},
			"uuid": "23d8877a-7d84-11ea-bc55-0242ac130003",
			"value": "Reportaclaim.net"
		},
		{
			"description": "Benefit Recovery Specialists Inc., provides revenue cycle management solutions. The Company offers denial management, billing, bad debt review, accounts receivable, and staffing services to private and government healthcare institutions.",
			"meta": {
				"refs": [
					"https://www.bloomberg.com/profile/company/8203148Z:US"
				]
			},
			"uuid": "cb7ae5a8-d334-11ea-87d0-0242ac130003",
			"value": "Benefits Recovery Specialists Inc."
		},
		{
			"description": "Cwt Global B.V. was founded in 2006. The company's line of business includes arranging and assembling tours for sale through travel agents.",
			"meta": {
				"refs": [
					"https://www.bloomberg.com/profile/company/0165124D:NA"
				]
			},
			"uuid": "8dd27708-e08f-11ea-87d0-0242ac130003",
			"value": "CWT Global B.V."
		},
		{
			"description": "R1 RCM is an American healthcare debt collection company servicing hospitals, health systems and physician groups across the United States.",
			"meta": {
				"refs": [
					"https://www.r1rcm.com/"
				]
			},
			"uuid": "ba597658-e2df-11ea-87d0-0242ac130003",
			"value": "R1 RCM"
		},
		{
			"description": "Experian plc is an Irish-domiciled multinational consumer credit reporting company. Experian collects and aggregates information on over one billion people and businesses including 235 million individual U.S. consumers and more than 25 million U.S. businesses.",
			"meta": {
				"refs": [
					"https://www.experian.com/"
				]
			},
			"uuid": "81e77ffa-eec8-11ea-adc1-0242ac120002",
			"value": "Experian PLC"
		},
		{
			"description": "South African division. Experian plc is an Irish-domiciled multinational consumer credit reporting company. Experian collects and aggregates information on over one billion people and businesses including 235 million individual U.S. consumers and more than 25 million U.S. businesses.",
			"meta": {
				"refs": [
					"https://www.experian.co.za/"
				]
			},
			"uuid": "81e7827a-eec8-11ea-adc1-0242ac120002",
			"value": "Experian PLC (South Africa)"
		},
		{
			"description": "WisePay is a leading supplier of flexible payment, booking and communication services for education.   We streamline finance and administration processes in schools and colleges saving education providers time and money.",
			"meta": {
				"refs": [
					"https://www.linkedin.com/company/wisepay/about/"
				]
			},
			"uuid": "b2e6bf76-0e17-11eb-adc1-0242ac120002",
			"value": "WisePay"
		},
		{
			"description": "Spotless Group Holdings is an Australian listed company that provides Integrated facility services in Australian and New Zealand through a number of in house brands.",
			"meta": {
				"refs": [
					"https://www.spotless.com/"
				]
			},
			"uuid": "31507a3c-1471-11eb-adc1-0242ac120002",
			"value": "Spotless Group Holdings"
		},
		{
			"description": "Timberline Billing Service, LLC was formed in August of 2007 to fill a niche in the Medicaid reimbursement claiming for Iowa school districts. Iowa Medicaid allows for districts to claim reimbursement for covered services. Many districts struggle with the medical claim structure and process, and turn to private vendors for assistance. We are committed to providing excellent customer service to school districts and regional agencies. Since being formed, TBS has grown to become the leader in Medicaid claiming for education agencies in Iowa. This growth, along with our knowledge and expertise, has brought TBS opportunities to expand into Illinois and other states.",
			"meta": {
				"refs": [
					"http://www.timberlinebilling.com/about.html"
				]
			},
			"uuid": "9b1484b6-1928-11eb-adc1-0242ac120002",
			"value": "Timberline Billing Service LLC"
		},
		{
			"description": "ProPath is the largest, nationwide, fully physician-owned pathology practice in the United States. Led by a team of world-class physicians and scientists, ProPath routinely diagnoses cases from 45 states and several foreign countries. Its over 500 employees reside in 10 states and staff labs and facilities in three states. For 55 years, ProPath’s mission has been to provide patient-centered, high quality and effective medical diagnostics, prognostics and research that creates better patient outcomes.",
			"meta": {
				"refs": [
					"https://propath.com/our-company/"
				]
			},
			"uuid": "621932e8-7ebc-11eb-9439-0242ac130002",
			"value": "ProPath Services, LLC"
		},
		{
			"description": "Service provider of medical administrative staffing and management.",
			"meta": {
				"refs": [
					"https://www.phyins.com/magazine/third-path-woodcreek-pediatrics-mary-bridge-childrens-unique-hybrid-model-independence-and",
					"https://opencorporates.com/companies/us_wa/601839437"
				]
			},
			"uuid": "62193838-7ebc-11eb-9439-0242ac130002",
			"value": "Woodcreek Provider Services, LLC"
		},
		{
			"description": "The industry leader in security, Security Industry Specialists offers unique solutions to Fortune 500 companies, international events, and celebrity clients.",
			"meta": {
				"refs": [
					"https://www.linkedin.com/company/security-industry-specialists-inc./"
				]
			},
			"uuid": "c070175a-872a-11eb-8dcd-0242ac130003",
			"value": "Security Industry Specialists, Inc."
		},
		{
			"description": "Healthgrades is dedicated to empowering stronger and more meaningful connections between patients and their healthcare providers. At www.healthgrades.com, we help 30 million consumers a month to find and schedule appointments with their provider of choice. With our scheduling solutions and advanced analytics applications, we help more than 1,500 hospitals across the country to cultivate new patient relationships, improve patient access, and build customer loyalty. At Healthgrades, better health gets a head start.",
			"meta": {
				"refs": [
					"https://www.linkedin.com/company/healthgrades/about/"
				]
			},
			"uuid": "948e37dc-962c-11eb-a8b3-0242ac130003",
			"value": "Healthgrades Operating Company, Inc."
		},
		{
			"description": "Administrative Advantage LLC is located in Savannah, GA, United States and is part of the Government Industry. Administrative Advantage LLC has 51 total employees across all of its locations.",
			"meta": {
				"refs": [
					"https://www.dnb.com/business-directory/company-profiles.administrative_advantage_llc.2ffbe8cc3ee9007a61bde172a3fc88c8.html"
				]
			},
			"uuid": "e53719a4-a2a4-11eb-bcbc-0242ac130002",
			"value": "Administrative Advantage LLC"
		},
		{
			"description": "One of the United States’ largest insurance brokers, with over two-dozen specialty practices, Risk Strategies’ experts deliver a smarter approach to risk and insurance centered on achieving your goals in business and in life.",
			"meta": {
				"refs": [
					"https://www.risk-strategies.com/about"
				]
			},
			"uuid": "ff481514-4b1c-11e9-8646-d663bd873d93",
			"value": "Re-Solutions"
		}
	],
	"version": 10
}
