{
  "category": "BLS-NAICS-492",
  "description": "Industries in the Couriers and Messengers subsector provide intercity and/or local delivery of parcels and documents (including express delivery services) without operating under a universal service obligation. These articles can be described as those that may be handled by one person without using special equipment. This allows the collection, pick-up, and delivery operations to be done with limited labor costs and minimal equipment. Sorting and transportation activities, where necessary, are generally mechanized. The restriction to small parcels partly distinguishes these establishments from those in the transportation industries. The complete network of courier services establishments also distinguishes these transportation services from local messenger and delivery establishments in this subsector. This includes the establishments that perform intercity transportation as well as establishments that, under contract to them, perform local pick-up and delivery. Messengers, which usually deliver within a metropolitan or single urban area, may use bicycle, foot, small truck, or van.",
  "name": "BLS-NAICS-492",
  "source": "BLS Industries at a Glance",
  "type": "BLS-NAICS-492",
  "uuid": "8fa3311c-47f7-11e9-b210-d663bd873d93",
  "values": [
	  {
      "description": "Test place holder",
      "meta": {
        "refs": [
          "https://www.bls.gov/iag/tgs/iag492.htm"
        ]
      },
      "uuid": "894266c4-48c1-11e9-8646-d663bd873d93",
      "value": "Test Couriers and Messengers Value"
    },
	{
      "description": "Colis Prive is the private specialist in home parcel delivery. The company distributed more than 20 million parcels in 2011 and covers 100% of the national territory. Colis Prive is a creative and innovative postal company, managed by e-commerce experts and equipped with the most modern logistics. Colis Prive uses a network of 1,700 subcontractor parcel deliverers and employs 300 people. We have a national hub and 18 regional agencies.",
      "meta": {
        "refs": [
          "https://www.linkedin.com/company/colis-prive/about/"
        ]
      },
      "uuid": "03190fa0-ae70-11eb-8529-0242ac130003",
      "value": "Colis Prive"
    },
	{
      "description": "Canada Post Corporation, trading as Canada Post, is a Crown corporation which functions as the primary postal operator in Canada. Originally known as Royal Mail Canada, rebranding was done to the Canada Post name in the late 1960s, even though it had not yet been separated from the government.",
      "meta": {
        "refs": [
          "https://www.canadapost-postescanada.ca/cpc/en/home.page"
        ]
      },
      "uuid": "6013fd24-c788-11eb-b8bc-0242ac130003",
      "value": "Canada Post Corporation"
    },
	{
      "description": "Home Chef is a Chicago, Illinois-based meal kit and food delivery company that delivers pre-portioned ingredients and recipes to subscribers weekly in the United States. According to the company it delivers three million meals monthly to its subscribers.",
      "meta": {
        "refs": [
          "https://www.homechef.com/"
        ]
      },
      "uuid": "54763c98-a042-11ea-bb37-0242ac130002",
      "value": "Home Chef"
    }
	  ],
	"version": 2
}
