{
  "category": "BLS-NAICS-42",
  "description": "The Wholesale Trade sector comprises establishments engaged in wholesaling merchandise, generally without transformation, and rendering services incidental to the sale of merchandise. The merchandise described in this sector includes the outputs of agriculture, mining, manufacturing, and certain information industries, such as publishing. The wholesaling process is an intermediate step in the distribution of merchandise. Wholesalers are organized to sell or arrange the purchase or sale of (a) goods for resale (i.e., goods sold to other wholesalers or retailers), (b) capital or durable nonconsumer goods, and (c) raw and intermediate materials and supplies used in production. Wholesalers sell merchandise to other businesses and normally operate from a warehouse or office. These warehouses and offices are characterized by having little or no display of merchandise. In addition, neither the design nor the location of the premises is intended to solicit walk-in traffic. Wholesalers do not normally use advertising directed to the general public. Customers are generally reached initially via telephone, in-person marketing, or by specialized advertising that may include Internet and other electronic means. Follow-up orders are either vendor-initiated or client-initiated, generally based on previous sales, and typically exhibit strong ties between sellers and buyers. In fact, transactions are often conducted between wholesalers and clients that have long-standing business relationships.",
  "name": "BLS-NAICS-42",
  "source": "BLS Industries at a Glance",
  "type": "BLS-NAICS-42",
  "uuid": "307ebf1e-4854-11e9-8646-d663bd873d93",
  "values": [
	  {
      "description": "Test place holder",
      "meta": {
        "refs": [
          "https://www.bls.gov/iag/tgs/iag42.htm"
        ]
      },
      "uuid": "7dd77bfa-4905-11e9-8646-d663bd873d93",
      "value": "Test Wholesale Trade Value"
    },
	{
      "description": "Ardagh Group is a Luxembourg-based producer of glass and metal products that has grown in the past two decades into one of the world’s largest metal and glass packaging companies.",
      "meta": {
        "refs": [
          "https://www.ardaghgroup.com/"
        ]
      },
      "uuid": "ef2b9ece-bfb1-11eb-8529-0242ac130003",
      "value": "Ardagh Group"
    },
	{
      "description": "Brenntag SE is a German chemical distribution company founded in 1874 in Berlin. The company is Headquartered in Essen, Germany and has operations in more than 77 countries worldwide.",
      "meta": {
        "refs": [
          "https://www.brenntag.com/"
        ]
      },
      "uuid": "583f77aa-bc9c-11eb-8529-0242ac130003",
      "value": "Brenntag SE"
    }
	  ],
	"version": 1
}
