{
  "category": "BLS-NAICS-23",
  "description": "The construction sector comprises establishments primarily engaged in the construction of buildings or engineering projects (e.g., highways and utility systems). Establishments primarily engaged in the preparation of sites for new construction and establishments primarily engaged in subdividing land for sale as building sites also are included in this sector. Construction work done may include new work, additions, alterations, or maintenance and repairs. Activities of these establishments generally are managed at a fixed place of business, but they usually perform construction activities at multiple project sites. Production responsibilities for establishments in this sector are usually specified in (1) contracts with the owners of construction projects (prime contracts) or (2) contracts with other construction establishments (subcontracts).",
  "name": "BLS-NAICS-23",
  "source": "BLS Industries at a Glance",
  "type": "BLS-NAICS-23",
  "uuid": "7ca733f2-47f6-11e9-b210-d663bd873d93",
  "values": [
	  {
      "description": "Test place holder",
      "meta": {
        "refs": [
          "https://www.bls.gov/iag/tgs/iag23.htm"
        ]
      },
      "uuid": "ead20472-48c0-11e9-8646-d663bd873d93",
      "value": "Test Construction Value"
    },
	{
      "description": "Interserve is a multinational group of support services and construction companies based in the UK, with a revenue of £2.7 billion in 2018 and a workforce of 68,000 people worldwide. The group has its headquarters in Reading, Berkshire.",
      "meta": {
        "refs": [
          "https://www.interserve.com/"
        ]
      },
      "uuid": "5e7a0714-9acb-11ea-bb37-0242ac130002",
      "value": "Interserve"
    },
	{
      "description": "Cmc, since 1901. Founded in Ravenna in 1901, Cooperativa Muratori e Cementisti – Cmc di Ravenna is an Italian leading construction company. Cmc is competitive in the domestic market of large construction projects and public works (major infrastructural projects, public buildings, marine works), of railway projects (particularly high speed) and of private projects (shopping malls, hotels and resorts).",
      "meta": {
        "refs": [
          "https://www.linkedin.com/company/cooperativa-muratori-e-cementisti-di-ravenna/about/"
        ]
      },
      "uuid": "388f4d04-1e9f-11eb-adc1-0242ac120002",
      "value": "Cooperativa Muratori e Cementisti – Cmc di Ravenna"
    },
	{
      "description": "At Ansal Housing, it is our mission to design, build & market residential and commercial complexes of international quality while assuring the highest possible level of satisfaction for our valued customers. Over the last 35 years, we have already completed development of about 76 million square feet of area across India including landmarks like Vikas Minar & Statesman House in Delhi, North India's first factory outlet mall Ansal Plaza in Ghaziabad, Aashiana in Lucknow, amongst several others. Ansal Housing has always been the forerunner of real estate development in Tier II and Tier III cities such as Meerut, Ghaziabad, Karnal, Alwar, Jammu, etc. We have catered to the vast demand for residential and commercial development in these cities for over 35 years proudly bringing them today to an international standard of living. Ansal Housing, a pioneer in understanding and meeting the market demand has today positioned itself as one of the leading developers in Gurugram, the new hub of Corporate India. With increase in disposable income, rising aspirations of young professionals and an enormous inflow of MNCs there is a spurt in demand for high-end residences as well as commercial complexes in Gurugram. Ansal Housing already has 8 projects in Gurugram with over 6 million square feet of space under development. Our portfolio in Gurugram is constantly expanding to meet the increasing demand. Pan - India the company is presently executing projects worth over Rs. 6400 crores with 27 million square feet of area under development, including about 12 million square feet of built-up area.",
      "meta": {
        "refs": [
          "http://www.ansals.com/corporate/corporate-about-us.asp?links=overview"
        ]
      },
      "uuid": "e5371bb6-a2a4-11eb-bcbc-0242ac130002",
      "value": "Ansal Housing & Construction Ltd."
    },
	{
      "description": "Betenbough Homes, West Texas number one new home builder, was founded in 1992 when father and son Ron and Rick Betenbough teamed up to deliver quality new homes at the most competitive price. Based in Lubbock, Texas, Betenbough Homes has built more than 7,000 homes in communities across West Texas and is committed to providing more home for less money. Betenbough Homes is an employee-owned company committed to build, serve and impact the communities it calls home. Ranked among the Top 100 Builders in the nation by Builder magazine, the company was also named a 2017 Guildmaster by GuildQuality for consistently superior customer service.  In addition, the company has earned several Texas Association of Builders Star Awards in 2015 and 2016, and multiple local awards throughout the years.",
      "meta": {
        "refs": [
          "https://www.linkedin.com/company/betenbough-homes/about/"
        ]
      },
      "uuid": "0f00deb4-bfb0-11eb-8529-0242ac130003",
      "value": "Betenbough Homes"
    },
	{
      "description": "EMCOR Group is a Fortune 500 company based in Norwalk, Connecticut, USA. EMCOR provides mechanical and electrical construction, industrial and energy infrastructure and facilities services to a broad range of commercial, industrial, utility and institutional customers. EMCOR comprises 80 or more operating companies, has approximately 170 locations and employs more than 33,000 people. The company was listed as number 375 on the 2018 Fortune 500 list.",
      "meta": {
        "refs": [
          "https://emcorgroup.com/",
		  "https://en.wikipedia.org/wiki/Emcor"
        ]
      },
      "uuid": "a59eade6-6314-11ea-bc55-0242ac130003",
      "value": "EMCOR Group"
    }
	  ],
	"version": 4
}
