{
  "category": "BLS-NAICS-48-49",
  "description": "The Transportation and Warehousing sector includes industries providing transportation of passengers and cargo, warehousing and storage for goods, scenic and sightseeing transportation, and support activities related to modes of transportation. Establishments in these industries use transportation equipment or transportation related facilities as a productive asset. The type of equipment depends on the mode of transportation. The modes of transportation are air, rail, water, road, and pipeline.",
  "name": "BLS-NAICS-48-49",
  "source": "BLS Industries at a Glance",
  "type": "BLS-NAICS-48-49",
  "uuid": "c8c0318e-4851-11e9-8646-d663bd873d93",
  "values": [
	  {
      "description": "Test place holder",
      "meta": {
        "refs": [
          "https://www.bls.gov/iag/tgs/iag48-49.htm"
        ]
      },
      "uuid": "ca46d3da-4902-11e9-8646-d663bd873d93",
      "value": "Test Transportation and Warehousing Value"
    },
	{
      "description": "The Toll Group is an Australian transportation and logistics company with operations in road, rail, sea, air and warehousing. It has three divisions; Global Express, Global Forwarding, Global Logistics. It is a subsidiary of Japan Post Holdings.",
      "meta": {
        "refs": [
          "https://www.tollgroup.com/"
        ]
      },
      "uuid": "0e2a116e-8fd1-11ea-bc55-0242ac130003",
      "value": "Toll Group"
    },
	{
      "description": "DoorDash Inc. is a San Francisco–based on-demand food delivery service founded in 2013 by Stanford students Andy Fang, Stanley Tang, Tony Xu and Evan Moore. A Y Combinator–backed company, DoorDash is one of several technology companies that uses logistics services to offer food delivery from restaurants on-demand.",
      "meta": {
        "refs": [
          "https://www.doordash.com/"
        ]
      },
      "uuid": "877bd0e8-e180-11e9-81b4-2a2ae2dbcce4",
      "value": "DoorDash Inc."
    },
	{
      "description": "San Francisco International Airport is an international airport near San Bruno and Millbrae in unincorporated San Mateo County. It is 13 miles south of downtown San Francisco, California, It has flights to points throughout North America and is a major gateway to Europe and Asia.",
      "meta": {
        "refs": [
          "https://www.flysfo.com/"
        ]
      },
      "uuid": "f98034de-7d8b-11ea-bc55-0242ac130003",
      "value": "San Francisco International Airport (SFO)"
    },
	{
      "description": "The National Railroad Passenger Corporation, doing business as Amtrak, is a passenger railroad service that provides medium and long-distance intercity service in the contiguous United States and to nine Canadian cities.",
      "meta": {
        "refs": [
          "https://www.amtrak.com/home"
        ]
      },
      "uuid": "bdc6aef0-a5cc-11ea-bb37-0242ac130002",
      "value": "The National Railroad Passenger Corporation (Amtrak)"
    },
	{
      "description": "Dunzo is an Indian company that provides delivery services in Bengaluru, Delhi, Gurugram, Pune, Chennai, Jaipur, Mumbai and Hyderabad. The company also operates a Bike Taxi service in Gurugram. It is headquartered in Bengaluru, India. In 2017, it was funded by Google.",
      "meta": {
        "refs": [
          "https://www.dunzo.com/"
        ]
      },
      "uuid": "f7a08456-cce2-11ea-87d0-0242ac130003",
      "value": "Dunzo"
    },
	{
      "description": "Instacart is an American company that operates a grocery delivery and pick-up service in the United States and Canada with headquarters in San Francisco.",
      "meta": {
        "refs": [
          "https://www.instacart.com/"
        ]
      },
      "uuid": "b7e6c7c4-d338-11ea-87d0-0242ac130003",
      "value": "Instacart"
    },
	{
      "description": "Manitoulin Transport is a leading Canadian transportation and logistics solutions provider.  As a single-source carrier, we offer a wide array of transportation services, including expedited-over-the-road LTL/TL, transborder, intermodal, private fleet, guaranteed service, temperature controlled and dangerous goods. Manitoulin leverages its extensive network to deliver services to major rural and urban areas.   Our North American distribution covers more than 60 Canadian terminals and over 250 U.S. service centres.  The Manitoulin network is supported by its state-of-the-art technology by providing 24/7 online shipping assistance.",
      "meta": {
        "refs": [
          "https://www.linkedin.com/company/manitoulin-transport"
        ]
      },
      "uuid": "27e12ec8-fda7-11ea-adc1-0242ac120002",
      "value": "Manitoulin Transport"
    },
	{
      "description": "Our company is a subsidiary of the Austrian Post with stable international background, one of the most important domestic courier service provider in next day guaranteed delivery. With goal of express delivery from door to door in 24 hours, our employees give their utmost best in handling packages that come our way. Our job is completed when both customers and business partners are satisfied with our work. By continuously upgrading our technology and educating our employees, Overseas Express is striving to fulfill customers expectation.",
      "meta": {
        "refs": [
          "https://www.linkedin.com/company/overseas-trade-co.-ltd.-d.o.o.?trk=similar-pages_result-card_full-click"
        ]
      },
      "uuid": "27e13152-fda7-11ea-adc1-0242ac120002",
      "value": "Overseas Trade Co., Ltd. d.o.o."
    },
	{
      "description": "CMA CGM S.A. is a French container transportation and shipping company. It is a leading worldwide shipping group, using 200 shipping routes between 420 ports in 150 different countries, ranking fourth behind Maersk Line, MSC and COSCO Shipping Lines.",
      "meta": {
        "refs": [
          "https://www.cma-cgm.com/"
        ]
      },
      "uuid": "d5353fe6-08a2-11eb-adc1-0242ac120002",
      "value": "CMA CGM S.A."
    },
	{
      "description": "Daniel B. Hastings, Inc. offers a full range of customs brokerage and warehouse and distribution services for organizations that need to move their goods across the U.S.-Mexico border and around the globe. Warehouse & Distribution. Transportation & Freight-Forwarding.",
      "meta": {
        "refs": [
          "https://cphgroupusa.com/hastings/"
        ]
      },
      "uuid": "370f2b5e-0e1c-11eb-adc1-0242ac120002",
      "value": "Daniel B. Hastings, Inc."
    },
	{
      "description": "Established in 1976, Airlink International U.A.E.  has been set up to be a one-stop solution for any organizations’ travel and logistics management requirement in the United Arab Emirates and even other countries. We provide the best quality of end-to-end and world-class solutions to deliver comprehensive logistics result to our clients. Backed by an extensive integrated network and professionals in the industry.",
      "meta": {
        "refs": [
          "https://www.linkedin.com/company/airlinkinternationaluae/about/"
        ]
      },
      "uuid": "370f2f6e-0e1c-11eb-adc1-0242ac120002",
      "value": "Airlink International U.A.E."
    },
	{
      "description": "Daseke, Inc. is the largest owner and a leading consolidator of flatbed and specialized transportation in North America, comprising 16 operating companies with over 5,200 trucks and over 11,000 flatbed and specialized trailers.",
      "meta": {
        "refs": [
          "https://www.daseke.com/"
        ]
      },
      "uuid": "370f3252-0e1c-11eb-adc1-0242ac120002",
      "value": "Daseke, Inc."
    },
	{
      "description": "Japan Post Holdings Co., Ltd. is a Japanese publicly traded conglomerate headquartered in Kasumigaseki, Chiyoda, Tokyo. It is mainly engaged in postal and logistics business, financial window business, banking business and life insurance business.",
      "meta": {
        "refs": [
          "https://www.post.japanpost.jp/index_en.html"
        ]
      },
      "uuid": "971dc0e0-192b-11eb-adc1-0242ac120002",
      "value": "Japan Post Co., Ltd."
    },
	{
      "description": "Food delivery service provided through an online service.",
      "meta": {
        "refs": [
          "https://www.linkedin.com/company/james-delivery/about/"
        ]
      },
      "uuid": "a9c4f076-243c-11eb-adc1-0242ac120002",
      "value": "James Delivery"
    },
	{
      "description": "Singapore Airlines is the flag carrier airline of Singapore, with its hub at Singapore Changi Airport.",
      "meta": {
        "refs": [
          "https://www.singaporeair.com/"
        ]
      },
      "uuid": "7dd6e18a-7ebf-11eb-9439-0242ac130002",
      "value": "Singapore Airlines"
    },
	{
      "description": "Spirit Airlines, Inc. is an American ultra-low-cost carrier headquartered in Miramar, Florida in the Miami metropolitan area. It is the eighth largest commercial airline in North America. Spirit operates scheduled flights throughout the United States and in the Caribbean and Latin America.",
      "meta": {
        "refs": [
          "https://www.spirit.com/"
        ]
      },
      "uuid": "7dd6e658-7ebf-11eb-9439-0242ac130002",
      "value": "Spirit Airlines, Inc."
    },
	{
      "description": "The Deutsche Lufthansa AG, commonly known as Lufthansa, is the largest German airline which, when combined with its subsidiaries, is the second largest airline in Europe in terms of passengers carried.",
      "meta": {
        "refs": [
          "https://www.lufthansa.com/"
        ]
      },
      "uuid": "0ebd1b22-834f-11eb-8dcd-0242ac130003",
      "value": "The Deutsche Lufthansa AG"
    },
	{
      "description": "Air New Zealand Limited is the flag carrier airline of New Zealand. Based in Auckland, the airline operates scheduled passenger flights to 20 domestic and 32 international destinations in 20 countries, primarily around and within the Pacific Rim. The airline has been a member of the Star Alliance since 1999.",
      "meta": {
        "refs": [
          "https://www.airnewzealand.com/"
        ]
      },
      "uuid": "0ebd1ed8-834f-11eb-8dcd-0242ac130003",
      "value": "Air New Zealand Limited"
    },
	{
      "description": "Scandinavian Airlines, usually known as SAS, is the flag carrier of Denmark, Norway and Sweden. SAS is an abbreviation of the company's full name, Scandinavian Airlines System or legally Scandinavian Airlines System Denmark-Norway-Sweden.",
      "meta": {
        "refs": [
          "https://www.flysas.com/us-en/"
        ]
      },
      "uuid": "0ebd1fdc-834f-11eb-8dcd-0242ac130003",
      "value": "Scandinavian Airlines"
    },
	{
      "description": "Cathay Pacific Airways Ltd., more widely known as Cathay Pacific, is the flag carrier of Hong Kong, with its head office and main hub located at Hong Kong International Airport.",
      "meta": {
        "refs": [
          "https://www.cathaypacific.com/cx/en_US.html"
        ]
      },
      "uuid": "0ebd20ae-834f-11eb-8dcd-0242ac130003",
      "value": "Cathay Pacific Airways Ltd."
    },
	{
      "description": "Jeju Air Co., Ltd., is the first and largest South Korean low-cost airline. It offers scheduled domestic services between several cities in South Korea, as well as between Seoul and international destinations including Japan, China, Russia, the Mariana Islands, and various Southeast Asian countries.",
      "meta": {
        "refs": [
          "https://www.jejuair.net/"
        ]
      },
      "uuid": "0ebd2176-834f-11eb-8dcd-0242ac130003",
      "value": "Jeju Air Co., Ltd."
    },
	{
      "description": "Malaysia Airlines Berhad, formerly known as Malaysian Airline System, branded as Malaysia Airlines is the flag carrier airline of Malaysia and a member of the oneworld airline alliance. The company headquarters are located at Kuala Lumpur International Airport.",
      "meta": {
        "refs": [
          "https://www.malaysiaairlines.com/"
        ]
      },
      "uuid": "0ebd223e-834f-11eb-8dcd-0242ac130003",
      "value": "Malaysia Airlines Berhad"
    },
	{
      "description": "Finnair is the flag carrier and largest airline of Finland, with its headquarters in Vantaa on the grounds of Helsinki Airport, its hub. Finnair and its subsidiaries dominate both domestic and international air travel in Finland. Its major shareholder is the government of Finland, which owns 55.8% of the shares.",
      "meta": {
        "refs": [
          "https://www.finnair.com/"
        ]
      },
      "uuid": "0ebd22f2-834f-11eb-8dcd-0242ac130003",
      "value": "Finnair"
    },
	{
      "description": "myFastway is a self-service, fully electronic customer portal, allowing you to manage your freight requirements on demand.",
      "meta": {
        "refs": [
          "https://myfastway.com.au/"
        ]
      },
      "uuid": "393713fc-872e-11eb-8dcd-0242ac130003",
      "value": "Fastway Couriers"
    },
	{
      "description": "Solairus is an aviation services company assisting owners with the safe and economical operation of the their aircraft.",
      "meta": {
        "refs": [
          "https://www.linkedin.com/company/solairus-aviation/about/"
        ]
      },
      "uuid": "c785ecf8-8f37-11eb-8dcd-0242ac130003",
      "value": "Solairus Aviation"
    },
	{
      "description": "Ecu Worldwide (Belgium) is located in Antwerpen, Belgium and is part of the Transportation Services Sector Industry. Ecu Worldwide (Belgium) has 103 employees.",
      "meta": {
        "refs": [
          "https://www.dnb.com/business-directory/company-profiles.ecu_worldwide_(belgium).56cf38c89659ea2db17e554351bad02d.html"
        ]
      },
      "uuid": "079678ca-9c6d-11eb-a8b3-0242ac130003",
      "value": "Ecu Worldwide (Belgium)"
    },
	{
      "description": "The Bakker Logistics Group is part of the Bakker Group, which has been young for over 100 years. In addition to logistics, the Bakker Group is engaged in commercial vehicles and real estate. With 4 branches in the middle of the Netherlands, commercial vehicles is one of the larger dealers of the DAF brand. The Bakker Logistics Group is a prominent player in the market of specialized logistics services. The turnover of approximately 150 million euros is realized with more than 1200 employees. The Bakker Group consists of: Bakker Transport Bakker Logistics Bakker Commercial vehicles Becker Logistics Broersma Logistics Huybregts Logistics.",
      "meta": {
        "refs": [
          "https://www.linkedin.com/company/bakker-logistiek-groep/about/"
        ]
      },
      "uuid": "734113a8-a6a1-11eb-bcbc-0242ac130002",
      "value": "Bakker Logistics Group"
    },
	{
      "description": "Boutin has more than 400 employees and a fleet of over 700 units. We operate several terminals, warehouses and offices across Quebec and Ontario. The head office remains in Plessisville. Boutin has carved out a position as one of the leading trucking companies in Quebec.",
      "meta": {
        "refs": [
          "https://www.linkedin.com/company/boutinexpress/about/"
        ]
      },
      "uuid": "c6879d9a-b70c-11eb-8529-0242ac130003",
      "value": "Groupe Boutin"
    },
	{
      "description": "Dublin Port is Ireland's premier port, handling almost 50% of all trade in the Republic of Ireland.",
      "meta": {
        "refs": [
          "https://www.dublinport.ie/"
        ]
      },
      "uuid": "39d6f95a-95f2-11e9-bc42-526af7764f64",
      "value": "The Dublin Port Company"
    }
	  ],
	"version": 7
}
