{
  "category": "BLS-NAICS-445",
  "description": "Industries in the Food and Beverage Stores subsector usually retail food and beverages merchandise from fixed point-of-sale locations. Establishments in this subsector have special equipment (e.g., freezers, refrigerated display cases, refrigerators) for displaying food and beverage goods. They have staff trained in the processing of food products to guarantee the proper storage and sanitary conditions required by regulatory authority.",
  "name": "BLS-NAICS-445",
  "source": "BLS Industries at a Glance",
  "type": "BLS-NAICS-445",
  "uuid": "76d4f580-4801-11e9-b210-d663bd873d93",
  "values": [
	  {
      "description": "Test place holder",
      "meta": {
        "refs": [
          "https://www.bls.gov/iag/tgs/iag445.htm"
        ]
      },
      "uuid": "ea259db8-48c5-11e9-8646-d663bd873d93",
      "value": "Test Food and Beverage Stores Value"
    },
	{
      "description": "WiziShop is an innovative e-commerce solution allowing the creation and the daily management of your own online shop. WiziShop places itself as a real partner and offers the best tools to create your e-commerce website, to keep it going, to promote it and make your customers loyal.",
      "meta": {
        "refs": [
          "https://www.linkedin.com/company/wizishop/"
        ]
      },
      "uuid": "9ddcacb0-08a1-11eb-adc1-0242ac120002",
      "value": "WiziShop"
    },
	{
      "description": "RedMart is the supermarket arm of Lazada Group in Singapore, offering an unparalleled selection of quality fresh food, household essentials and premium speciality products with the convenience of scheduled home delivery seven days a week, all year round.",
      "meta": {
        "refs": [
          "https://www.linkedin.com/company/redmart/about/"
        ]
      },
      "uuid": "a22c4392-1ea0-11eb-adc1-0242ac120002",
      "value": "RedMart"
    },
	{
      "description": "Hy-Vee is a chain of more than 245 supermarkets located throughout the Midwestern United States in Iowa, Illinois, Kansas, Minnesota, Missouri, Nebraska, South Dakota, and Wisconsin.",
      "meta": {
        "refs": [
          "https://www.hy-vee.com/"
        ]
      },
      "uuid": "9ad247c8-bf82-11e9-9cb5-2a2ae2dbcce4",
      "value": "Hy-Vee"
    }
	  ],
	"version": 2
}
