{
  "category": "BLS-NAICS-482",
  "description": "Industries in the Rail Transportation subsector provide rail transportation of passengers and/or cargo using railroad rolling stock. The railroads in this subsector primarily either operate on networks, with physical facilities, labor force, and equipment spread over an extensive geographic area, or operate over a short distance on a local rail line.",
  "name": "BLS-NAICS-482",
  "source": "BLS Industries at a Glance",
  "type": "BLS-NAICS-482",
  "uuid": "450e2810-4846-11e9-8646-d663bd873d93",
  "values": [
	  {
      "description": "Test place holder",
      "meta": {
        "refs": [
          "https://www.bls.gov/iag/tgs/iag482.htm"
        ]
      },
      "uuid": "a0f314d8-48fa-11e9-8646-d663bd873d93",
      "value": "Test Rail Transportation Value"
    },
	{
      "description": "Gautrain is an 80-kilometre commuter rail system in Gauteng, South Africa, which links Johannesburg, Pretoria, Ekurhuleni and OR Tambo International Airport. The service offers a fast, convenient, safe and efficient public transport service.",
      "meta": {
        "refs": [
          "https://www.gautrain.co.za/"
        ]
      },
      "uuid": "baa24224-9ace-11ea-bb37-0242ac130002",
      "value": "Gautrain"
    },
	{
      "description": "Merseyrail is a suburban railway network serving Liverpool, England, the surrounding Liverpool City Region, the Wirral Peninsula and adjacent areas of Cheshire and Lancashire, including a number of underground stations.",
      "meta": {
        "refs": [
          "https://www.merseyrail.org/"
        ]
      },
      "uuid": "3654d9b2-a9de-11eb-bcbc-0242ac130002",
      "value": "Merseyrail"
    },
	{
      "description": "The Kyushu Railway Company, also referred to as JR Kyushu, is one of the constituent companies of Japan Railways Group aka JR Group. It operates intercity rail services in Kyushu, Japan and the JR Kyushu Jet Ferry Beetle hydrofoil service across the Tsushima Strait between Fukuoka and Busan, South Korea. It also operates hotels, restaurants, and drugstores across its service region. JR Kyushu's headquarters are in Hakata-ku, Fukuoka.",
      "meta": {
        "refs": [
          "https://en.wikipedia.org/wiki/Kyushu_Railway_Company"
        ]
      },
      "uuid": "a0f314d8-48fa-11e9-8646-d663bd873d93",
      "value": "Kyushu Railway Co."
    }
	  ],
	"version": 3
}
