{
  "category": "BLS-NAICS-721",
  "description": "Industries in the Accommodation subsector provide lodging or short-term accommodations for travelers, vacationers, and others. There is a wide range of establishments in these industries. Some provide lodging only; while others provide meals, laundry services, and recreational facilities, as well as lodging. Lodging establishments are classified in this subsector even if the provision of complementary services generates more revenue. The types of complementary services provided vary from establishment to establishment.",
  "name": "BLS-NAICS-721",
  "source": "BLS Industries at a Glance",
  "type": "BLS-NAICS-721",
  "uuid": "772dfc54-4764-11e9-b210-d663bd873d93",
  "values": [
	  {
      "description": "Test place holder",
      "meta": {
        "refs": [
          "https://www.bls.gov/iag/tgs/iag721.htm"
        ]
      },
      "uuid": "af4fb202-4765-11e9-b210-d663bd873d93",
      "value": "Test Acommodation Value"
    },
	{
      "description": "Reservation and management system created by Sark Technologies.",
      "meta": {
        "refs": [
          "https://www.superinn.com/"
        ]
      },
      "uuid": "10f15ece-bf80-11e9-9cb5-2a2ae2dbcce4",
      "value": "SuperINN"
    },
	{
      "description": "OYO Rooms, also known as OYO Homes & Hotels, is the world’s third-largest, one of China’s top two and the fastest growing hospitality chain of leased and franchised hotels, homes & living spaces. Founded in 2013 by Ritesh Agarwal, OYO initially consisted mainly of budget hotels.",
      "meta": {
        "refs": [
          "https://www.oyorooms.com/"
        ]
      },
      "uuid": "6d40f218-e86e-11e9-81b4-2a2ae2dbcce4",
      "value": "OYO Rooms"
    },
	{
      "description": "Marriott International is an American multinational diversified hospitality company that manages and franchises a broad portfolio of hotels and related lodging facilities.",
      "meta": {
        "refs": [
          "https://www.marriott.com/default.mi"
        ]
      },
      "uuid": "52c2fcfa-0331-11ea-8d71-362b9e155667",
      "value": "Marriott International"
    },
	{
      "description": "The Ritz-Carlton Hotel Company, LLC is an American multinational company that operates the luxury hotel chain known as The Ritz-Carlton. The company has 108 luxury hotels and resorts in 30 countries and territories with 29,158 rooms, in addition to 46 hotels with 8,755 rooms in the pipeline.",
      "meta": {
        "refs": [
          "https://www.ritzcarlton.com/"
        ]
      },
      "uuid": "ba5974aa-e2df-11ea-87d0-0242ac130003",
      "value": "The Ritz-Carlton Hotel Company, LLC"
    },
	{
      "description": "RedDoorz is Southeast Asia’s largest and fast-growing, technology-driven hospitality brand. With a vision to enable people to travel more and provide affordable, reliable stays in all major cities and destinations across the region, RedDoorz is disrupting the hospitality industry by transforming the fragmented supply inventory into branded, standardized accommodations.",
      "meta": {
        "refs": [
          "https://www.linkedin.com/company/reddoorz/about/"
        ]
      },
      "uuid": "9298d7ec-2a6c-11eb-adc1-0242ac120002",
      "value": "RedDoorz"
    },
	{
      "description": "Choice Hotels International, Inc. is a hospitality franchisor based in Rockville, Maryland, United States. The company, which is one of the largest hotel chains in the world, owns several hotel brands ranging from upscale to economy.",
      "meta": {
        "refs": [
          "https://www.choicehotels.com/"
        ]
      },
      "uuid": "10f163ce-bf80-11e9-9cb5-2a2ae2dbcce4",
      "value": "Choice Hotels"
    }
	  ],
	"version": 4
}
