{
  "category": "BLS-NAICS-71",
  "description": "The Arts, Entertainment, and Recreation sector includes a wide range of establishments that operate facilities or provide services to meet varied cultural, entertainment, and recreational interests of their patrons. This sector comprises (1) establishments that are involved in producing, promoting, or participating in live performances, events, or exhibits intended for public viewing; (2) establishments that preserve and exhibit objects and sites of historical, cultural, or educational interest; and (3) establishments that operate facilities or provide services that enable patrons to participate in recreational activities or pursue amusement, hobby, and leisure-time interests. Some establishments that provide cultural, entertainment, or recreational facilities and services are classified in other sectors.",
  "name": "BLS-NAICS-71",
  "source": "BLS Industries at a Glance",
  "type": "BLS-NAICS-71",
  "uuid": "20ef7d42-47f3-11e9-b210-d663bd873d93",
  "values": [
	  {
      "description": "Test place holder",
      "meta": {
        "refs": [
          "https://www.bls.gov/iag/tgs/iag71.htm"
        ]
      },
      "uuid": "f68e21ae-48bd-11e9-8646-d663bd873d93",
      "value": "Test Arts, Entertainment, and Recreation Value"
    },
	{
      "description": "Merrill Community Arts Center is home to Woodbury Community Theatre, East Metro Symphony, Artists of Woodbury, SOS for Youth, and other local arts groups.",
      "meta": {
        "refs": [
          "https://merrillartscenter.org/"
        ]
      },
      "uuid": "4b187556-a5c7-11e9-a2a3-2a2ae2dbcce4",
      "value": "Merrill Community Arts Center"
    },
	{
      "description": "MoviePass, Inc. is an American subscription-based movie ticketing service majority-owned by Helios and Matheson Analytics. Founded in 2011 and headquartered in New York City, the service allows subscribers to purchase up to three movie tickets per month for a monthly fee.",
      "meta": {
        "refs": [
          "https://www.moviepass.com/"
        ]
      },
      "uuid": "056f0ebe-c676-11e9-aa8c-2a2ae2dbcce4",
      "value": "MoviePass"
    },
	{
      "description": "xkcd, sometimes styled XKCD, is a webcomic created in 2005 by American author Randall Munroe. The comic tagline describes it as A webcomic of romance, sarcasm, math, and language. Munroe states on the comic website that the name of the comic is not an initialism, but just a word with no phonetic pronunciation.",
      "meta": {
        "refs": [
          "https://xkcd.com/"
        ]
      },
      "uuid": "9e04c49c-ce74-11e9-a32f-2a2ae2dbcce4",
      "value": "XKCD Comic"
    },
	{
      "description": "Zynga Inc. is an American social game developer running social video game services founded in April 2007 with headquarters in San Francisco, California, United States. The company primarily focuses on mobile and social networking platforms. Zynga states its mission as connecting the world through games",
      "meta": {
        "refs": [
          "https://www.zynga.com/"
        ]
      },
      "uuid": "d0288bb2-e5fc-11e9-81b4-2a2ae2dbcce4",
      "value": "Zynga Inc."
    },
	{
      "description": "The Shakespeare Theatre of New Jersey is one of the largest professional Shakespeare companies in North America, serving over 100,000 adults and children annually.",
      "meta": {
        "refs": [
          "https://www.shakespearenj.org/"
        ]
      },
      "uuid": "0dfa6838-1b64-11ea-978f-2e728ce88125",
      "value": "The Shakespeare Theatre of New Jersey"
    },
	{
      "description": "Rooster Teeth Productions, LLC is an American entertainment company headquartered in Austin, Texas. Founded in 2003 by Burnie Burns, Matt Hullum, Geoff Ramsey, Jason Saldaña, Gus Sorola, and Joel Heyman, Rooster Teeth is a subsidiary of Otter Media, which is itself a subsidiary of WarnerMedia Entertainment, a division of AT&T's WarnerMedia.",
      "meta": {
        "refs": [
          "https://roosterteeth.com/"
        ]
      },
      "uuid": "e9f8f60e-1f8a-11ea-978f-2e728ce88125",
      "value": "Rooster Teeth Productions, LLC"
    },
	{
      "description": "Four Queens Hotel and Casino has been in operation since 1966. We have consistently concentrated on delivering high quality, traditional Las Vegas gaming and entertainment. The property is across from our sister property, Binion's Gambling Hall in the heart of Fremont Street in downtown Las Vegas. Both properties are owned by TLC Casino Enterprises.",
      "meta": {
        "refs": [
          "http://www.fourqueens.com/"
        ]
      },
      "uuid": "e473351a-6313-11ea-bc55-0242ac130003",
      "value": "Four Queens Hotel and Casino"
    },
	{
      "description": "Binion's has been making Las Vegas history since 1951 when Texas gambler, Benny Binion, bought the property at 128 Fremont Street. Benny was passionate about giving players excitement, good odds and friendly service, or as he would say - Good Food. Good Whiskey. Good Gamble. When Benny introduced the Horseshoe Club to the Glitter Gulch of downtown Las Vegas, a legacy was born. The Horseshoe Club became the first real gambling hall and saloon in Las Vegas and was soon recognized as the place to go for high roller action and generous comps for all players. While the nostalgic personality of the Horseshoe Club remained the same throughout the years, the property grew in both size and scope when in 1960, Benny purchased the neighboring Boulder Club. In 1988, Benny's sons purchased The Mint Hotel to double the size of the property that today, covers an entire block of Fremont Street as Binion's Gambling Hall & Hotel. Though downtown Las Vegas has evolved since the days of Benny Binion, Benny's enthusiasm still remains at the historic casino and has been picked up by the current owner, TLC Casino Enterprises, that purchased the property in March 2008. In keeping with the storied tradition of the Binion's legacy, the beloved $1 Million Dollar Display is back in a pyramid design of acrylic boxes set up on a poker table. Binion's Gambling Hall & Hotel is continuing to making things great for you!",
      "meta": {
        "refs": [
          "http://www.binions.com/"
        ]
      },
      "uuid": "e47337d6-6313-11ea-bc55-0242ac130003",
      "value": "Binion's Casino"
    },
	{
      "description": "TLC Casino Enterprises, Inc. is a holding company owned and controlled by Terry L. Caudill which through its subsidiaries, owns and operates casinos. TLC Casinos, Inc. was founded in 2002 and is based in Downtown Las Vegas, Nevada. In addition to Magoo's Gaming Group, Caudill owns 3 casinos - Four Queens, Binion's Gambling Hall and Hotel, and Skinny Dugans Casino & Lounge. In 2009, a landlord filed a lawsuit against TLC Casino Enterprises, seeking back rent and the appointment of a receiver to take over the historic gambling hall after TLC requested rent be lowered due to the recession. TLC currently manages and operates the Hotel Apache which reopened after extensive renovation. According to Tim Lager, general manager of Binion, he wanted to recreate what this hotel was when it opened as what was then a megaresort back in 1932.",
      "meta": {
        "refs": [
          "https://en.wikipedia.org/wiki/TLC_Casino_Enterprises"
        ]
      },
      "uuid": "e4733bd2-6313-11ea-bc55-0242ac130003",
      "value": "TLC Casino Enterprises, Inc."
    },
	{
      "description": "Adult entertainment website owned by Granity Entertainment Designated Activity Company.",
      "meta": {
        "refs": [
          "https://www.vision-net.ie/Company-Info/Granity-Entertainment-Designated-Activity-Company-525757"
        ]
      },
      "uuid": "b5c05024-8fcb-11ea-bc55-0242ac130003",
      "value": "CAM4 (Website)"
    },
	{
      "description": "Granity Entertainment Designated Activity Company was set up on Wednesday the 3rd of April 2013. Their current partial address is Co. Dublin, and the company status is Normal. The company's current directors have been the director of 3 other Irish companies between them - 1 of which is now closed. Granity Entertainment Designated Activity Company has 1 shareholder. This Irish company shares its Eircode with at least 1 other company.",
      "meta": {
        "refs": [
          "https://www.vision-net.ie/Company-Info/Granity-Entertainment-Designated-Activity-Company-525757"
        ]
      },
      "uuid": "b5c05254-8fcb-11ea-bc55-0242ac130003",
      "value": "Granity Entertainment Designated Activity Company"
    },
	{
      "description": "ZEE5. ZEE5 is an Indian video on demand service run by Essel Group via its subsidiary Zee Entertainment Enterprises. It was launched in India on 14 February 2018 with content in 12 languages. ZEE5 mobile app is available on Web, Android, iOS, Smart TVs, among other devices.",
      "meta": {
        "refs": [
          "https://www.zee5.com/"
        ]
      },
      "uuid": "8d9660f2-ab41-11ea-bb37-0242ac130002",
      "value": "Zee Entertainment Enterprises (ZEE5)"
    },
	{
      "description": "We are one of the fastest growing fitness and nutrition brands in the world. Since our launch in 2016, V Shred and Sculpt Nation have provided life changing programs, personal coaching, and supplementation to millions of clients across the world.  Our social community has grown to nearly 15 million across platforms and, most recently, a top ranked app for both iOS and Android.",
      "meta": {
        "refs": [
          "https://www.linkedin.com/company/vshred/about/"
        ]
      },
      "uuid": "b351afa8-c1e5-11ea-b3de-0242ac130004",
      "value": "V Shred"
    },
	{
      "description": "Activision Publishing, Inc. is an American video game publisher based in Santa Monica, California. It currently serves as the publishing business for its parent company, Activision Blizzard, and consists of several subsidiary studios.",
      "meta": {
        "refs": [
          "https://www.activision.com/home"
        ]
      },
      "uuid": "7c01d618-fda4-11ea-adc1-0242ac120002",
      "value": "Activision Publishing, Inc."
    },
	{
      "description": "Town Sports International Holdings is an operator of fitness centers in the Eastern United States, California and in Switzerland. Its brands include New York Sports Clubs, Boston Sports Clubs, Philadelphia Sports Clubs, Washington Sports Clubs, Lucille Roberts, TMPL Gym and Total Woman Gym and Spa.",
      "meta": {
        "refs": [
          "http://www.townsportsinternational.com/investor-relations"
        ]
      },
      "uuid": "f1bf28c4-0321-11eb-adc1-0242ac120002",
      "value": "Town Sports International Holdings"
    },
	{
      "description": "Sandbox Interactive is an ambitious, up-and-coming game development studio based in the heart of Berlin. The company was founded in early 2012 and currently employs a team of 30, bringing together some of the best in the industry. We offer a professional working environment, with flat hierarchies and a communicative, efficient team. Our working culture is all about transparency and communication, and offering our employees a high level of responsibility in goal-oriented tasks.",
      "meta": {
        "refs": [
          "https://www.linkedin.com/company/sandbox-interactive-gmbh/about/"
        ]
      },
      "uuid": "f650e658-1928-11eb-adc1-0242ac120002",
      "value": "Sandbox Interactive GmbH"
    },
	{
      "description": "Big Mage currently develops games and apps for several platforms which vary from casual to semi casual difficulty level. We often work on several projects at a time while we maintain our cool and focus naturally. The Big Mage teams strive to provide experiences that are full of precious moments and create gameplay that stands out by delivering joy and fun to the players. We also have great interest in educational applications, because we believe that technology is not just for fun, but has the power to improve people. In our applications we use the natural curiosity of the children, to guide and teach them in a funny and relaxed manner.",
      "meta": {
        "refs": [
          "https://bigmage.com/"
        ]
      },
      "uuid": "f650e892-1928-11eb-adc1-0242ac120002",
      "value": "BigMage Game Studios"
    },
	{
      "description": "Boyne Resorts is an owner and operator of many ski and golf resorts in the United States. The company employs over 7,000 full-time and seasonal staff. It operates 13 resort properties: 10 ski resorts and 11 golf courses.",
      "meta": {
        "refs": [
          "https://boyneresorts.com/"
        ]
      },
      "uuid": "f650e996-1928-11eb-adc1-0242ac120002",
      "value": "Boyne Resorts"
    },
	{
      "description": "Fitness centers.",
      "meta": {
        "refs": [
          "https://www.linkedin.com/company/clubfitness/about/"
        ]
      },
      "uuid": "51e6127e-243a-11eb-adc1-0242ac120002",
      "value": "Club Fitness"
    },
	{
      "description": "Capcom Co., Ltd. is a Japanese video game developer and publisher. It has created a number of multi-million-selling game franchises, including Street Fighter, Mega Man, Darkstalkers, and Resident Evil.",
      "meta": {
        "refs": [
          "https://www.capcom.com/"
        ]
      },
      "uuid": "51e614ae-243a-11eb-adc1-0242ac120002",
      "value": "Capcom Co., Ltd."
    },
	{
      "description": "WildWorks (formerly Smart Bomb Interactive) is a leading developer of online worlds and F2P games for players of all ages. Founded by game industry veterans in 2003, we've assembled a development team that includes internationally acclaimed artists, engineers, designers, educators, online safety experts, and media professionals from many different disciplines. Together we create fun with substance, from online casual games to cutting-edge mobile titles.",
      "meta": {
        "refs": [
          "https://www.linkedin.com/company/playwildworks/about/"
        ]
      },
      "uuid": "c5314ebe-2a6c-11eb-adc1-0242ac120002",
      "value": "WildWorks"
    },
	{
      "description": "Pluto TV, a ViacomCBS company, is the leading free streaming television service in America. With over 250+ channels, 170+ content partners, and 20+ million viewers, Pluto TV is growing at warp speed.",
      "meta": {
        "refs": [
          "https://www.linkedin.com/company/pluto-tv/about/"
        ]
      },
      "uuid": "c5315102-2a6c-11eb-adc1-0242ac120002",
      "value": "Pluto TV"
    },
	{
      "description": "Virgin Active is a chain of health clubs in South Africa, Botswana, Namibia, Italy, Australia, Singapore, Thailand and the United Kingdom.",
      "meta": {
        "refs": [
          "https://www.virginactive.com/"
        ]
      },
      "uuid": "03190cda-ae70-11eb-8529-0242ac130003",
      "value": "Virgin Active"
    },
	{
      "description": "Electronic Arts Inc. is an American video game company headquartered in Redwood City, California. It is the second-largest gaming company in the Americas and Europe by revenue and market capitalization after Activision Blizzard and ahead of Take-Two Interactive, and Ubisoft as of May 2020.",
      "meta": {
        "refs": [
          "https://www.ea.com/"
        ]
      },
      "uuid": "a1a526de-f841-11eb-9a03-0242ac130003",
      "value": "Electronic Arts Inc."
    },
	{
      "description": "The Shubert Organization is a theatrical producing organization and a major owner of theatres based in Manhattan, New York City. It was founded by the three Shubert brothers in the late 19th century. They steadily expanded, owning many theaters in New York and across the country.",
      "meta": {
        "refs": [
          "http://shubert.nyc/"
        ]
      },
      "uuid": "ec836bc0-8223-11e9-bc42-526af7764f64",
      "value": "The Shubert Organization"
    }
	  ],
	"version": 10
}
