{
	"category": "BLS-NAICS-44-45",
	"description": "The Retail Trade sector comprises establishments engaged in retailing merchandise, generally without transformation, and rendering services incidental to the sale of merchandise. The retailing process is the final step in the distribution of merchandise; retailers are, therefore, organized to sell merchandise in small quantities to the general public. This sector comprises two main types of retailers: store and nonstore retailers. 1. Store retailers operate fixed point-of-sale locations, located and designed to attract a high volume of walk-in customers. In general, retail stores have extensive displays of merchandise and use mass-media advertising to attract customers. They typically sell merchandise to the general public for personal or household consumption, but some also serve business and institutional clients. In addition to retailing merchandise, some types of store retailers are also engaged in the provision of after-sales services, such as repair and installation. 2. Nonstore retailers, like store retailers, are organized to serve the general public, but their retailing methods differ. The establishments of this subsector reach customers and market merchandise with methods, such as the broadcasting of infomercials, the broadcasting and publishing of direct-response advertising, the publishing of paper and electronic catalogs, door-to-door solicitation, in-home demonstration, selling from portable stalls (street vendors, except food), and distribution through vending machines.",
	"name": "BLS-NAICS-44-45",
	"source": "BLS Industries at a Glance",
	"type": "BLS-NAICS-44-45",
	"uuid": "a756e8ca-4848-11e9-8646-d663bd873d93",
	"values": [{
			"description": "Test place holder",
			"meta": {
				"refs": [
					"https://www.bls.gov/iag/tgs/iag44-45.htm"
				]
			},
			"uuid": "d6c483d8-48fc-11e9-8646-d663bd873d93",
			"value": "Test Retail Trade Value"
		},
		{
			"description": "Shopify is a Canadian e-commerce company headquartered in Ottawa, Ontario. It is also the name of its proprietary e-commerce platform for online stores and retail point-of-sale systems.",
			"meta": {
				"refs": [
					"https://www.shopify.com/"
				]
			},
			"uuid": "ff53bf86-65e8-11e9-a923-1681be663d3e",
			"value": "Shopify"
		},
		{
			"description": "Sephora is a Paris–based French multinational chain of personal care and beauty stores founded in Limoges in 1969. Featuring nearly 300 brands, along with its own private label, Sephora offers beauty products including cosmetics, skincare, body, fragrance, nail color, beauty tools, and haircare.",
			"meta": {
				"refs": [
					"https://www.sephora.com/"
				]
			},
			"uuid": "79392d4e-b61c-11e9-a2a3-2a2ae2dbcce4",
			"value": "Sephora"
		},
		{
			"description": "Poshmark is a social commerce marketplace where people in the United States can buy and sell new or used clothing, shoes, and accessories. The company is headquartered in Redwood City, California.",
			"meta": {
				"refs": [
					"https://poshmark.com/"
				]
			},
			"uuid": "7939301e-b61c-11e9-a2a3-2a2ae2dbcce4",
			"value": "Poshmark"
		},
		{
			"description": "StockX is a Detroit based company primarily known for its e-commerce platform StockX.com. The company was founded by Dan Gilbert, Greg Schwartz, Josh Luber and Chris Kaufman in 2015, with an emphasis on the sneaker resale market.",
			"meta": {
				"refs": [
					"https://stockx.com/"
				]
			},
			"uuid": "7d7c80fe-bf86-11e9-9cb5-2a2ae2dbcce4",
			"value": "StockX"
		},
		{
			"description": "CafePress, Inc. is an American online retailer of stock and user-customized on demand products. The company was founded in San Mateo, California, but is now headquartered in Louisville, Kentucky, USA along with its production facility. In 2001, CafePress.com won the People's Voice Webby Award in the Commerce category.",
			"meta": {
				"refs": [
					"https://www.cafepress.com/"
				]
			},
			"uuid": "7d7c83ec-bf86-11e9-9cb5-2a2ae2dbcce4",
			"value": "CafePress, Inc."
		},
		{
			"description": "Lumber Liquidators is an American retailer of hardwood flooring.",
			"meta": {
				"refs": [
					"https://www.lumberliquidators.com/ll/home"
				]
			},
			"uuid": "61824cea-cb33-11e9-a32f-2a2ae2dbcce4",
			"value": "Lumber Liquidators Inc."
		},
		{
			"description": "Yves Rocher is a worldwide cosmetics and beauty brand, founded in 1959 by the French entrepreneur Yves Rocher in La Gacilly. The company is present in 88 countries on five continents and employs 13,500 personnel, excluding more than 215,000 through additional indirect jobs.",
			"meta": {
				"refs": [
					"https://www.yvesrocherusa.com/control/main/"
				]
			},
			"uuid": "e86649ec-ce75-11e9-a32f-2a2ae2dbcce4",
			"value": "Yves Rocher"
		},
		{
			"description": "Online furniture retialer.",
			"meta": {
				"refs": [
					"https://www.pepperfry.com/"
				]
			},
			"uuid": "a2930f1e-d356-11e9-bb65-2a2ae2dbcce4",
			"value": "Trendsutra Platform Services Private Limited"
		},
		{
			"description": "Tesco PLC trading as Tesco, is a British multinational groceries and general merchandise retailer with headquarters in Welwyn Garden City, Hertfordshire, England, United Kingdom. It is the third-largest retailer in the world measured by gross revenues and ninth-largest retailer in the world measured by revenues.",
			"meta": {
				"refs": [
					"https://www.tesco.com/"
				]
			},
			"uuid": "e7b8aec2-dd7f-11e9-8a34-2a2ae2dbcce4",
			"value": "Tesco PLC"
		},
		{
			"description": "The North West Company is a Canadian multinational grocery and retail company which operates stores in Canada's western provinces and northern territories, as well as the US states of Alaska, Hawaii, and several other countries and US territories in Oceania and the Caribbean.",
			"meta": {
				"refs": [
					"https://www.northwest.ca/"
				]
			},
			"uuid": "6511f934-e873-11e9-81b4-2a2ae2dbcce4",
			"value": "The North West Company"
		},
		{
			"description": "Menard Inc. is a chain of home improvement stores, located in the Midwestern United States. The privately held company, headquartered in Eau Claire, Wisconsin, has 350 stores in 14 states - Ohio, Michigan, Indiana, Illinois, Wisconsin, Minnesota, Iowa, Missouri, Nebraska, Kansas, South Dakota, North Dakota, Wyoming, and Kentucky. It is the third-largest home improvement chain in the United States, behind The Home Depot and Lowes.",
			"meta": {
				"refs": [
					"https://www.menards.com/main/home.html",
					"https://en.wikipedia.org/wiki/Menards"
				]
			},
			"uuid": "81a427a6-f81e-11e9-8f0b-362b9e155667",
			"value": "Menard Inc."
		},
		{
			"description": "First Aid Beauty skin care products and makeup target specific skin issues such as eczema, anti-aging, dry skin, and acne while being safe for sensitive skin.",
			"meta": {
				"refs": [
					"https://www.firstaidbeauty.com/"
				]
			},
			"uuid": "8a2cedb4-033a-11ea-8d71-362b9e155667",
			"value": "First Aid Beauty, LTD."
		},
		{
			"description": "Smith's Food and Drug was founded in 1911 in Brigham City, Utah, United States by Lorenzo J. Smith. Now a subsidiary of Kroger, it is a prominent regional supermarket chain operating in the Southwest and Northwest.",
			"meta": {
				"refs": [
					"https://www.smithsfoodanddrug.com/"
				]
			},
			"uuid": "8a2cf02a-033a-11ea-8d71-362b9e155667",
			"value": "Smith's Food and Drug"
		},
		{
			"description": "Bed Bath & Beyond Inc. is an American chain of domestic merchandise retail stores. Bed Bath & Beyond operates many stores in the United States, Puerto Rico, Canada, and Mexico. Bed Bath & Beyond was founded in 1971. It is currently part of the S&P 500 and Global 1200 Indices.",
			"meta": {
				"refs": [
					"https://www.bedbathandbeyond.com/"
				]
			},
			"uuid": "8a2cf174-033a-11ea-8d71-362b9e155667",
			"value": "Bed Bath & Beyond Inc."
		},
		{
			"description": "Orvis is an American family-owned retail and mail-order business specializing in high-end fly fishing, hunting and sporting goods. Founded in Manchester, Vermont, in 1856 by Charles F. Orvis to sell fishing tackle, it is the oldest mail-order retailer in the United States.",
			"meta": {
				"refs": [
					"https://www.orvis.com/"
				]
			},
			"uuid": "fcd8a11c-096d-11ea-8d71-362b9e155667",
			"value": "Orvis"
		},
		{
			"description": "Solara Medical Supplies, LLC provides medical devices. The Company offers insulin pumps, infusion sets, accessories, skin dressing and insertion devices, glucose and diabetes meters, syringes, and test strips. Solara Medical Supplies serves customers in the United States.",
			"meta": {
				"refs": [
					"https://www.bloomberg.com/profile/company/1626834D:US"
				]
			},
			"uuid": "fcd8a414-096d-11ea-8d71-362b9e155667",
			"value": "Solara Medical Supplies, LLC"
		},
		{
			"description": "Macy's is an American department store chain founded in 1858 by Rowland Hussey Macy. It became a division of the Cincinnati-based Federated Department Stores in 1994, as a Bloomingdale's department store chain affiliate. As of 2015, Macy's was the largest U.S. department store company by retail sales.",
			"meta": {
				"refs": [
					"https://www.macys.com/"
				]
			},
			"uuid": "1159d344-0c8a-11ea-8d71-362b9e155667",
			"value": "Macy's"
		},
		{
			"description": "Sweaty Betty is a British retailer specialising in women's activewear, founded by Tamara and Simon Hill-Norton. The brand has been ensuring that 'style meets performance' in women's activewear for over 15 years, with the aim to inspire women to find empowerment through fitness.",
			"meta": {
				"refs": [
					"https://www.sweatybetty.com/"
				]
			},
			"uuid": "5f219484-17b3-11ea-8d71-362b9e155667",
			"value": "Sweaty Betty"
		},
		{
			"description": "Created by real women for real women. Up to 30 new designs weekly online & in-store. Free delivery on all orders.",
			"meta": {
				"refs": [
					"https://www.lovebonito.com/"
				]
			},
			"uuid": "720101b2-1f8c-11ea-978f-2e728ce88125",
			"value": "Love, Bonito"
		},
		{
			"description": "Boots UK Limited (formerly Boots the Chemists), trading as Boots, is a health and beauty retailer and pharmacy chain in the United Kingdom and other countries and territories including Ireland, Norway, the Netherlands and Thailand. The parent company, The Boots Company plc, merged with Alliance UniChem in 2006 to form Alliance Boots. In 2007, Alliance Boots was bought by Kohlberg Kravis Roberts and Stefano Pessina, taking the company private, and moving its headquarters to Switzerland, making it the first-ever FTSE 100 company to be bought by a private equity firm. In 2012, Walgreens bought a 45% stake in Alliance Boots, with the option to buy the rest within three years. It exercised this option in 2014, and as a result Boots became a subsidiary of the new company, Walgreens Boots Alliance, on 31 December 2014. Boots is one of the largest retailers in the UK and Ireland, both in terms of revenue and the number of shops. It has 2,500 shops across the United Kingdom and Ireland ranging from local pharmacies to large health and beauty shops. Its shops are primarily located on the high streets and in shopping centres. It sells many health and beauty products, and also provides optician and hearing care services within shops and as standalone practices. Boots also operates a retail website and since 1997 it runs a loyalty card programme called the Boots Advantage Card.",
			"meta": {
				"refs": [
					"https://en.wikipedia.org/wiki/Boots_(company)"
				]
			},
			"uuid": "a691385c-6316-11ea-bc55-0242ac130003",
			"value": "Boots UK Limited"
		},
		{
			"description": "Halloween costume retailer that has brick-and-mortar as well as online purchasing options.",
			"meta": {
				"refs": [
					"https://www.thehalloweenspot.com/"
				]
			},
			"uuid": "3dbaa59e-686f-11ea-bc55-0242ac130003",
			"value": "The Halloween Spot"
		},
		{
			"description": "This business sells the NutriBullet, accessories and related health products through direct sales and through retail stores.",
			"meta": {
				"refs": [
					"https://www.bbb.org/us/ca/pacoima/profile/housewares/nutribullet-llc-1216-100118221"
				]
			},
			"uuid": "14d75de4-6d23-11ea-bc55-0242ac130003",
			"value": "NutriBullet, LLC"
		},
		{
			"description": "Vijay Sales is an Indian electronics retail chain based out of Mumbai. It is headquartered in Jogeshwari, Mumbai. Vijay Sales started as a small TV showroom in Mahim by Mr.Nanu Gupta in 1967.",
			"meta": {
				"refs": [
					"https://www.vijaysales.com/"
				]
			},
			"uuid": "14d761fe-6d23-11ea-bc55-0242ac130003",
			"value": "Vijay Sales"
		},
		{
			"description": "Webkinz are stuffed animals that have a playable online counterpart, www.webkinz.com, in Webkinz World. Webkinz were originally released by the Canadian toy company Ganz on April 29, 2005.",
			"meta": {
				"refs": [
					"https://www.webkinz.com/"
				]
			},
			"uuid": "734568ae-83d9-11ea-bc55-0242ac130003",
			"value": "Webkinz"
		},
		{
			"description": "Robert Dyas is a UK hardware retailer founded in London in 1872. It sells a range of housewares, small electrical appliances, gardening products, kitchenwares, DIY, and consumer electronics throughout 93 shops, mainly in Greater London and South East England, as well as online.",
			"meta": {
				"refs": [
					"https://www.robertdyas.co.uk/"
				]
			},
			"uuid": "3f693e16-8af0-11ea-bc55-0242ac130003",
			"value": "Robert Dyas"
		},
		{
			"description": "Prime Communications LP. Prime Communications, L.P. provides telecommunications services. The Company offers cellular telephones and networking products and services including wireless Internet, digital television, and home phone services. Prime Communications operates retail stores in the United States.",
			"meta": {
				"refs": [
					"https://www.primecomms.com/"
				]
			},
			"uuid": "4567b3c6-8fd0-11ea-bc55-0242ac130003",
			"value": "Prime Communications, L.P."
		},
		{
			"description": "At the core of our Good Foods mission, our expertise in the area of pet wellness enables us to drive helpful, consultative shopping experiences while our best-in-class supply chain capabilities deliver speedy lead times with a high-touch experience on nearly 10,000 of the best products available in specialty pet. Through our Good Deeds charitable giving program, PetFlow has helped thousands of pets in need with high-end foods, and is an ally to many rescues throughout America.",
			"meta": {
				"refs": [
					"https://www.linkedin.com/company/pet-flow/about/"
				]
			},
			"uuid": "0ed9e69a-a046-11ea-bb37-0242ac130002",
			"value": "PetFlow"
		},
		{
			"description": "INSPORT started out with a small store in 1983 in the Sydney suburb of Burwood. It was based on a vision of a new type of sports store that specialised in sports clothing and footwear. Since then it has grown to be one of NSW leading sports clothing and footwear retailers.",
			"meta": {
				"refs": [
					"https://www.linkedin.com/company/insport-australia/about/"
				]
			},
			"uuid": "0ed9e8b6-a046-11ea-bb37-0242ac130002",
			"value": "Insport Australia (INSPORT)"
		},
		{
			"description": "Canadian fitness equipment retailer.",
			"meta": {
				"refs": [
					"https://www.fitnessdepot.ca/"
				]
			},
			"uuid": "000ac32a-ab48-11ea-bb37-0242ac130002",
			"value": "Fitness Depot"
		},
		{
			"description": "Claire's is an American retailer of accessories, jewelry, and toys primarily aimed toward girls, tweens and teens. It was founded in 1961 and is based in Hoffman Estates, Illinois, a suburb of Chicago. The company is owned by Apollo Global Management, LLC.",
			"meta": {
				"refs": [
					"https://www.claires.com/us/"
				]
			},
			"uuid": "935bf42e-b0a1-11ea-b3de-0242ac130004",
			"value": "Claire's"
		},
		{
			"description": "Walmart Inc. is an American multinational retail corporation that operates a chain of hypermarkets, discount department stores, and grocery stores, headquartered in Bentonville, Arkansas. The company was founded by Sam Walton in 1962 and incorporated on October 31, 1969.",
			"meta": {
				"refs": [
					"https://walmart.com/"
				]
			},
			"uuid": "4e968278-d338-11ea-87d0-0242ac130003",
			"value": "Walmart Inc."
		},
		{
			"description": "SiteOne is the green industry's No. 1 destination for landscape supplies, irrigation tools and agronomic maintenance. Learn about our Partners Program.",
			"meta": {
				"refs": [
					"https://www.siteone.com/en/"
				]
			},
			"uuid": "4e968476-d338-11ea-87d0-0242ac130003",
			"value": "SiteOne Landscape Supply"
		},
		{
			"description": "Walgreen Company or simply Walgreens is an American company that operates as the second-largest pharmacy store chain in the United States behind CVS Health. It specializes in filling prescriptions, health and wellness products, health information, and photo services.",
			"meta": {
				"refs": [
					"https://www.walgreens.com/"
				]
			},
			"uuid": "4e968700-d338-11ea-87d0-0242ac130003",
			"value": "Walgreen Company"
		},
		{
			"description": "Drizly is the world's largest alcohol marketplace and the best way to shop beer, wine and spirits. Our customers trust us to be part of their lives – their celebrations, parties, dinners and quiet nights at home. We are there when it matters - committed to life's moments and the people who create them. We partner with the best retail stores in over 95 cities across North America to serve up the best buying experience. Drizly offers a huge selection and competitive pricing with a side of personalized content.",
			"meta": {
				"refs": [
					"https://www.linkedin.com/company/drizly/about/"
				]
			},
			"uuid": "3cc9864a-d7ec-11ea-87d0-0242ac130003",
			"value": "Drizly"
		},
		{
			"description": "Scentbird inspires fragrance lovers to go beyond the ordinary and sample scents that evoke passion, confidence, and the unknown. Our mission is to revolutionize the way individuals perfume by bringing the ultimate fragrance playground right to their fingertips.",
			"meta": {
				"refs": [
					"https://www.linkedin.com/company/scentbird/about/"
				]
			},
			"uuid": "3cc98a3c-d7ec-11ea-87d0-0242ac130003",
			"value": "Scentbird"
		},
		{
			"description": "Grocery, Pharmacy and Liquor Retail Store.",
			"meta": {
				"refs": [
					"https://www.linkedin.com/company/cub-foods/about/"
				]
			},
			"uuid": "3cc98b4a-d7ec-11ea-87d0-0242ac130003",
			"value": "Cub Foods (Cub Pharmacy)"
		},
		{
			"description": "The Brown–Forman Corporation is one of the largest American-owned companies in the spirits and wine business.",
			"meta": {
				"refs": [
					"https://www.brown-forman.com/"
				]
			},
			"uuid": "fa53ef16-e2e1-11ea-87d0-0242ac130003",
			"value": "The Brown–Forman Corporation"
		},
		{
			"description": "Staples Inc. is an American office retail company. It is primarily involved in the sale of office supplies and related products, via retail channels and business-to-business-oriented delivery operations. The company opened its first store in Brighton, Massachusetts on May 1, 1986.",
			"meta": {
				"refs": [
					"https://www.staples.com/"
				]
			},
			"uuid": "57f81aa0-fda6-11ea-adc1-0242ac120002",
			"value": "Staples Inc."
		},
		{
			"description": "Sam's West, Inc. is an American chain of membership-only retail warehouse clubs owned and operated by Walmart Inc., founded in 1983 and named after Walmart founder Sam Walton.",
			"meta": {
				"refs": [
					"https://www.samsclub.com/"
				]
			},
			"uuid": "c43e1e14-0e1b-11eb-adc1-0242ac120002",
			"value": "Sam's West, Inc."
		},
		{
			"description": "Barnes & Noble, Inc., is an American bookseller. It is a Fortune 1000 company and the bookseller with the largest number of retail outlets in the United States. As of March 7, 2019, the company operates 627 retail stores in all 50 U.S. states. In August 2019, Elliott Management Corporation acquired the company.",
			"meta": {
				"refs": [
					"https://www.barnesandnoble.com/"
				]
			},
			"uuid": "eacdacaa-1476-11eb-adc1-0242ac120002",
			"value": "Barnes & Noble, Inc."
		},
		{
			"description": "The Home Depot, Inc., commonly known as Home Depot, is the largest home improvement retailer in the United States, supplying tools, construction products, and services. The company is headquartered in unincorporated Cobb County, Georgia, with an Atlanta mailing address.",
			"meta": {
				"refs": [
					"05f02232-1ec3-11eb-adc1-0242ac120002"
				]
			},
			"uuid": "d6c483d8-48fc-11e9-8646-d663bd873d93",
			"value": "The Home Depot, Inc."
		},
		{
			"description": "JM Bullion is an online retailer of gold and silver products, from bars to rounds to coins. We deal exclusively in physical bullion, selling gold or silver that is delivered directly to your door.",
			"meta": {
				"refs": [
					"https://www.linkedin.com/company/jm-bullion/about/"
				]
			},
			"uuid": "a9c4e9be-243c-11eb-adc1-0242ac120002",
			"value": "JM Bullion"
		},
		{
			"description": "With 13 dealerships across the East Midlands, Sandicliffe specialise in supply and maintenance of New and Used Cars and Commercial vehicles, and offer a complete range of motoring products and services. We are proud to represent five New Car manufacturers - Ford, Mazda, Nissan, Skoda and Kia. Sandicliffe remain committed to the highest quality standards teamed with excellent customer care and these values have stuck with us from the very beginning of our journey. Sandicliffe was founded in 1948 by Mr. J R Woodhouse and Mr. T H Barton as a service station on Nottingham Road, Stapleford. The Company became Ford Retail Dealers in 1953 and then by 1955, Ford Car and Commercial Vehicle Distributorships were appointed. Things progressed steadily whereby in 1974, the honour of a Royal Warrant of Her Majesty Queen Elizabeth II was granted to the Stapleford Dealership. More recently, Sandicliffe has expanded into one of the country's largest privately owned family motor groups with over 600 employees operating from eleven sites located throughout the East Midlands.",
			"meta": {
				"refs": [
					"https://www.linkedin.com/company/sandicliffe-motor-group/about/"
				]
			},
			"uuid": "a9c4ec16-243c-11eb-adc1-0242ac120002",
			"value": "Sandicliffe Motor Group"
		},
		{
			"description": "LensCrafters is an international retailer of prescription eyewear and prescription sunglasses. Its stores usually host independent optometrists on-site or in an adjacent store. The company has its corporate headquarters in Mason, Ohio, a suburb of Cincinnati.",
			"meta": {
				"refs": [
					"https://www.lenscrafters.com/"
				]
			},
			"uuid": "a9c4eeb4-243c-11eb-adc1-0242ac120002",
			"value": "LensCrafters"
		},
		{
			"description": "Target Optical’s mission is to make guests happy by making it simple and fun to see great and look great – and it’s a mission that our team members live every day in our approximately 350 stores across the U.S. Just like Target, we sell fashion that’s affordable, featuring top brands like Ray-Ban, DKNY, Armani Exchange, Maui Jim, Coach and more. When it comes to taking care of your eyes, we can't say enough about the importance of an annual eye exam, provided by the independent doctors of optometry next to Target Optical. Every day we deliver on our - expect more, pay less​ - promise by bringing together quality eye care, fashion, affordability and a simple, fun shopping experience.",
			"meta": {
				"refs": [
					"https://www.linkedin.com/company/target-optical/about/"
				]
			},
			"uuid": "a9c4efa4-243c-11eb-adc1-0242ac120002",
			"value": "Target Optical"
		},
		{
			"description": "Cencosud S.A. is a publicly traded multinational retail company. It's the largest retail company in Chile and the third largest listed retail company in Latin America.",
			"meta": {
				"refs": [
					"https://www.cencosud.com/en"
				]
			},
			"uuid": "0d8e8fc6-2a6f-11eb-adc1-0242ac120002",
			"value": "Cencosud S.A."
		},
		{
			"description": "Clothing retailer, Kyoto, Japan.",
			"meta": {
				"refs": [
					"https://sharing-kyoto.com/shop_urban-research/story"
				]
			},
			"uuid": "512257b4-8342-11eb-8dcd-0242ac130003",
			"value": "URBAN RESEARCH KYOTO!"
		},
		{
			"description": "Eyemart Express is an eyewear company with retail stores across the United States. Eyemart Express has an e-commerce store and more than 200 locations in 31 states. The company also operates as Eyewear Express, Vision4Less and VisionMart Express. The first Eyemart Express was opened in Appleton, Wisconsin, in 1990.",
			"meta": {
				"refs": [
					"https://www.eyemartexpress.com/"
				]
			},
			"uuid": "47bc63c6-8f37-11eb-8dcd-0242ac130003",
			"value": "Eyemart Express, LLC"
		},
		{
			"description": "Fat Face is a British lifestyle clothing and accessories retailer, based in Hampshire. It was founded in 1988 by Tim Slade and Jules Leaver as a business selling T-shirts at ski resorts. The company opened its first retail shop in 1993; as of 2014 there were 209 Fat Face stores in the UK and Ireland.",
			"meta": {
				"refs": [
					"https://www.fatface.com/"
				]
			},
			"uuid": "47bc6736-8f37-11eb-8dcd-0242ac130003",
			"value": "Fat Face"
		},
		{
			"description": "Car dealership, TX.",
			"meta": {
				"refs": [
					"https://www.teamsewell.com/"
				]
			},
			"uuid": "47bc683a-8f37-11eb-8dcd-0242ac130003",
			"value": "The Sewell Family of Companies, Inc."
		},
		{
			"description": "Guns.com started in 2011 with a goal of creating a website where gun enthusiasts could come for news, product reviews, and the latest information on the issues that impact gun owners. Guns.com rapidly grew into the most trusted source of information about guns online. Over the years, we have published thousands of articles and reviews, keeping gun owners in the know about the issues they care about. Now, in addition to being your most trusted source for news, we have evolved into an online marketplace that celebrates gun ownership.",
			"meta": {
				"refs": [
					"https://www.guns.com/about-us"
				]
			},
			"uuid": "4a71032c-9632-11eb-a8b3-0242ac130003",
			"value": "Guns.com"
		},
		{
			"description": "Online furniture retailer located in Singapore.",
			"meta": {
				"refs": [
					"http://www.vhive.com.sg/"
				]
			},
			"uuid": "4a710598-9632-11eb-a8b3-0242ac130003",
			"value": "Vhive Singapore"
		},
		{
			"description": "J&B Importers offers a wide variety of popular cycling brands. Our house brands Origin8, Sun Bicycles, and Sunlite have quickly become industry favorites. We operate 11 regional distribution centers strategically placed around the nation that allow local bike shops across the nation to take advantage of standard next day shipping. J&B also offers export services for most products and have expanded their proprietary brand reach with world-wide distribution partners.",
			"meta": {
				"refs": [
					"https://www.linkedin.com/company/j&b-importers/about/"
				]
			},
			"uuid": "079674ce-9c6d-11eb-a8b3-0242ac130003",
			"value": "J&B Importers"
		},
		{
			"description": "Home Hardware has been a proud Canadian company since 1964. Founded by Walter Hachborn, the company was created to support the success of the independent business owner. Walter and a network of 122 independent business owners joined together to share resources and buying power to answer to the challenge of big box stores. More than 50 years later, Home Hardware is Canada’s largest independent home improvement retailer with close to 1,100 stores across every corner of the country. Operating under four banners, Home Hardware, Home Hardware Building Centre, Home Building Centre and Home Furniture, the company remains dedicated to its mission of supporting independent Dealer-owners. Through the Home Hardware network, Dealer-Owners have access to 100,000 quality, brand name and private label products, a state-of-the-art distribution system and extensive marketing and training programs. Home Hardware is proud to be the resource for Canadians who need help with projects, big and small.",
			"meta": {
				"refs": [
					"https://www.linkedin.com/company/homehardware/about/"
				]
			},
			"uuid": "07967708-9c6d-11eb-a8b3-0242ac130003",
			"value": "Home Hardware Stores Limited"
		},
		{
			"description": "We are a dynamic company, an important player on the market of car components and accessories in Central and Eastern Europe, in full development, with over 27 years of experience in the automotive field. In Hungary we are market leaders, and in Romania we are in a continuous development, occupying an important position on the automotive components market. We are also present on the Slovak market.",
			"meta": {
				"refs": [
					"https://www.linkedin.com/company/unix-auto-srl/about/"
				]
			},
			"uuid": "079677f8-9c6d-11eb-a8b3-0242ac130003",
			"value": "UNIX Auto"
		},
		{
			"description": "Italian car dealership.",
			"meta": {
				"refs": [
					"https://www.facebook.com/pg/ginoluxurymotorsport/about/?ref=page_internal"
				]
			},
			"uuid": "eb140a8e-a2aa-11eb-bcbc-0242ac130002",
			"value": "Gino Luxury & Motorsport"
		},
		{
			"description": "Online Shopping at Gearbest for the best cell phones, electronic gadgets, toys, sporting goods, home products and apparel for geeks at unbeatable great prices.",
			"meta": {
				"refs": [
					"https://www.gearbest.com/"
				]
			},
			"uuid": "71ba847e-4b40-11e9-8646-d663bd873d93",
			"value": "Gearbest"
		}
	],
	"version": 23
}
