{
  "category": "BLS-NAICS-712",
  "description": "Industries in the Museums, Historical Sites, and Similar Institutions subsector engage in the preservation and exhibition of objects, sites, and natural wonders of historical, cultural, and/or educational value.",
  "name": "BLS-NAICS-712",
  "source": "BLS Industries at a Glance",
  "type": "BLS-NAICS-712",
  "uuid": "0ca07330-4836-11e9-8646-d663bd873d93",
  "values": [
	  {
      "description": "Test place holder",
      "meta": {
        "refs": [
          "https://www.bls.gov/iag/tgs/iag712.htm"
        ]
      },
      "uuid": "c4afc91e-48f2-11e9-8646-d663bd873d93",
      "value": "Test Museums, Historical Sites, and Similar Institutions Value"
    },
	{
      "description": "The Museum of Early Trades and Crafts is a non-profit educational institution in Madison, Morris County, New Jersey, United States.",
      "meta": {
        "refs": [
          "https://www.metc.org/"
        ]
      },
      "uuid": "29477c68-1b67-11ea-978f-2e728ce88125",
      "value": "The Museum of Early Trades and Crafts (METC)"
    },
	{
      "description": "The Smithsonian Institution, also known simply as the Smithsonian, is a group of museums and research centers administered by the government of the United States. It was founded on August 10, 1846, for the increase and diffusion of knowledge.",
      "meta": {
        "refs": [
          "https://www.si.edu/"
        ]
      },
      "uuid": "d56fc1d2-eec8-11ea-adc1-0242ac120002",
      "value": "Smithsonian Institution"
    },
	{
      "description": "The Parrish Art Museum is an art museum designed by Herzog & de Meuron Architects and located in Water Mill, New York, whereto it moved in 2012 from Southampton Village. The museum focuses extensively on work by artists from the artist colony of the South Shore and North Shore.",
      "meta": {
        "refs": [
          "https://parrishart.org/"
        ]
      },
      "uuid": "d56fc3d0-eec8-11ea-adc1-0242ac120002",
      "value": "The Parrish Art Museum"
    },
	{
      "description": "The museum owes its origin to a donation to the city of San Francisco by Chicago millionaire Avery Brundage, who was a major collector of Asian art. The Society for Asian Art, incorporated in 1958, was the group that formed specifically to gain Avery Brundage's collection. The museum opened in 1966 as a wing of the M. H. de Young Memorial Museum in Golden Gate Park. Brundage continued to make donations to the museum, including the bequest of all his remaining personal collection of Asian art on his death in 1975. In total, Brundage donated more than 7,700 Asian art objects to San Francisco.",
      "meta": {
        "refs": [
          "https://en.wikipedia.org/wiki/Asian_Art_Museum_(San_Francisco)"
        ]
      },
      "uuid": "51989f92-abc0-11e9-a2a3-2a2ae2dbcce4",
      "value": "Asian Art Museum (San Francisco)"
    }
	  ],
	"version": 3
}
