{
	"category": "BLS-NAICS-517",
	"description": "Industries in the Telecommunications subsector group establishments that provide telecommunications and the services related to that activity (e.g., telephony, including Voice over Internet Protocol (VoIP); cable and satellite television distribution services; Internet access; telecommunications reselling services). The Telecommunications subsector is primarily engaged in operating, and/or providing access to facilities for the transmission of voice, data, text, sound, and video. Transmission facilities may be based on a single technology or a combination of technologies.",
	"name": "BLS-NAICS-517",
	"source": "BLS Industries at a Glance",
	"type": "BLS-NAICS-517",
	"uuid": "70d51acc-484f-11e9-8646-d663bd873d93",
	"values": [{
			"description": "Test place holder",
			"meta": {
				"refs": [
					"https://www.bls.gov/iag/tgs/iag517.htm"
				]
			},
			"uuid": "44c85108-4901-11e9-8646-d663bd873d93",
			"value": "Test Telecommunications Value"
		},
		{
			"description": "Internet service provider in Tallahassee, Florida",
			"meta": {
				"refs": [
					"https://www.ntifl.com/"
				]
			},
			"uuid": "3a6f3dbe-4b42-11e9-8646-d663bd873d93",
			"value": "Network Tallahassee"
		},
		{
			"description": "Freedom Mobile Inc. is a Canadian wireless telecommunications provider owned by Shaw Communications. With 1,516,256 active subscribers in urban areas of Ontario, British Columbia and Alberta, it is Canada's fourth largest mobile network operator with 4.5% market share.",
			"meta": {
				"refs": [
					"https://www.freedommobile.ca/"
				]
			},
			"uuid": "85605f6a-7bda-11e9-8f9e-2a86e4085a59",
			"value": "Freedom Mobile Inc."
		},
		{
			"description": "Sprint Corporation is an American telecommunications company that provides wireless services and is an internet service provider, based in Overland Park, Kansas. It is the fourth-largest mobile network operator in the United States and serves 54 million customers as of October 2017.",
			"meta": {
				"refs": [
					"https://www.sprint.com/"
				]
			},
			"uuid": "a628acc2-abc1-11e9-a2a3-2a2ae2dbcce4",
			"value": "Sprint Corporation"
		},
		{
			"description": "Cable One, Inc. is an American Internet and cable service provider and former subsidiary of Graham Holdings Company. The company's name and current focus dates back to 1997; prior to that time the company was known as Post-Newsweek Cable.",
			"meta": {
				"refs": [
					"https://www.cableone.net/"
				]
			},
			"uuid": "483b17a4-c678-11e9-aa8c-2a2ae2dbcce4",
			"value": "Cable One"
		},
		{
			"description": "Broadband TV provider.",
			"meta": {
				"refs": [
					"https://www.astro.com.my/"
				]
			},
			"uuid": "aa3a4348-cb33-11e9-a32f-2a2ae2dbcce4",
			"value": "Astro"
		},
		{
			"description": "Vodafone Group plc is a British multinational telecommunications conglomerate with headquarters in London and Newbury, Berkshire. It predominantly operates services in the regions of Asia, Africa, Europe, and Oceania.",
			"meta": {
				"refs": [
					"https://www.vodafone.com/"
				]
			},
			"uuid": "2bf3ee04-e180-11e9-81b4-2a2ae2dbcce4",
			"value": "Vodafone Group Plc"
		},
		{
			"description": "Beeline, earlier Bee Line GSM is a telecommunications brand by company PJSC VimpelCom, founded in Russia. PJSC VimpelCom is Russia's third-largest wireless and second-largest telecommunications operator. Its headquarters is located in Moscow.",
			"meta": {
				"refs": [
					"https://en.wikipedia.org/wiki/Beeline_(brand)"
				]
			},
			"uuid": "5b2ad7f0-eeaa-11e9-81b4-2a2ae2dbcce4",
			"value": "Beeline (Bee Line GSM)"
		},
		{
			"description": "T-Mobile US, Inc., commonly shortened to T-Mobile, is a United States–based wireless network operator whose majority shareholder is the German telecommunications company Deutsche Telekom. Its headquarters are located in Bellevue, Washington, in the Seattle metropolitan area.",
			"meta": {
				"refs": [
					"https://www.t-mobile.com/"
				]
			},
			"uuid": "6808db5e-1144-11ea-8d71-362b9e155667",
			"value": "T-Mobile US, Inc."
		},
		{
			"description": "Bharti Airtel Limited, also known as Airtel, is an Indian global telecommunications services company based in Delhi, India. It operates in 18 countries across South Asia and Africa, and also in the Channel Islands.",
			"meta": {
				"refs": [
					"https://www.airtel.in/"
				]
			},
			"uuid": "e74424c4-1b6b-11ea-978f-2e728ce88125",
			"value": "Bharti Airtel Limited"
		},
		{
			"description": "Virgin Media Limited is a British company which provides telephone, television and internet services in the United Kingdom. Its headquarters are at Green Park in Reading, Berkshire. Since 2013, Virgin Media has been a subsidiary of Liberty Global plc, an international television and telecommunications company.",
			"meta": {
				"refs": [
					"https://www.virginmedia.com/"
				]
			},
			"uuid": "5f8b64c4-686f-11ea-bc55-0242ac130003",
			"value": "Virgin Media Limited"
		},
		{
			"description": "Award-Winning Business Telecoms provider in Hampshire. Aerial Direct offers Business Mobile, VoIP, Hosted telecoms, leased lines & Broadband. Connecting.",
			"meta": {
				"refs": [
					"https://www.aerial-direct.co.uk/"
				]
			},
			"uuid": "c8d8b168-691c-11ea-bc55-0242ac130003",
			"value": "Aerial Direct"
		},
		{
			"description": "Koodo Mobile is a Canadian mobile flanker brand started by Telus in 2008 and mostly oriented toward younger customers. Koodo differs from its parent Telus by not requiring a fixed term contract. Koodo currently provides postpaid, prepaid, and wireless home phone services.",
			"meta": {
				"refs": [
					"https://www.koodomobile.com/"
				]
			},
			"uuid": "6851bd84-6d23-11ea-bc55-0242ac130003",
			"value": "Koodo Mobile"
		},
		{
			"description": "Rogers Communications Inc. is a Canadian communications and media company. It operates particularly in the field of wireless communications, cable television, telephone, and Internet connectivity with significant additional telecommunications and mass media assets. The company is headquartered in Toronto.",
			"meta": {
				"refs": [
					"https://www.rogers.com/home"
				]
			},
			"uuid": "6851c310-6d23-11ea-bc55-0242ac130003",
			"value": "Rogers Communications Inc."
		},
		{
			"description": "Finastra is a financial technology company based in London. The firm was formed in late 2017 through the combination of D+H and Misys, after Vista Equity Partners acquired Misys in June 2012 and subsequently purchased D+H in 2017. Finastra is led by chief executive officer, Simon Paris was appointed in June 2018.",
			"meta": {
				"refs": [
					"https://www.finastra.com/"
				]
			},
			"uuid": "6851c43c-6d23-11ea-bc55-0242ac130003",
			"value": "Finastra"
		},
		{
			"description": "Vianet Communications P. Ltd. is one of the leading providers of high speed Internet connectivity and communications solutions for business and individuals in the greater Kathmandu Valley. Established in 1999, Vianet Communications has always remained in the forefront providing reliable and affordable Broadband Internet Services. In 2011 Vianet Communications pioneered in introducing Fiber Optics Internet or commonly known as FTTH internet service and has been successful in connecting the most number of homes and offices with FTTH in the region. We are solely focused on FTTH services and our engineers constantly strive to bring the best product and service package according to our customer needs. Vianet Communications aims to be the service provider that makes future Broadband dream a reality today.",
			"meta": {
				"refs": [
					"https://www.vianet.com.np/about/"
				]
			},
			"uuid": "d7812762-7d8b-11ea-bc55-0242ac130003",
			"value": "Vianet Communication Pvt. Ltd"
		},
		{
			"description": "Contact Dakota Carrier Network, North Dakota's leading broadband service provider.",
			"meta": {
				"refs": [
					"https://dakotacarrier.com/"
				]
			},
			"uuid": "8526b926-8fd0-11ea-bc55-0242ac130003",
			"value": "Dakota Carrier Network (DCN, LLC)"
		},
		{
			"description": "Reliance Jio Infocomm Limited is an Indian telecommunications company and subsidiary of Reliance Industries, headquartered in Mumbai, Maharashtra, India. It operates a national LTE network with coverage across all 22 telecom circles.",
			"meta": {
				"refs": [
					"https://www.jio.com/"
				]
			},
			"uuid": "8526bb38-8fd0-11ea-bc55-0242ac130003",
			"value": "Reliance Jio Infocomm Limited"
		},
		{
			"description": "Advanced Info Service Public Company Limited, is Thailand's largest GSM mobile phone operator with 39.87 million customers as of Q3 2016. Founded in April 1986, AIS started off as a computer rental business.",
			"meta": {
				"refs": [
					"http://www.ais.co.th/en/"
				]
			},
			"uuid": "8317da4e-a046-11ea-bb37-0242ac130002",
			"value": "Advanced Info Service Public Company Limited (AIS)"
		},
		{
			"description": "NTT Communications, or NTT Com, is a subsidiary of Nippon Telegraph and Telephone Corporation, the largest telecommunications company in Japan and one of the largest worldwide. NTT Com provides network management, security and solution services to consumers, corporations and governments.",
			"meta": {
				"refs": [
					"https://www.ntt.com/en/index.html"
				]
			},
			"uuid": "78b9d54e-a5cc-11ea-bb37-0242ac130002",
			"value": "NTT Communications"
		},
		{
			"description": "A1 Telekom Austria is the leading fixed and mobile network operator in Austria, with 5.4 million mobile and 2.3 million fixed-line customers.",
			"meta": {
				"refs": [
					"https://www.a1.group/en/group/about-us"
				]
			},
			"uuid": "935bf53c-b0a1-11ea-b3de-0242ac130004",
			"value": "A1 Telekom Austria"
		},
		{
			"description": "Telecom Argentina S.A. is the major local telephone company for the northern part of Argentina, including the whole of the city of Buenos Aires. Briefly known as Sociedad Licenciataria Norte S.A., it quickly changed its name, and is usually known as simply Telecom within Argentina.",
			"meta": {
				"refs": [
					"http://hogares.telecom.com.ar/"
				]
			},
			"uuid": "44c85108-4901-11e9-8646-d663bd873d93",
			"value": "Telecom Argentina S.A."
		},
		{
			"description": "Dalil is the biggest phone directory in Saudi Arabia.  With more than 5 million downloads, Dalil is the 13th most popular communications app in the Kingdom. For context, this is where Viber and Telegram rank in the US. 96% of its users are in Saudi Arabia; the remainder are in Egypt and other Arab countries.",
			"meta": {
				"refs": [
					"https://daleeli.com/en"
				]
			},
			"uuid": "15566256-4b46-11e9-8646-d663bd873d93",
			"value": "Dalil"
		}
	],
	"version": 22
}
