{
	"category": "BLS-NAICS-44-45",
	"description": "The Retail Trade sector comprises establishments engaged in retailing merchandise, generally without transformation, and rendering services incidental to the sale of merchandise. The retailing process is the final step in the distribution of merchandise; retailers are, therefore, organized to sell merchandise in small quantities to the general public. This sector comprises two main types of retailers: store and nonstore retailers. 1. Store retailers operate fixed point-of-sale locations, located and designed to attract a high volume of walk-in customers. In general, retail stores have extensive displays of merchandise and use mass-media advertising to attract customers. They typically sell merchandise to the general public for personal or household consumption, but some also serve business and institutional clients. In addition to retailing merchandise, some types of store retailers are also engaged in the provision of after-sales services, such as repair and installation. 2. Nonstore retailers, like store retailers, are organized to serve the general public, but their retailing methods differ. The establishments of this subsector reach customers and market merchandise with methods, such as the broadcasting of infomercials, the broadcasting and publishing of direct-response advertising, the publishing of paper and electronic catalogs, door-to-door solicitation, in-home demonstration, selling from portable stalls (street vendors, except food), and distribution through vending machines.",
	"name": "BLS-NAICS-44-45",
	"source": "BLS Industries at a Glance",
	"type": "BLS-NAICS-44-45",
	"uuid": "a756e8ca-4848-11e9-8646-d663bd873d93",
	"values": [{
			"description": "Test place holder",
			"meta": {
				"refs": [
					"https://www.bls.gov/iag/tgs/iag44-45.htm"
				]
			},
			"uuid": "d6c483d8-48fc-11e9-8646-d663bd873d93",
			"value": "Test Retail Trade Value"
		},
		{
			"description": "Shopify is a Canadian e-commerce company headquartered in Ottawa, Ontario. It is also the name of its proprietary e-commerce platform for online stores and retail point-of-sale systems.",
			"meta": {
				"refs": [
					"https://www.shopify.com/"
				]
			},
			"uuid": "ff53bf86-65e8-11e9-a923-1681be663d3e",
			"value": "Shopify"
		},
		{
			"description": "Sephora is a Paris–based French multinational chain of personal care and beauty stores founded in Limoges in 1969. Featuring nearly 300 brands, along with its own private label, Sephora offers beauty products including cosmetics, skincare, body, fragrance, nail color, beauty tools, and haircare.",
			"meta": {
				"refs": [
					"https://www.sephora.com/"
				]
			},
			"uuid": "79392d4e-b61c-11e9-a2a3-2a2ae2dbcce4",
			"value": "Sephora"
		},
		{
			"description": "Poshmark is a social commerce marketplace where people in the United States can buy and sell new or used clothing, shoes, and accessories. The company is headquartered in Redwood City, California.",
			"meta": {
				"refs": [
					"https://poshmark.com/"
				]
			},
			"uuid": "7939301e-b61c-11e9-a2a3-2a2ae2dbcce4",
			"value": "Poshmark"
		},
		{
			"description": "StockX is a Detroit based company primarily known for its e-commerce platform StockX.com. The company was founded by Dan Gilbert, Greg Schwartz, Josh Luber and Chris Kaufman in 2015, with an emphasis on the sneaker resale market.",
			"meta": {
				"refs": [
					"https://stockx.com/"
				]
			},
			"uuid": "7d7c80fe-bf86-11e9-9cb5-2a2ae2dbcce4",
			"value": "StockX"
		},
		{
			"description": "CafePress, Inc. is an American online retailer of stock and user-customized on demand products. The company was founded in San Mateo, California, but is now headquartered in Louisville, Kentucky, USA along with its production facility. In 2001, CafePress.com won the People's Voice Webby Award in the Commerce category.",
			"meta": {
				"refs": [
					"https://www.cafepress.com/"
				]
			},
			"uuid": "7d7c83ec-bf86-11e9-9cb5-2a2ae2dbcce4",
			"value": "CafePress, Inc."
		},
		{
			"description": "Lumber Liquidators is an American retailer of hardwood flooring.",
			"meta": {
				"refs": [
					"https://www.lumberliquidators.com/ll/home"
				]
			},
			"uuid": "61824cea-cb33-11e9-a32f-2a2ae2dbcce4",
			"value": "Lumber Liquidators Inc."
		},
		{
			"description": "Yves Rocher is a worldwide cosmetics and beauty brand, founded in 1959 by the French entrepreneur Yves Rocher in La Gacilly. The company is present in 88 countries on five continents and employs 13,500 personnel, excluding more than 215,000 through additional indirect jobs.",
			"meta": {
				"refs": [
					"https://www.yvesrocherusa.com/control/main/"
				]
			},
			"uuid": "e86649ec-ce75-11e9-a32f-2a2ae2dbcce4",
			"value": "Yves Rocher"
		},
		{
			"description": "Online furniture retialer.",
			"meta": {
				"refs": [
					"https://www.pepperfry.com/"
				]
			},
			"uuid": "a2930f1e-d356-11e9-bb65-2a2ae2dbcce4",
			"value": "Trendsutra Platform Services Private Limited"
		},
		{
			"description": "Tesco PLC trading as Tesco, is a British multinational groceries and general merchandise retailer with headquarters in Welwyn Garden City, Hertfordshire, England, United Kingdom. It is the third-largest retailer in the world measured by gross revenues and ninth-largest retailer in the world measured by revenues.",
			"meta": {
				"refs": [
					"https://www.tesco.com/"
				]
			},
			"uuid": "e7b8aec2-dd7f-11e9-8a34-2a2ae2dbcce4",
			"value": "Tesco PLC"
		},
		{
			"description": "The North West Company is a Canadian multinational grocery and retail company which operates stores in Canada's western provinces and northern territories, as well as the US states of Alaska, Hawaii, and several other countries and US territories in Oceania and the Caribbean.",
			"meta": {
				"refs": [
					"https://www.northwest.ca/"
				]
			},
			"uuid": "6511f934-e873-11e9-81b4-2a2ae2dbcce4",
			"value": "The North West Company"
		},
		{
			"description": "Menard Inc. is a chain of home improvement stores, located in the Midwestern United States. The privately held company, headquartered in Eau Claire, Wisconsin, has 350 stores in 14 states - Ohio, Michigan, Indiana, Illinois, Wisconsin, Minnesota, Iowa, Missouri, Nebraska, Kansas, South Dakota, North Dakota, Wyoming, and Kentucky. It is the third-largest home improvement chain in the United States, behind The Home Depot and Lowes.",
			"meta": {
				"refs": [
					"https://www.menards.com/main/home.html",
					"https://en.wikipedia.org/wiki/Menards"
				]
			},
			"uuid": "81a427a6-f81e-11e9-8f0b-362b9e155667",
			"value": "Menard Inc."
		},
		{
			"description": "First Aid Beauty skin care products and makeup target specific skin issues such as eczema, anti-aging, dry skin, and acne while being safe for sensitive skin.",
			"meta": {
				"refs": [
					"https://www.firstaidbeauty.com/"
				]
			},
			"uuid": "8a2cedb4-033a-11ea-8d71-362b9e155667",
			"value": "First Aid Beauty, LTD."
		},
		{
			"description": "Smith's Food and Drug was founded in 1911 in Brigham City, Utah, United States by Lorenzo J. Smith. Now a subsidiary of Kroger, it is a prominent regional supermarket chain operating in the Southwest and Northwest.",
			"meta": {
				"refs": [
					"https://www.smithsfoodanddrug.com/"
				]
			},
			"uuid": "8a2cf02a-033a-11ea-8d71-362b9e155667",
			"value": "Smith's Food and Drug"
		},
		{
			"description": "Bed Bath & Beyond Inc. is an American chain of domestic merchandise retail stores. Bed Bath & Beyond operates many stores in the United States, Puerto Rico, Canada, and Mexico. Bed Bath & Beyond was founded in 1971. It is currently part of the S&P 500 and Global 1200 Indices.",
			"meta": {
				"refs": [
					"https://www.bedbathandbeyond.com/"
				]
			},
			"uuid": "8a2cf174-033a-11ea-8d71-362b9e155667",
			"value": "Bed Bath & Beyond Inc."
		},
		{
			"description": "Orvis is an American family-owned retail and mail-order business specializing in high-end fly fishing, hunting and sporting goods. Founded in Manchester, Vermont, in 1856 by Charles F. Orvis to sell fishing tackle, it is the oldest mail-order retailer in the United States.",
			"meta": {
				"refs": [
					"https://www.orvis.com/"
				]
			},
			"uuid": "fcd8a11c-096d-11ea-8d71-362b9e155667",
			"value": "Orvis"
		},
		{
			"description": "Solara Medical Supplies, LLC provides medical devices. The Company offers insulin pumps, infusion sets, accessories, skin dressing and insertion devices, glucose and diabetes meters, syringes, and test strips. Solara Medical Supplies serves customers in the United States.",
			"meta": {
				"refs": [
					"https://www.bloomberg.com/profile/company/1626834D:US"
				]
			},
			"uuid": "fcd8a414-096d-11ea-8d71-362b9e155667",
			"value": "Solara Medical Supplies, LLC"
		},
		{
			"description": "Macy's is an American department store chain founded in 1858 by Rowland Hussey Macy. It became a division of the Cincinnati-based Federated Department Stores in 1994, as a Bloomingdale's department store chain affiliate. As of 2015, Macy's was the largest U.S. department store company by retail sales.",
			"meta": {
				"refs": [
					"https://www.macys.com/"
				]
			},
			"uuid": "1159d344-0c8a-11ea-8d71-362b9e155667",
			"value": "Macy's"
		},
		{
			"description": "Sweaty Betty is a British retailer specialising in women's activewear, founded by Tamara and Simon Hill-Norton. The brand has been ensuring that 'style meets performance' in women's activewear for over 15 years, with the aim to inspire women to find empowerment through fitness.",
			"meta": {
				"refs": [
					"https://www.sweatybetty.com/"
				]
			},
			"uuid": "5f219484-17b3-11ea-8d71-362b9e155667",
			"value": "Sweaty Betty"
		},
		{
			"description": "Created by real women for real women. Up to 30 new designs weekly online & in-store. Free delivery on all orders.",
			"meta": {
				"refs": [
					"https://www.lovebonito.com/"
				]
			},
			"uuid": "720101b2-1f8c-11ea-978f-2e728ce88125",
			"value": "Love, Bonito"
		},
		{
			"description": "Online Shopping at Gearbest for the best cell phones, electronic gadgets, toys, sporting goods, home products and apparel for geeks at unbeatable great prices.",
			"meta": {
				"refs": [
					"https://www.gearbest.com/"
				]
			},
			"uuid": "71ba847e-4b40-11e9-8646-d663bd873d93",
			"value": "Gearbest"
		}
	],
	"version": 15
}
