{
  "category": "BLS-NAICS-71",
  "description": "The Arts, Entertainment, and Recreation sector includes a wide range of establishments that operate facilities or provide services to meet varied cultural, entertainment, and recreational interests of their patrons. This sector comprises (1) establishments that are involved in producing, promoting, or participating in live performances, events, or exhibits intended for public viewing; (2) establishments that preserve and exhibit objects and sites of historical, cultural, or educational interest; and (3) establishments that operate facilities or provide services that enable patrons to participate in recreational activities or pursue amusement, hobby, and leisure-time interests. Some establishments that provide cultural, entertainment, or recreational facilities and services are classified in other sectors.",
  "name": "BLS-NAICS-71",
  "source": "BLS Industries at a Glance",
  "type": "BLS-NAICS-71",
  "uuid": "20ef7d42-47f3-11e9-b210-d663bd873d93",
  "values": [
	  {
      "description": "Test place holder",
      "meta": {
        "refs": [
          "https://www.bls.gov/iag/tgs/iag71.htm"
        ]
      },
      "uuid": "f68e21ae-48bd-11e9-8646-d663bd873d93",
      "value": "Test Arts, Entertainment, and Recreation Value"
    },
	{
      "description": "Merrill Community Arts Center is home to Woodbury Community Theatre, East Metro Symphony, Artists of Woodbury, SOS for Youth, and other local arts groups.",
      "meta": {
        "refs": [
          "https://merrillartscenter.org/"
        ]
      },
      "uuid": "4b187556-a5c7-11e9-a2a3-2a2ae2dbcce4",
      "value": "Merrill Community Arts Center"
    },
	{
      "description": "MoviePass, Inc. is an American subscription-based movie ticketing service majority-owned by Helios and Matheson Analytics. Founded in 2011 and headquartered in New York City, the service allows subscribers to purchase up to three movie tickets per month for a monthly fee.",
      "meta": {
        "refs": [
          "https://www.moviepass.com/"
        ]
      },
      "uuid": "056f0ebe-c676-11e9-aa8c-2a2ae2dbcce4",
      "value": "MoviePass"
    },
	{
      "description": "xkcd, sometimes styled XKCD, is a webcomic created in 2005 by American author Randall Munroe. The comic tagline describes it as A webcomic of romance, sarcasm, math, and language. Munroe states on the comic website that the name of the comic is not an initialism, but just a word with no phonetic pronunciation.",
      "meta": {
        "refs": [
          "https://xkcd.com/"
        ]
      },
      "uuid": "9e04c49c-ce74-11e9-a32f-2a2ae2dbcce4",
      "value": "XKCD Comic"
    },
	{
      "description": "Zynga Inc. is an American social game developer running social video game services founded in April 2007 with headquarters in San Francisco, California, United States. The company primarily focuses on mobile and social networking platforms. Zynga states its mission as connecting the world through games",
      "meta": {
        "refs": [
          "https://www.zynga.com/"
        ]
      },
      "uuid": "d0288bb2-e5fc-11e9-81b4-2a2ae2dbcce4",
      "value": "Zynga Inc."
    },
	{
      "description": "The Shakespeare Theatre of New Jersey is one of the largest professional Shakespeare companies in North America, serving over 100,000 adults and children annually.",
      "meta": {
        "refs": [
          "https://www.shakespearenj.org/"
        ]
      },
      "uuid": "0dfa6838-1b64-11ea-978f-2e728ce88125",
      "value": "The Shakespeare Theatre of New Jersey"
    },
	{
      "description": "Rooster Teeth Productions, LLC is an American entertainment company headquartered in Austin, Texas. Founded in 2003 by Burnie Burns, Matt Hullum, Geoff Ramsey, Jason Saldaña, Gus Sorola, and Joel Heyman, Rooster Teeth is a subsidiary of Otter Media, which is itself a subsidiary of WarnerMedia Entertainment, a division of AT&T's WarnerMedia.",
      "meta": {
        "refs": [
          "https://roosterteeth.com/"
        ]
      },
      "uuid": "e9f8f60e-1f8a-11ea-978f-2e728ce88125",
      "value": "Rooster Teeth Productions, LLC"
    },
	{
      "description": "The Shubert Organization is a theatrical producing organization and a major owner of theatres based in Manhattan, New York City. It was founded by the three Shubert brothers in the late 19th century. They steadily expanded, owning many theaters in New York and across the country.",
      "meta": {
        "refs": [
          "http://shubert.nyc/"
        ]
      },
      "uuid": "ec836bc0-8223-11e9-bc42-526af7764f64",
      "value": "The Shubert Organization"
    }
	  ],
	"version": 8
}
