{
  "category": "PROJECT-ZERO-AUTHOR",
  "description": "Cluster designed for tagging OSINT artifacts with relevant Google Project Zero author information. Open-source intelligence (OSINT) is data collected from publicly available sources to be used in an intelligence context. In the intelligence community, the term open refers to overt, publicly available sources (as opposed to covert or clandestine sources). It is not related to open-source software or collective intelligence.",
  "name": "OSRS Project Zero Author Index",
  "source": "OSRS DEV",
  "type": "CMCF-BLOCK-OSRS",
  "uuid": "deb05256-49bf-11ea-b77f-2e728ce88125",
  "values": [
	{
      "description": "Ian Beer is a British computer security expert and white hat hacker, currently residing in Switzerland and working for Google as part of its Project Zero. There are those who consider him as one of the best iOS hackers. Beer was the first security expert to publish his findings under the Project Zero name in the spring of 2014; at this time, the project was not yet revealed and crediting the newly discovered vulnerabilities to it led to some speculation. He is known for discovering a large number of security vulnerabilities in Apple products, including iOS, Safari and macOS, as well as helping create jailbreaks for iOS versions. One such discovery forced Apple to rewrite significant parts of the macOS and iOS kernel. Beer is also a vocal critic of Apple concerning its bug bounty program for iOS announced in 2016. The invite only program has been accused of low payouts. Beer has also criticized the company for not disclosing to its users why updates that fix the bugs should be installed.",
      "meta": {
	  "kill_chain": [
          "author-source:Project Zero Author"
        ],
        "refs": [
          "https://en.wikipedia.org/wiki/Ian_Beer",
		  "https://twitter.com/i41nbeer?lang=en"
        ],
        "synonyms": [
        "@i41nbeer"
        ]
      },
      "uuid": "d153b674-412d-11ea-b77f-2e728ce88125",
      "value": "OSRS CVE Author Index: Ian Beer"
    },
	{
      "description": "Security researcher in Google Project Zero. Author of Attacking Network Protocols. Tweets are my own etc.",
      "meta": {
	  "kill_chain": [
          "author-source:Project Zero Author"
        ],
        "refs": [
          "https://twitter.com/tiraniddo?lang=en",
		  "https://tyranidslair.blogspot.com"
        ],
        "synonyms": [
        "@tiraniddo"
        ]
      },
      "uuid": "d153b93a-412d-11ea-b77f-2e728ce88125",
      "value": "OSRS CVE Author Index: James Forshaw"
    },
	{
      "description": "Security Researcher @Google Project Zero | Reverse engineering is my favorite. Love all things bytes, assembly, and glitter. My opinions are my own.",
      "meta": {
	  "kill_chain": [
          "author-source:Project Zero Author"
        ],
        "refs": [
          "https://twitter.com/maddiestone?lang=en",
		  "https://github.com/maddiestone"
        ],
        "synonyms": [
        "@maddiestone"
        ]
      },
      "uuid": "d153ba8e-412d-11ea-b77f-2e728ce88125",
      "value": "OSRS CVE Author Index: Maddie Stone"
    },
	{
      "description": "I’m a recent graduate of Stanford, having studied Computer Science with a focus in Systems and Security. This blog is a collection of some of my security-related activities, mostly focused on macOS and iOS. Affiliated with Google Project Zero.",
      "meta": {
	  "kill_chain": [
          "author-source:Project Zero Author"
        ],
        "refs": [
          "https://github.com/bazad",
		  "https://bazad.github.io/",
		  "https://twitter.com/_bazad?lang=en"
        ],
        "synonyms": [
        "bazad",
		"@_bazad"
        ] 
      },
      "uuid": "f6917ef0-b0ac-11ea-b3de-0242ac130004",
      "value": "OSRS CVE Author Index: Brandon Azad"
    },
	{
      "description": "Ben Hawkes is a founding member and team lead of Google's 'Project Zero' security research team, where he helped develop the team's technical strategy and vulnerability disclosure policies. As a researcher, Ben discovered many vulnerabilities across a range of different software platforms (including Android, Linux, and Windows), and published research focused on vulnerability analysis and software exploitation. Prior to Project Zero, Ben worked for four years on the security of Google's product launches, with a particular focus on virtualization and sandboxing.",
      "meta": {
	  "kill_chain": [
          "author-source:Project Zero Author"
        ],
        "refs": [
          "https://www.crunchbase.com/person/ben-hawkes",
		  "https://www.linkedin.com/in/ben-hawkes-256b103/"
        ]
      },
      "uuid": "e0513db8-fda7-11ea-adc1-0242ac120002",
      "value": "OSRS CVE Author Index: Ben Hawkes"
    },
	{
      "description": "Senior Information Security Engineer at Google. Zurich, Canton of Zurich, Switzerland.",
      "meta": {
	  "kill_chain": [
          "author-source:Project Zero Author"
        ],
        "refs": [
          "https://googleprojectzero.blogspot.com/2020/10/enter-the-vault-auth-issues-hashicorp-vault.html",
		  "https://www.linkedin.com/in/felix-wilhelm-298984133/?originalSubdomain=ch"
        ]
      },
      "uuid": "fc8f35d0-0e1d-11eb-adc1-0242ac120002",
      "value": "OSRS CVE Author Index: Felix Wilhelm"
    },
	{
      "description": "Security researcher and CVE author. Information Security Specialist - Intern at Trend Micro.",
      "meta": {
	  "kill_chain": [
          "author-source:Project Zero Author"
        ],
        "refs": [
          "https://twitter.com/5aelo?lang=en",
		  "https://github.com/saelo",
		  "https://saelo.github.io"
        ],
		"synonyms": [
		"@5aelo"
		]
      },
      "uuid": "d153bcaa-412d-11ea-b77f-2e728ce88125",
      "value": "OSRS CVE Author Index: Samuel Groß"
    }
	  ],
	"version": 2
}
