{
  "category": "MITRE-COMBINED-ATK-EXECUTION",
  "description": "The adversary is trying to run malicious code. Execution consists of techniques that result in adversary-controlled code running on a local or remote system. Techniques that run malicious code are often paired with techniques from all other tactics to achieve broader goals, like exploring a network or stealing data. For example, an adversary might use a remote access tool to run a PowerShell script that does Remote System Discovery.",
  "name": "OSRS Combined MITRE ATT&CK Matrix - Execution",
  "source": "MITRE ATT&CK Matrices Windows, Linux, AWS, GCP, Azure, and SaaS",
  "type": "OSRS-CMCF-BLOCK-H",
  "uuid": "feda733c-2817-11ea-978f-2e728ce88125",
  "values": [
	{
      "description": "The Microsoft Connection Manager Profile Installer (CMSTP.exe) is a command-line program used to install Connection Manager service profiles. CMSTP.exe accepts an installation information file (INF) as a parameter and installs a service profile leveraged for remote access connections. Adversaries may supply CMSTP.exe with INF files infected with malicious commands. Similar to Regsvr32 OR Squiblydoo, CMSTP.exe may be abused to load and execute DLLs and (or) COM scriptlets (SCT) from remote servers. This execution may also bypass AppLocker and other whitelisting defenses since CMSTP.exe is a legitimate, signed Microsoft application. CMSTP.exe can also be abused to Bypass User Account Control and execute arbitrary commands from a malicious INF through an auto-elevated COM interface.",
      "meta": {
	  "kill_chain": [
          "osrs-combined-mitre-atk:Execution"
        ],
        "refs": [
          "https://attack.mitre.org/tactics/TA0002/",
          "https://attack.mitre.org/techniques/T1191/"
        ]
      },
      "uuid": "f6e40228-298a-11ea-978f-2e728ce88125",
      "value": "OSRS Combined MITRE ATK Execution: Windows T1191 CMSTP"
    },
	{
      "description": "Vulnerabilities can exist in software due to unsecure coding practices that can lead to unanticipated behavior. Adversaries can take advantage of certain vulnerabilities through targeted exploitation for the purpose of arbitrary code execution. Oftentimes the most valuable exploits to an offensive toolkit are those that can be used to obtain code execution on a remote system because they can be used to gain access to that system. Users will expect to see files related to the applications they commonly used to do work, so they are a useful target for exploit research and development because of their high utility.",
      "meta": {
	  "kill_chain": [
          "osrs-combined-mitre-atk:Execution"
        ],
        "refs": [
          "https://attack.mitre.org/tactics/TA0002/",
          "https://attack.mitre.org/techniques/T1203"
        ]
      },
      "uuid": "8db30fd0-3176-11ea-978f-2e728ce88125",
      "value": "OSRS Combined MITRE ATK Execution: Windows T1203 Exploitation for Client Execution"
    },
	{
      "description": "Vulnerabilities can exist in software due to unsecure coding practices that can lead to unanticipated behavior. Adversaries can take advantage of certain vulnerabilities through targeted exploitation for the purpose of arbitrary code execution. Oftentimes the most valuable exploits to an offensive toolkit are those that can be used to obtain code execution on a remote system because they can be used to gain access to that system. Users will expect to see files related to the applications they commonly used to do work, so they are a useful target for exploit research and development because of their high utility.",
      "meta": {
	  "kill_chain": [
          "osrs-combined-mitre-atk:Execution"
        ],
        "refs": [
          "https://attack.mitre.org/tactics/TA0002/",
          "https://attack.mitre.org/techniques/T1203"
        ]
      },
      "uuid": "8db31232-3176-11ea-978f-2e728ce88125",
      "value": "OSRS Combined MITRE ATK Execution: Linux T1203 Exploitation for Client Execution"
    },
	{
      "description": "The Graphical User Interfaces (GUI) is a common way to interact with an operating system. Adversaries may use a system's GUI during an operation, commonly through a remote interactive session such as Remote Desktop Protocol, instead of through a Command-Line Interface, to search for information and execute files via mouse double-click events, the Windows Run command , or other potentially difficult to monitor interactions.",
      "meta": {
	  "kill_chain": [
          "osrs-combined-mitre-atk:Execution"
        ],
        "refs": [
          "https://attack.mitre.org/tactics/TA0002/",
          "https://attack.mitre.org/techniques/T1061"
        ]
      },
      "uuid": "d734e3a4-3176-11ea-aec2-2e728ce88125",
      "value": "OSRS Combined MITRE ATK Execution: Windows T1061 Graphical User Interface"
    },
	{
      "description": "The Graphical User Interfaces (GUI) is a common way to interact with an operating system. Adversaries may use a system's GUI during an operation, commonly through a remote interactive session such as Remote Desktop Protocol, instead of through a Command-Line Interface, to search for information and execute files via mouse double-click events, the Windows Run command , or other potentially difficult to monitor interactions.",
      "meta": {
	  "kill_chain": [
          "osrs-combined-mitre-atk:Execution"
        ],
        "refs": [
          "https://attack.mitre.org/tactics/TA0002/",
          "https://attack.mitre.org/techniques/T1061"
        ]
      },
      "uuid": "d734e624-3176-11ea-aec2-2e728ce88125",
      "value": "OSRS Combined MITRE ATK Execution: Linux T1061 Graphical User Interface"
    },
	{
      "description": "Adversaries may use scripts to aid in operations and perform multiple actions that would otherwise be manual. Scripting is useful for speeding up operational tasks and reducing the time required to gain access to critical resources. Some scripting languages may be used to bypass process monitoring mechanisms by directly interacting with the operating system at an API level instead of calling other programs. Common scripting languages for Windows include VBScript and PowerShell but could also be in the form of command-line batch scripts.",
      "meta": {
	  "kill_chain": [
          "osrs-combined-mitre-atk:Execution"
        ],
        "refs": [
          "https://attack.mitre.org/tactics/TA0002/",
          "https://attack.mitre.org/techniques/T1064"
        ]
      },
      "uuid": "491c9fac-3177-11ea-aec2-2e728ce88125",
      "value": "OSRS Combined MITRE ATK Execution: Windows T1064 Scripting"
    },
	{
      "description": "Adversaries may use scripts to aid in operations and perform multiple actions that would otherwise be manual. Scripting is useful for speeding up operational tasks and reducing the time required to gain access to critical resources. Some scripting languages may be used to bypass process monitoring mechanisms by directly interacting with the operating system at an API level instead of calling other programs. Common scripting languages for Windows include VBScript and PowerShell but could also be in the form of command-line batch scripts.",
      "meta": {
	  "kill_chain": [
          "osrs-combined-mitre-atk:Execution"
        ],
        "refs": [
          "https://attack.mitre.org/tactics/TA0002/",
          "https://attack.mitre.org/techniques/T1064"
        ]
      },
      "uuid": "491ca36c-3177-11ea-aec2-2e728ce88125",
      "value": "OSRS Combined MITRE ATK Execution: Linux T1064 Scripting"
    },
	{
      "description": "Third-party applications and software deployment systems may be in use in the network environment for administration purposes (e.g., SCCM, VNC, HBSS, Altiris, etc.). If an adversary gains access to these systems, then they may be able to execute code.",
      "meta": {
	  "kill_chain": [
          "osrs-combined-mitre-atk:Execution"
        ],
        "refs": [
          "https://attack.mitre.org/tactics/TA0002/",
          "https://attack.mitre.org/techniques/T1072"
        ]
      },
      "uuid": "f6e40228-298a-11ea-978f-2e728ce88125",
      "value": "OSRS Combined MITRE ATK Execution: Windows T1072 Third-party Software"
    },
	{
      "description": "Third-party applications and software deployment systems may be in use in the network environment for administration purposes (e.g., SCCM, VNC, HBSS, Altiris, etc.). If an adversary gains access to these systems, then they may be able to execute code.",
      "meta": {
	  "kill_chain": [
          "osrs-combined-mitre-atk:Execution"
        ],
        "refs": [
          "https://attack.mitre.org/tactics/TA0002/",
          "https://attack.mitre.org/techniques/T1072"
        ]
      },
      "uuid": "f6e404a8-298a-11ea-978f-2e728ce88125",
      "value": "OSRS Combined MITRE ATK Execution: Linux T1072 Third-party Software"
    },
	{
      "description": "An adversary may rely upon specific actions by a user in order to gain execution. This may be direct code execution, such as when a user opens a malicious executable delivered via Spearphishing Attachment with the icon and apparent extension of a document file. It also may lead to other execution techniques, such as when a user clicks on a link delivered via Spearphishing Link that leads to exploitation of a browser or application vulnerability via Exploitation for Client Execution. Adversaries may use several types of files that require a user to execute them, including .doc, .pdf, .xls, .rtf, .scr, .exe, .lnk, .pif, and .cpl.",
      "meta": {
	  "kill_chain": [
          "osrs-combined-mitre-atk:Execution"
        ],
        "refs": [
          "https://attack.mitre.org/tactics/TA0002/",
          "https://attack.mitre.org/techniques/T1204"
        ]
      },
      "uuid": "e9f37770-3177-11ea-aec2-2e728ce88125",
      "value": "OSRS Combined MITRE ATK Execution: Windows T1204 User Execution"
    },
	{
      "description": "An adversary may rely upon specific actions by a user in order to gain execution. This may be direct code execution, such as when a user opens a malicious executable delivered via Spearphishing Attachment with the icon and apparent extension of a document file. It also may lead to other execution techniques, such as when a user clicks on a link delivered via Spearphishing Link that leads to exploitation of a browser or application vulnerability via Exploitation for Client Execution. Adversaries may use several types of files that require a user to execute them, including .doc, .pdf, .xls, .rtf, .scr, .exe, .lnk, .pif, and .cpl.",
      "meta": {
	  "kill_chain": [
          "osrs-combined-mitre-atk:Execution"
        ],
        "refs": [
          "https://attack.mitre.org/tactics/TA0002/",
          "https://attack.mitre.org/techniques/T1204"
        ]
      },
      "uuid": "e9f37b62-3177-11ea-aec2-2e728ce88125",
      "value": "OSRS Combined MITRE ATK Execution: Linux T1204 User Execution"
    },
	{
      "description": "The trap command allows programs and shells to specify commands that will be executed upon receiving interrupt signals. A common situation is a script allowing for graceful termination and handling of common keyboard interrupts like ctrl+c and ctrl+d. Adversaries can use this to register code to be executed when the shell encounters specific interrupts either to gain execution or as a persistence mechanism. Trap commands are of the following format trap command list signals where command list will be executed when signals are received.",
      "meta": {
	  "kill_chain": [
          "osrs-combined-mitre-atk:Execution"
        ],
        "refs": [
          "https://attack.mitre.org/tactics/TA0002/",
          "https://attack.mitre.org/techniques/T1154"
        ]
      },
      "uuid": "f8c1730e-3309-11ea-978f-2e728ce88125",
      "value": "OSRS Combined MITRE ATK Execution: Linux T1154 Trap"
    },
	{
      "description": "Adversaries can hide a program's true filetype by changing the extension of a file. With certain file types (specifically this does not work with .app extensions), appending a space to the end of a filename will change how the file is processed by the operating system. For example, if there is a Mach-O executable file called evil.bin, when it is double clicked by a user, it will launch Terminal.app and execute. If this file is renamed to evil.txt, then when double clicked by a user, it will launch with the default text editing application (not executing the binary). However, if the file is renamed to evil.txt  (note the space at the end), then when double clicked by a user, the true file type is determined by the OS and handled appropriately and the binary will be executed.",
      "meta": {
	  "kill_chain": [
          "osrs-combined-mitre-atk:Execution"
        ],
        "refs": [
          "https://attack.mitre.org/tactics/TA0002/",
          "https://attack.mitre.org/techniques/T1151"
        ]
      },
      "uuid": "f8c17782-3309-11ea-978f-2e728ce88125",
      "value": "OSRS Combined MITRE ATK Execution: Linux T1151 Space after Filename"
    },
	{
      "description": "The source command loads functions into the current shell or executes files in the current context. This is often used to make certain features or functions available to a shell or to update a specific shell environment.",
      "meta": {
	  "kill_chain": [
          "osrs-combined-mitre-atk:Execution"
        ],
        "refs": [
          "https://attack.mitre.org/tactics/TA0002/",
          "https://attack.mitre.org/techniques/T1153"
        ]
      },
      "uuid": "f8c17a98-3309-11ea-978f-2e728ce88125",
      "value": "OSRS Combined MITRE ATK Execution: Linux T1153 Source"
    },
	{
      "description": "On Linux and macOS systems, multiple methods are supported for creating pre-scheduled and periodic background jobs: cron, at, and launchd. Unlike Scheduled Task on Windows systems, job scheduling on Linux-based systems cannot be done remotely unless used in conjunction within an established remote session, like secure shell (SSH).",
      "meta": {
	  "kill_chain": [
          "osrs-combined-mitre-atk:Execution"
        ],
        "refs": [
          "https://attack.mitre.org/tactics/TA0002/",
          "https://attack.mitre.org/techniques/T1168"
        ]
      },
      "uuid": "f8c17c00-3309-11ea-978f-2e728ce88125",
      "value": "OSRS Combined MITRE ATK Execution: Linux T1168 Local Job Scheduling"
    },
	{
      "description": "Command-line interfaces provide a way of interacting with computer systems and is a common feature across many types of operating system platforms. One example command-line interface on Windows systems is cmd, which can be used to perform a number of tasks including execution of other software. Command-line interfaces can be interacted with locally or remotely via a remote desktop application, reverse shell session, etc. Commands that are executed run with the current permission level of the command-line interface process unless the command includes process invocation that changes permissions context for that execution (e.g. Scheduled Task).",
      "meta": {
	  "kill_chain": [
          "osrs-combined-mitre-atk:Execution"
        ],
        "refs": [
          "https://attack.mitre.org/tactics/TA0002/",
          "https://attack.mitre.org/techniques/T1059"
        ]
      },
      "uuid": "1a3a06ee-330b-11ea-978f-2e728ce88125",
      "value": "OSRS Combined MITRE ATK Execution: Windows T1059 Command-Line Interface"
    },
	{
      "description": "Compiled HTML files (.chm) are commonly distributed as part of the Microsoft HTML Help system. CHM files are compressed compilations of various content such as HTML documents, images, and scripting and (or) web related programming languages such VBA, JScript, Java, and ActiveX. CHM content is displayed using underlying components of the Internet Explorer browser loaded by the HTML Help executable program (hh.exe).",
      "meta": {
	  "kill_chain": [
          "osrs-combined-mitre-atk:Execution"
        ],
        "refs": [
          "https://attack.mitre.org/tactics/TA0002/",
          "https://attack.mitre.org/techniques/T1223"
        ]
      },
      "uuid": "1a3a0946-330b-11ea-978f-2e728ce88125",
      "value": "OSRS Combined MITRE ATK Execution: Windows T1223 Compiled HTML File"
    },
	{
      "description": "Adversaries may use the Windows Component Object Model (COM) and Distributed Component Object Model (DCOM) for local code execution or to execute on remote systems as part of lateral movement.",
      "meta": {
	  "kill_chain": [
          "osrs-combined-mitre-atk:Execution"
        ],
        "refs": [
          "https://attack.mitre.org/tactics/TA0002/",
          "https://attack.mitre.org/techniques/T1175"
        ]
      },
      "uuid": "1a3a0a9a-330b-11ea-978f-2e728ce88125",
      "value": "OSRS Combined MITRE ATK Execution: Windows T1175 Component Object Model and Distributed COM"
    },
	{
      "description": "Windows Control Panel items are utilities that allow users to view and adjust computer settings. Control Panel items are registered executable (.exe) or Control Panel (.cpl) files, the latter are actually renamed dynamic-link library (.dll) files that export a CPlApplet function. Control Panel items can be executed directly from the command line, programmatically via an application programming interface (API) call, or by simply double-clicking the file.",
      "meta": {
	  "kill_chain": [
          "osrs-combined-mitre-atk:Execution"
        ],
        "refs": [
          "https://attack.mitre.org/tactics/TA0002/",
          "https://attack.mitre.org/techniques/T1196"
        ]
      },
      "uuid": "1a3a0d42-330b-11ea-978f-2e728ce88125",
      "value": "OSRS Combined MITRE ATK Execution: Windows T1196 Control Panel Items"
    },
	{
      "description": "Windows Dynamic Data Exchange (DDE) is a client-server protocol for one-time and (or) continuous inter-process communication (IPC) between applications. Once a link is established, applications can autonomously exchange transactions consisting of strings, warm data links (notifications when a data item changes), hot data links (duplications of changes to a data item), and requests for command execution.",
      "meta": {
	  "kill_chain": [
          "osrs-combined-mitre-atk:Execution"
        ],
        "refs": [
          "https://attack.mitre.org/tactics/TA0002/",
          "https://attack.mitre.org/techniques/T1173"
        ]
      },
      "uuid": "1a3a0eaa-330b-11ea-978f-2e728ce88125",
      "value": "OSRS Combined MITRE ATK Execution: Windows T1173 Dynamic Data Exchange"
    },
	{
      "description": "Adversary tools may directly use the Windows application programming interface (API) to execute binaries. Functions such as the Windows API CreateProcess will allow programs and scripts to start other processes with proper path and argument parameters.",
      "meta": {
	  "kill_chain": [
          "osrs-combined-mitre-atk:Execution"
        ],
        "refs": [
          "https://attack.mitre.org/tactics/TA0002/",
          "https://attack.mitre.org/techniques/T1106"
        ]
      },
      "uuid": "1a3a1076-330b-11ea-978f-2e728ce88125",
      "value": "OSRS Combined MITRE ATK Execution: Windows T1106 Execution through API"
    },
	{
      "description": "The Windows module loader can be instructed to load DLLs from arbitrary local paths and arbitrary Universal Naming Convention (UNC) network paths. This functionality resides in NTDLL.dll and is part of the Windows Native API which is called from functions like CreateProcess(), LoadLibrary(), etc. of the Win32 API.",
      "meta": {
	  "kill_chain": [
          "osrs-combined-mitre-atk:Execution"
        ],
        "refs": [
          "https://attack.mitre.org/tactics/TA0002/",
          "https://attack.mitre.org/techniques/T1129"
        ]
      },
      "uuid": "1a3a11d4-330b-11ea-978f-2e728ce88125",
      "value": "OSRS Combined MITRE ATK Execution: Windows T1129 Execution through Module Load"
    },
	{
      "description": "InstallUtil is a command-line utility that allows for installation and uninstallation of resources by executing specific installer components specified in .NET binaries. InstallUtil is located in the .NET directories on a Windows system. InstallUtil.exe is digitally signed by Microsoft.",
      "meta": {
	  "kill_chain": [
          "osrs-combined-mitre-atk:Execution"
        ],
        "refs": [
          "https://attack.mitre.org/tactics/TA0002/",
          "https://attack.mitre.org/techniques/T1118"
        ]
      },
      "uuid": "1a3a130a-330b-11ea-978f-2e728ce88125",
      "value": "OSRS Combined MITRE ATK Execution: Windows T1118 InstallUtil"
    },
	{
      "description": "The Windows security subsystem is a set of components that manage and enforce the security policy for a computer or domain. The Local Security Authority (LSA) is the main component responsible for local security policy and user authentication. The LSA includes multiple dynamic link libraries (DLLs) associated with various other security functions, all of which run in the context of the LSA Subsystem Service (LSASS) lsass.exe process.",
      "meta": {
	  "kill_chain": [
          "osrs-combined-mitre-atk:Execution"
        ],
        "refs": [
          "https://attack.mitre.org/tactics/TA0002/",
          "https://attack.mitre.org/techniques/T1177"
        ]
      },
      "uuid": "1a3a1436-330b-11ea-978f-2e728ce88125",
      "value": "OSRS Combined MITRE ATK Execution: Windows T1177 LSASS Driver"
    },
	{
      "description": "Mshta.exe is a utility that executes Microsoft HTML Applications (HTA). HTA files have the file extension .hta. HTAs are standalone applications that execute using the same models and technologies of Internet Explorer, but outside of the browser.",
      "meta": {
	  "kill_chain": [
          "osrs-combined-mitre-atk:Execution"
        ],
        "refs": [
          "https://attack.mitre.org/tactics/TA0002/",
          "https://attack.mitre.org/techniques/T1170"
        ]
      },
      "uuid": "1a3a16d4-330b-11ea-978f-2e728ce88125",
      "value": "OSRS Combined MITRE ATK Execution: Windows T1170 Mshta"
    },
	{
      "description": "PowerShell is a powerful interactive command-line interface and scripting environment included in the Windows operating system. Adversaries can use PowerShell to perform a number of actions, including discovery of information and execution of code. Examples include the Start-Process cmdlet which can be used to run an executable and the Invoke-Command cmdlet which runs a command locally or on a remote computer.",
      "meta": {
	  "kill_chain": [
          "osrs-combined-mitre-atk:Execution"
        ],
        "refs": [
          "https://attack.mitre.org/tactics/TA0002/",
          "https://attack.mitre.org/techniques/T1086"
        ]
      },
      "uuid": "225e03aa-330d-11ea-978f-2e728ce88125",
      "value": "OSRS Combined MITRE ATK Execution: Windows T1086 PowerShell"
    },
	{
      "description": "Regsvcs and Regasm are Windows command-line utilities that are used to register .NET Component Object Model (COM) assemblies. Both are digitally signed by Microsoft.",
      "meta": {
	  "kill_chain": [
          "osrs-combined-mitre-atk:Execution"
        ],
        "refs": [
          "https://attack.mitre.org/tactics/TA0002/",
          "https://attack.mitre.org/techniques/T1121"
        ]
      },
      "uuid": "225e06ca-330d-11ea-978f-2e728ce88125",
      "value": "OSRS Combined MITRE ATK Execution: Windows T1121 Regsvcs and (or) Regasm"
    },
	{
      "description": "Regsvr32.exe is a command-line program used to register and unregister object linking and embedding controls, including dynamic link libraries (DLLs), on Windows systems. Regsvr32.exe can be used to execute arbitrary binaries.",
      "meta": {
	  "kill_chain": [
          "osrs-combined-mitre-atk:Execution"
        ],
        "refs": [
          "https://attack.mitre.org/tactics/TA0002/",
          "https://attack.mitre.org/techniques/T1117"
        ]
      },
      "uuid": "225e0850-330d-11ea-978f-2e728ce88125",
      "value": "OSRS Combined MITRE ATK Execution: Windows T1117 Regsvr32"
    },
	{
      "description": "The rundll32.exe program can be called to execute an arbitrary binary. Adversaries may take advantage of this functionality to proxy execution of code to avoid triggering security tools that may not monitor execution of the rundll32.exe process because of whitelists or false positives from Windows using rundll32.exe for normal operations.",
      "meta": {
	  "kill_chain": [
          "osrs-combined-mitre-atk:Execution"
        ],
        "refs": [
          "https://attack.mitre.org/tactics/TA0002/",
          "https://attack.mitre.org/techniques/T1085"
        ]
      },
      "uuid": "225e0aee-330d-11ea-978f-2e728ce88125",
      "value": "OSRS Combined MITRE ATK Execution: Windows T1085 Rundll32"
    },
	{
      "description": "Utilities such as at and schtasks, along with the Windows Task Scheduler, can be used to schedule programs or scripts to be executed at a date and time. A task can also be scheduled on a remote system, provided the proper authentication is met to use RPC and file and printer sharing is turned on. Scheduling a task on a remote system typically required being a member of the Administrators group on the remote system.",
      "meta": {
	  "kill_chain": [
          "osrs-combined-mitre-atk:Execution"
        ],
        "refs": [
          "https://attack.mitre.org/tactics/TA0002/",
          "https://attack.mitre.org/techniques/T1053"
        ]
      },
      "uuid": "225e0c38-330d-11ea-978f-2e728ce88125",
      "value": "OSRS Combined MITRE ATK Execution: Windows T1053 Scheduled Task"
    },
	{
      "description": "Adversaries may execute a binary, command, or script via a method that interacts with Windows services, such as the Service Control Manager. This can be done by either creating a new service or modifying an existing service. This technique is the execution used in conjunction with New Service and Modify Existing Service during service persistence or privilege escalation.",
      "meta": {
	  "kill_chain": [
          "osrs-combined-mitre-atk:Execution"
        ],
        "refs": [
          "https://attack.mitre.org/tactics/TA0002/",
          "https://attack.mitre.org/techniques/T1035"
        ]
      },
      "uuid": "225e0d78-330d-11ea-978f-2e728ce88125",
      "value": "OSRS Combined MITRE ATK Execution: Windows T1035 Service Execution"
    },
	{
      "description": "Binaries signed with trusted digital certificates can execute on Windows systems protected by digital signature validation. Several Microsoft signed binaries that are default on Windows installations can be used to proxy execution of other files. This behavior may be abused by adversaries to execute malicious files that could bypass application whitelisting and signature validation on systems. This technique accounts for proxy execution methods that are not already accounted for within the existing techniques.",
      "meta": {
	  "kill_chain": [
          "osrs-combined-mitre-atk:Execution"
        ],
        "refs": [
          "https://attack.mitre.org/tactics/TA0002/",
          "https://attack.mitre.org/techniques/T1218"
        ]
      },
      "uuid": "225e0eae-330d-11ea-978f-2e728ce88125",
      "value": "OSRS Combined MITRE ATK Execution: Windows T1218 Signed Binary Proxy Execution"
    },
	{
      "description": "Scripts signed with trusted certificates can be used to proxy execution of malicious files. This behavior may bypass signature validation restrictions and application whitelisting solutions that do not account for use of these scripts.",
      "meta": {
	  "kill_chain": [
          "osrs-combined-mitre-atk:Execution"
        ],
        "refs": [
          "https://attack.mitre.org/tactics/TA0002/",
          "https://attack.mitre.org/techniques/T1216"
        ]
      },
      "uuid": "225e1142-330d-11ea-978f-2e728ce88125",
      "value": "OSRS Combined MITRE ATK Execution: Windows T1216 Signed Script Proxy Execution"
    },
	{
      "description": "There are many utilities used for software development related tasks that can be used to execute code in various forms to assist in development, debugging, and reverse engineering. These utilities may often be signed with legitimate certificates that allow them to execute on a system and proxy execution of malicious code through a trusted process that effectively bypasses application whitelisting defensive solutions.",
      "meta": {
	  "kill_chain": [
          "osrs-combined-mitre-atk:Execution"
        ],
        "refs": [
          "https://attack.mitre.org/tactics/TA0002/",
          "https://attack.mitre.org/techniques/T1127"
        ]
      },
      "uuid": "225e13ea-330d-11ea-978f-2e728ce88125",
      "value": "OSRS Combined MITRE ATK Execution: Windows T1127 Trusted Developer Utilities"
    },
	{
      "description": "Windows Management Instrumentation (WMI) is a Windows administration feature that provides a uniform environment for local and remote access to Windows system components. It relies on the WMI service for local and remote access and the server message block (SMB) and Remote Procedure Call Service (RPCS) for remote access. RPCS operates over port 135.",
      "meta": {
	  "kill_chain": [
          "osrs-combined-mitre-atk:Execution"
        ],
        "refs": [
          "https://attack.mitre.org/tactics/TA0002/",
          "https://attack.mitre.org/techniques/T1047"
        ]
      },
      "uuid": "225e1548-330d-11ea-978f-2e728ce88125",
      "value": "OSRS Combined MITRE ATK Execution: Windows T1047 Windows Management Instrumentation"
    },
	{
      "description": "Windows Remote Management (WinRM) is the name of both a Windows service and a protocol that allows a user to interact with a remote system (e.g., run an executable, modify the Registry, modify services). It may be called with the winrm command or by any number of programs such as PowerShell.",
      "meta": {
	  "kill_chain": [
          "osrs-combined-mitre-atk:Execution"
        ],
        "refs": [
          "https://attack.mitre.org/tactics/TA0002/",
          "https://attack.mitre.org/techniques/T1028"
        ]
      },
      "uuid": "9e9f3ed8-330e-11ea-978f-2e728ce88125",
      "value": "OSRS Combined MITRE ATK Execution: Windows T1028 Windows Remote Management"
    },
	{
      "description": "Extensible Stylesheet Language (XSL) files are commonly used to describe the processing and rendering of data within XML files. To support complex operations, the XSL standard includes support for embedded scripting in various languages.",
      "meta": {
	  "kill_chain": [
          "osrs-combined-mitre-atk:Execution"
        ],
        "refs": [
          "https://attack.mitre.org/tactics/TA0002/",
          "https://attack.mitre.org/techniques/T1220"
        ]
      },
      "uuid": "9e9f4130-330e-11ea-978f-2e728ce88125",
      "value": "OSRS Combined MITRE ATK Execution: Windows T1220 XSL Script Processing"
    },
	{
      "description": "Command-line interfaces provide a way of interacting with computer systems and is a common feature across many types of operating system platforms. One example command-line interface on Windows systems is cmd, which can be used to perform a number of tasks including execution of other software. Command-line interfaces can be interacted with locally or remotely via a remote desktop application, reverse shell session, etc. Commands that are executed run with the current permission level of the command-line interface process unless the command includes process invocation that changes permissions context for that execution (e.g. Scheduled Task). Adversaries may use command-line interfaces to interact with systems and execute other software during the course of an operation.",
      "meta": {
	  "kill_chain": [
          "osrs-combined-mitre-atk:Execution"
        ],
        "refs": [
          "https://attack.mitre.org/tactics/TA0002/",
          "https://attack.mitre.org/techniques/T1059/"
        ]
      },
      "uuid": "f6e404a8-298a-11ea-978f-2e728ce88125",
      "value": "OSRS Combined MITRE ATK Execution: Linux T1059 Command-Line Interface"
    }
	  ],
	"version": 1
}
