{
  "category": "MITRE-COMBINED-ATK-LAT-MOVE",
  "description": "The adversary is trying to move through your environment. Lateral Movement consists of techniques that adversaries use to enter and control remote systems on a network. Following through on their primary objective often requires exploring the network to find their target and subsequently gaining access to it. Reaching their objective often involves pivoting through multiple systems and accounts to gain. Adversaries might install their own remote access tools to accomplish Lateral Movement or use legitimate credentials with native network and operating system tools, which may be stealthier.",
  "name": "OSRS Combined MITRE ATT&CK Matrix - Lateral Movement",
  "source": "MITRE ATT&CK Matrices Windows, Linux, AWS, GCP, Azure, and SaaS",
  "type": "OSRS-CMCF-BLOCK-H",
  "uuid": "feda733c-2817-11ea-978f-2e728ce88125",
  "values": [
	  {
      "description": "Adversaries may deploy malicious software to systems within a network using application deployment systems employed by enterprise administrators. The permissions required for this action vary by system configuration; local credentials may be sufficient with direct access to the deployment server, or specific domain credentials may be required. However, the system may require an administrative account to log in or to perform software deployment. Access to a network-wide or enterprise-wide software deployment system enables an adversary to have remote code execution on all systems that are connected to such a system. The access may be used to laterally move to systems, gather information, or cause a specific effect, such as wiping the hard drives on all endpoints.",
      "meta": {
	  "kill_chain": [
          "osrs-combined-mitre-atk:Lateral Movement"
        ],
        "refs": [
          "https://attack.mitre.org/tactics/TA0001/",
          "https://attack.mitre.org/techniques/T1017/"
        ]
      },
      "uuid": "51d5d7d6-29a6-11ea-978f-2e728ce88125",
      "value": "OSRS Combined MITRE ATK Lateral Movement Windows: T1017 Application Deployment Software"
    },
{
      "description": "Adversaries may deploy malicious software to systems within a network using application deployment systems employed by enterprise administrators. The permissions required for this action vary by system configuration; local credentials may be sufficient with direct access to the deployment server, or specific domain credentials may be required. However, the system may require an administrative account to log in or to perform software deployment. Access to a network-wide or enterprise-wide software deployment system enables an adversary to have remote code execution on all systems that are connected to such a system. The access may be used to laterally move to systems, gather information, or cause a specific effect, such as wiping the hard drives on all endpoints.",
      "meta": {
	  "kill_chain": [
          "osrs-combined-mitre-atk:Lateral Movement"
        ],
        "refs": [
          "https://attack.mitre.org/tactics/TA0001/",
          "https://attack.mitre.org/techniques/T1017/"
        ]
      },
      "uuid": "51d5d7d6-29a6-11ea-978f-2e728ce88125",
      "value": "OSRS Combined MITRE ATK Lateral Movement Linux: T1017 Application Deployment Software"
    },
{
      "description": "Adversaries may use application access tokens to bypass the typical authentication process and access restricted accounts, information, or services on remote systems. These tokens are typically stolen from users and used in lieu of login credentials. Application access tokens are used to make authorized API requests on behalf of a user and are commonly used as a way to access resources in cloud-based applications and software-as-a-service (SaaS). OAuth is one commonly implemented framework that issues tokens to users for access to systems. These frameworks are used collaboratively to verify the user and determine what actions the user is allowed to perform. Once identity is established, the token allows actions to be authorized, without passing the actual credentials of the user. Therefore, compromise of the token can grant the adversary access to resources of other sites through a malicious application. For example, with a cloud-based email service once an OAuth access token is granted to a malicious application, it can potentially gain long-term access to features of the user account if a refresh token enabling background access is awarded. With an OAuth access token an adversary can use the user-granted REST API to perform functions such as email searching and contact enumeration. Compromised access tokens may be used as an initial step in compromising other services. For example, if a token grants access to a victim’s primary email, the adversary may be able to extend access to all other services which the target subscribes by triggering forgotten password routines. Direct API access through a token negates the effectiveness of a second authentication factor and may be immune to intuitive countermeasures like changing passwords. Access abuse over an API channel can be difficult to detect even from the service provider end, as the access can still align well with a legitimate workflow.",
      "meta": {
	  "kill_chain": [
          "osrs-combined-mitre-atk:Lateral Movement"
        ],
        "refs": [
          "https://attack.mitre.org/tactics/TA0001/",
          "https://attack.mitre.org/techniques/T1527/"
        ]
      },
      "uuid": "51d5d7d6-29a6-11ea-978f-2e728ce88125",
      "value": "OSRS Combined MITRE ATK Lateral Movement SaaS: T1527 Application Access Token"
    }
	  ],
	"version": 1
}
