{
  "category": "MITRE-COMBINED-ATK-DEF-EVASION",
  "description": "The adversary is trying to avoid being detected. Defense Evasion consists of techniques that adversaries use to avoid detection throughout their compromise. Techniques used for defense evasion include uninstalling (or) disabling security software or obfuscating (or) encrypting data and scripts. Adversaries also leverage and abuse trusted processes to hide and masquerade their malware. Other tactics’ techniques are cross-listed here when those techniques include the added benefit of subverting defenses.",
  "name": "OSRS Combined MITRE ATT&CK Matrix - Defense Evasion",
  "source": "MITRE ATT&CK Matrices Windows, Linux, AWS, GCP, Azure, and SaaS",
  "type": "OSRS-CMCF-BLOCK-H",
  "uuid": "feda733c-2817-11ea-978f-2e728ce88125",
  "values": [
	  {
      "description": "Windows uses access tokens to determine the ownership of a running process. A user can manipulate access tokens to make a running process appear as though it belongs to someone other than the user that started the process. When this occurs, the process also takes on the security context associated with the new token. For example, Microsoft promotes the use of access tokens as a security best practice. Administrators should log in as a standard user but run their tools with administrator privileges using the built-in access token manipulation command runas.",
      "meta": {
	  "kill_chain": [
          "osrs-combined-mitre-atk:Defense Evasion"
        ],
        "refs": [
          "https://attack.mitre.org/tactics/TA0005/",
          "https://attack.mitre.org/techniques/T1134/"
        ]
      },
      "uuid": "06c5fd6e-299e-11ea-978f-2e728ce88125",
      "value": "OSRS Combined MITRE ATK Defense Evasion Windows: T1134 Access Token Manipulation"
    },
{
      "description": "Adversaries can use binary padding to add junk data and change the on-disk representation of malware without affecting the functionality or behavior of the binary. This will often increase the size of the binary beyond what some security tools are capable of handling due to file size limitations. Binary padding effectively changes the checksum of the file and can also be used to avoid hash-based blacklists and static anti-virus signatures. The padding used is commonly generated by a function to create junk data and then appended to the end or applied to sections of malware. Increasing the file size may decrease the effectiveness of certain tools and detection capabilities that are not designed or configured to scan large files. This may also reduce the likelihood of being collected for analysis. Public file scanning services, such as VirusTotal, limits the maximum size of an uploaded file to be analyzed.",
      "meta": {
	  "kill_chain": [
          "osrs-combined-mitre-atk:Defense Evasion"
        ],
        "refs": [
          "https://attack.mitre.org/tactics/TA0005/",
          "https://attack.mitre.org/techniques/T1009/"
        ]
      },
      "uuid": "06c5ffe4-299e-11ea-978f-2e728ce88125",
      "value": "OSRS Combined MITRE ATK Defense Evasion Linux: T1009 Binary Padding"
    },
{
      "description": "Adversaries may use more than one remote access tool with varying command and control protocols or credentialed access to remote services so they can maintain access if an access mechanism is detected or mitigated. If one type of tool is detected and blocked or removed as a response but the organization did not gain a full understanding of the adversary's tools and access, then the adversary will be able to retain access to the network. Adversaries may also attempt to gain access to Valid Accounts to use External Remote Services such as external VPNs as a way to maintain access despite interruptions to remote access tools deployed within a target network. Adversaries may also retain access through cloud-based infrastructure and applications. Use of a Web Shell is one such way to maintain access to a network through an externally accessible Web server.",
      "meta": {
	  "kill_chain": [
          "osrs-combined-mitre-atk:Defense Evasion"
        ],
        "refs": [
          "https://attack.mitre.org/tactics/TA0005/",
          "https://attack.mitre.org/techniques/T1108/"
        ]
      },
      "uuid": "06c602d2-299e-11ea-978f-2e728ce88125",
      "value": "OSRS Combined MITRE ATK Defense Evasion AWS: T1108 Redundant Access"
    },	  
{
      "description": "Adversaries may use more than one remote access tool with varying command and control protocols or credentialed access to remote services so they can maintain access if an access mechanism is detected or mitigated. If one type of tool is detected and blocked or removed as a response but the organization did not gain a full understanding of the adversary's tools and access, then the adversary will be able to retain access to the network. Adversaries may also attempt to gain access to Valid Accounts to use External Remote Services such as external VPNs as a way to maintain access despite interruptions to remote access tools deployed within a target network. Adversaries may also retain access through cloud-based infrastructure and applications. Use of a Web Shell is one such way to maintain access to a network through an externally accessible Web server.",
      "meta": {
	  "kill_chain": [
          "osrs-combined-mitre-atk:Defense Evasion"
        ],
        "refs": [
          "https://attack.mitre.org/tactics/TA0005/",
          "https://attack.mitre.org/techniques/T1108/"
        ]
      },
      "uuid": "06c6043a-299e-11ea-978f-2e728ce88125",
      "value": "OSRS Combined MITRE ATK Defense Evasion GCP: T1108 Redundant Access"
    },	  	  
	  {
      "description": "Adversaries may use more than one remote access tool with varying command and control protocols or credentialed access to remote services so they can maintain access if an access mechanism is detected or mitigated. If one type of tool is detected and blocked or removed as a response but the organization did not gain a full understanding of the adversary's tools and access, then the adversary will be able to retain access to the network. Adversaries may also attempt to gain access to Valid Accounts to use External Remote Services such as external VPNs as a way to maintain access despite interruptions to remote access tools deployed within a target network. Adversaries may also retain access through cloud-based infrastructure and applications. Use of a Web Shell is one such way to maintain access to a network through an externally accessible Web server.",
      "meta": {
	  "kill_chain": [
          "osrs-combined-mitre-atk:Defense Evasion"
        ],
        "refs": [
          "https://attack.mitre.org/tactics/TA0005/",
          "https://attack.mitre.org/techniques/T1108/"
        ]
      },
      "uuid": "06c60584-299e-11ea-978f-2e728ce88125",
      "value": "OSRS Combined MITRE ATK Defense Evasion Azure: T1108 Redundant Access"
    },		  
{
      "description": "Adversaries may use application access tokens to bypass the typical authentication process and access restricted accounts, information, or services on remote systems. These tokens are typically stolen from users and used in lieu of login credentials. Application access tokens are used to make authorized API requests on behalf of a user and are commonly used as a way to access resources in cloud-based applications and software-as-a-service (SaaS). OAuth is one commonly implemented framework that issues tokens to users for access to systems. These frameworks are used collaboratively to verify the user and determine what actions the user is allowed to perform. Once identity is established, the token allows actions to be authorized, without passing the actual credentials of the user. Therefore, compromise of the token can grant the adversary access to resources of other sites through a malicious application. For example, with a cloud-based email service once an OAuth access token is granted to a malicious application, it can potentially gain long-term access to features of the user account if a refresh token enabling background access is awarded. With an OAuth access token an adversary can use the user-granted REST API to perform functions such as email searching and contact enumeration. Compromised access tokens may be used as an initial step in compromising other services. For example, if a token grants access to a victim’s primary email, the adversary may be able to extend access to all other services which the target subscribes by triggering forgotten password routines. Direct API access through a token negates the effectiveness of a second authentication factor and may be immune to intuitive countermeasures like changing passwords. Access abuse over an API channel can be difficult to detect even from the service provider end, as the access can still align well with a legitimate workflow.",
      "meta": {
	  "kill_chain": [
          "osrs-combined-mitre-atk:Defense Evasion"
        ],
        "refs": [
          "https://attack.mitre.org/tactics/TA0005/",
          "https://attack.mitre.org/techniques/T1527/"
        ]
      },
      "uuid": "06c606c4-299e-11ea-978f-2e728ce88125",
      "value": "OSRS Combined MITRE ATK Defense Evasion SaaS: T1527 Application Access Token"
    }
	  ],
	"version": 1
}
