{
  "category": "MITRE-COMBINED-ATK-EXECUTION",
  "description": "The adversary is trying to run malicious code. Execution consists of techniques that result in adversary-controlled code running on a local or remote system. Techniques that run malicious code are often paired with techniques from all other tactics to achieve broader goals, like exploring a network or stealing data. For example, an adversary might use a remote access tool to run a PowerShell script that does Remote System Discovery.",
  "name": "OSRS Combined MITRE ATT&CK Matrix",
  "source": "MITRE ATT&CK Matrices Windows, Linux, AWS, GCP, Azure, and SaaS",
  "type": "OSRS-CMCF-BLOCK-H",
  "uuid": "feda733c-2817-11ea-978f-2e728ce88125",
  "values": [
	  {
      "description": "The Microsoft Connection Manager Profile Installer (CMSTP.exe) is a command-line program used to install Connection Manager service profiles. CMSTP.exe accepts an installation information file (INF) as a parameter and installs a service profile leveraged for remote access connections. Adversaries may supply CMSTP.exe with INF files infected with malicious commands. Similar to Regsvr32 OR Squiblydoo, CMSTP.exe may be abused to load and execute DLLs and (or) COM scriptlets (SCT) from remote servers. This execution may also bypass AppLocker and other whitelisting defenses since CMSTP.exe is a legitimate, signed Microsoft application. CMSTP.exe can also be abused to Bypass User Account Control and execute arbitrary commands from a malicious INF through an auto-elevated COM interface.",
      "meta": {
	  "kill_chain": [
          "osrs-combined-mitre-atk:Execution"
        ],
        "refs": [
          "https://attack.mitre.org/tactics/TA0002/",
          "https://attack.mitre.org/techniques/T1191/"
        ]
      },
      "uuid": "f6e40228-298a-11ea-978f-2e728ce88125",
      "value": "OSRS Combined MITRE ATK Execution Windows: T1191 CMSTP"
    },
{
      "description": "Command-line interfaces provide a way of interacting with computer systems and is a common feature across many types of operating system platforms. One example command-line interface on Windows systems is cmd, which can be used to perform a number of tasks including execution of other software. Command-line interfaces can be interacted with locally or remotely via a remote desktop application, reverse shell session, etc. Commands that are executed run with the current permission level of the command-line interface process unless the command includes process invocation that changes permissions context for that execution (e.g. Scheduled Task). Adversaries may use command-line interfaces to interact with systems and execute other software during the course of an operation.",
      "meta": {
	  "kill_chain": [
          "osrs-combined-mitre-atk:Execution"
        ],
        "refs": [
          "https://attack.mitre.org/tactics/TA0002/",
          "https://attack.mitre.org/techniques/T1059/"
        ]
      },
      "uuid": "f6e404a8-298a-11ea-978f-2e728ce88125",
      "value": "OSRS Combined MITRE ATK Execution Linux: T1059 Command-Line Interface"
    }
	  ],
	"version": 1
}
