{
  "category": "OPS-FW-INFO-DRAWBACKS",
  "description": "Combined Operational Frameworks informational drawbacks within the OSRS CMCF are related to instances where information from an artifiact is found missing, irrelevant, not congruent, or not complete based on the information supplied within the artifact.  The informational drawbacks allow for the tracking of these types of informational defficiencies.",
  "name": "OSRS Ops Framework Informational Drawbacks",
  "source": "OSRS DEV",
  "type": "OSRS-CMCF-BLOCK-H",
  "uuid": "feda733c-2817-11ea-978f-2e728ce88125",
  "values": [
	{
      "description": "The artifact contains Combined Operational Frameworks related information that is uncertain, indefinite, or unclear of character or meaning.",
      "meta": {
	  "kill_chain": [
          "info-drawbacks:Ops Framework"
        ],
        "refs": [
          "https://github.com/open-source-rs/Comprehensive-Modular-Cybersecurity-Framework-CMCF"
        ]
      },
      "uuid": "ee1923b0-29c3-11ea-978f-2e728ce88125",
      "value": "OSRS CMCF Combined Ops Frameworks Informational Drawback: Combined Ops Fw Artifact Vauge"
    },
	{
      "description": "The artifact contains Combined Operational Frameworks related information that does not align to the current Combined Operational Frameworks mapping.",
      "meta": {
	  "kill_chain": [
          "info-drawbacks:Ops Framework"
        ],
        "refs": [
          "https://github.com/open-source-rs/Comprehensive-Modular-Cybersecurity-Framework-CMCF"
        ]
      },
      "uuid": "5a8d01e0-469f-11ea-b77f-2e728ce88125",
      "value": "OSRS CMCF Combined Ops Frameworks Informational Drawback: Combined Ops Fw No Relevant Category"
    },
	{
      "description": "The artifact relates to Combined Operational Frameworks information but does not sufficiently describe the event with enough context to understand which Combined Operational Frameworks to map to and so therefore the information that would explain this context is considered missing (or) absent.",
      "meta": {
	  "kill_chain": [
          "info-drawbacks:Ops Framework"
        ],
        "refs": [
          "https://github.com/open-source-rs/Comprehensive-Modular-Cybersecurity-Framework-CMCF"
        ]
      },
      "uuid": "5a8d0488-469f-11ea-b77f-2e728ce88125",
      "value": "OSRS CMCF Combined Ops Frameworks Informational Drawback: Combined Ops Fw Information Absent"
    }
	  ],
	"version": 1
}
